{
	"categories": {
		"person": "人物",
		"Jinling": "金陵十二钗｜Jinling, Twelve Beauties of MainRegister",
		"zhuyao": "其他主要人物",
		"fuce": "金陵十二钗副册",
		"youfuce": "金陵十二钗又副册",
		"guan": "红楼十二官",
		"event": "事件",
		"location": "地点"
	},
	"data": {
		"nodes": [
			{
				"label": "共读西厢——————Bao-yu and Dai-yu read the ‘Western Chamber’ together",
				"value": 2,
				"id": 3779,
				"categories": ["event"],
				"info": "宝玉到沁芳桥边桃花底下看《西厢记》，正准备将落花送进池中，黛玉说她早已准备了一个花冢，正来葬花。黛玉发现《西厢记》，宝玉借书中词句，向黛玉表白。黛玉觉得冒犯了自己尊严，引起口角，宝玉赔礼讨饶，黛玉也借《西厢记》词句，嘲笑了宝玉。于是两人收拾落花，葬到花冢里去。——————Bao -- Yu went to see the 'Western Chamber' under the peach blossom beside Qinfang Bridge and was preparing to send the fallen flowers into the pool. Dai -- Yu said that she had already prepared a flower mound and was coming to bury the flowers. Dai- Yu found the 'Western Chamber', Bao - Yu borrowed words and phrases from the book and expressed her love to Dai- Yu. Dai- Yu feels offended by her dignity and causes a quarrel. Bao - Yu apologizes. Dai- Yu also USES the phrase 'Western Chamber' to laugh at Bao - Yu. So they picked up the fallen flowers and buried them in the tomb.(CHAPTER 23)"
			},
			{
				"label": "林如海捐馆扬州城——————Lin Ru-hai is conveyed to his last resting-place in Soochow",
				"value": 4,
				"id": 3780,
				"categories": ["event"],
				"info": "林如海考中探花后，迁为兰台寺大夫，钦点为扬州巡盐御史。后身染重病于九月初三日巳时而亡。——————Lin Ru-hai, who became the second highest imperial examinations, moved to the Lantai Temple and served as the imperial historian of Yangzhou. Later, Mr. Lin fell ill and died on the third at ten in the morning in September.(CHAPTER 14)"
			},
			{
				"label": "海棠诗社————The Crab-flower poetry club",
				"value": 8,
				"id": 3781,
				"categories": ["event"],
				"info": "初秋季节，贾探春提议邀集大观园中有文采的人所组的诗社。诗社成立目的 旨在“宴集诗人於风庭月榭；醉飞吟盏於帘杏溪桃，作诗吟辞以显大观园众姊妹之文采不让桃李须眉。”诗社成员 有林黛玉、薛宝钗、史湘云、贾迎春、贾探春、贾惜春、贾宝玉及李纨。稻香老农(李纨)为社长，菱洲(迎春)、藕榭（惜春）为副社长，一人出题，一人监场。——————During the early fall season, A happy inspiration prompts tan-flower Club. It seems a great pity that the romantic courts and pavilions of our Garden should not echo with the jocund Carousal of pavilions, and its flowering groves and blossoming banksides not become places of wine and song. Why should the founding of poetry clubs be the sole prerogative of the whiskered male, and female versificators allowed a voice in the tunable concert of the muses only when some enlightened patriarch sees fit to invite them?（CHAPTER 37）"
			},
			{
				"label": "紫鹃试玉——————Nightingale tests Jade Boy with a startling message",
				"value": 2,
				"id": 3782,
				"categories": ["event"],
				"info": "紫鹃想试试宝玉对黛玉的情意，就单独骗他说自己要和黛玉回苏州，宝玉本来不信，但在紫鹃一番骗小孩的语言下，痴情迷糊的宝玉还是相信了。就这一骗弄得宝玉是发了疯一样，指着墙上画中的小船说那是来接林妹妹的船……后来弄得大家都慌了，最后在紫鹃诉说下才好起来。真是个可爱迷糊又痴情的人。——————Nightingale wants to try out Bao- Yu's affection for Dai- Yu, so he tricked The Bao- Yu into saying he wants to Soochow with Dai- Yu. Bao- Yu originally did not believe, but Nightingale continued to confuse The Bao- Yu with a lie, infatuated Bao- Yu or believe. This trick made Bao-Yu crazy, pointing to the boat in the picture on the wall, she said that it was the boat that came to pick up Dai-Yu... After that, they all got very frightened, and got well at last under Nightingale. What a lovely, confused, spoony person……（CHAPTER 57）"
			},
			{
				"label": "魇魔姊弟——————Two cousins are subjected by witchcraft to the assaults of demons",
				"value": 6,
				"id": 3783,
				"categories": ["event"],
				"info": "贾环用油灯烫了宝玉后，王夫人骂了赵姨娘没好好管教。赵姨娘受气后，正巧马道婆来和她闲聊。赵姨娘在闲聊过程中暴露出了对凤姐和宝玉的不满，马道婆于是献计用魇魔法暗里算计。赵姨娘就出钱央求马道婆实施了这一毒招。话分两头，宝玉挨烫了之后，林妹妹来看他，凤姐等也来凑趣。凤sister开玩笑要林妹妹做贾家的媳妇。后来众人要走，宝玉要林妹妹站住说句话，正想说体己话，林妹妹羞得要走，就在此时马道婆作法生效了，宝玉闹头痛，跟着凤姐也发了狂。二人请医延药，眼见不济事，来了癞头和尚和跛足道人，用宝玉佩戴的宝玉救了二人。——————Jia Huan scald Bao- Yu with oil lamp, Mrs. Wang scold Aunt Zhao for not discipline Huan. After Zhao aunt gas begged Mother Ma to pay the poison to harm Xi-Feng and Bao-Yu. After Baoyu was burned, Sister Lin came to see him, and sister Feng joined in. Chicken sister joke to Dai- Yu jia daughter-in-law. Suddenly Mother Ma's evil magic takes effect, and Bao-Yu has a headache, followed by Xi-Feng. It didn't help either of them to see the doctor. Luckily, monk with bald head and a lame Host came to rescue them with jade worn by Bao-Yu. This was also evidenced by many of them.（CHAPTER 25）"
			},
			{
				"label": "羞笼红麝串——————Chaplet of medicine-beads becomes a source of embarrassment",
				"value": 2,
				"id": 3784,
				"categories": ["event"],
				"info": "然后是元春从宫中赏出很多东西，每个人都有，但是宝玉和宝钗的是一样的，黛玉的和三姐妹的是一样的，宝玉很是纳闷，看见宝钗便要看那红麝串，宝钗生的珠圆玉润，串子不容易退下来，宝玉看宝钗的臂膀产生的种种幻想，被宝钗看出，于是宝钗害羞的将串子抛给宝玉，这场景恰巧被黛玉看到。——————Yuan -- Chun gave a lot of things to everyone from the palace, but The Bao-Yu's and Bao-Chai's were the same, and the Dai-Yu's and the three sisters' were the same, so Bao-Yu was very puzzled. Bao- Yu saw Bao-chai and had to look at her medicine- Beads. Bao- Yu look at the arms of the Bao- Chai produced a lot of fantasy, by the Bao- Chai see. So the Bao- Chai shy beads thrown to the Bao- Yu, this scene just by Dai- Yu see.（CHAPTER 28）"
			},
			{
				"label": "麒麟伏双星——————a lost kylin is the clue to a happy marriage",
				"value": 3,
				"id": 3785,
				"categories": ["event"],
				"info": "可能暗示某两人白头偕老，或者是某两个人老了以后双双遇到，结合到一起。其中女方应该是史湘云（她也有一个金麒麟），但男方是谁，有点说不准，可能是卫若兰，可能是贾宝玉，也有可能是别的什么人。——————It may imply that two people have grown old together, or that two people meet and bond when they grow old. The woman is believed to be Shi Xiang-yun (who has a gold unicorn), but it is unclear who the man is.（CHAPTER 31）"
			},
			{
				"label": "纳鸳鸯——————Jia-she wanted to make faithful as a concubine",
				"value": 6,
				"id": 3786,
				"categories": ["event"],
				"info": "鸳鸯是贾母的贴身丫环，除了负责贾母的日常起居饮食之外，还掌握着贾母钱箱的钥匙，对贾母的钱财了如指掌。可以说谁娶了鸳鸯，谁就等于掌握了贾母的私房钱，可惜，知子莫若母，贾赦的计谋被贾母识穿，最终未能得逞。——————An awkward person is given an awkward mission，and a faithful maid vows faithfulness unto death（CHAPTER 46）"
			},
			{
				"label": "撵晴雯——————Drive Skybright out",
				"value": 4,
				"id": 3787,
				"categories": ["event"],
				"info": "晴雯长得风流灵巧，眉眼儿有点像林黛玉，口齿伶俐，针线活尤好，曾为宝玉病补雀金裘。 她本是赖妈妈家的丫鬟，因得贾母喜爱，固把她赐给宝玉。因娇生惯养，养成得理不饶人的性格。一次王夫人进园子看见她打骂小丫鬟，觉得她不合世家教养，再加上王善保家的等小人进谗，王夫人在她病得“四五日水米不曾沾牙”的情况下，从炕上拉下来，硬给撵了出去（放出去）。宝玉偷偷前去探望，晴雯深为感动。当夜，晴雯悲惨地死去。听小丫头说晴雯死后做了芙蓉花神，宝玉便作了篇长长的《芙蓉女儿诔》寄托哀思。——————Skybright is handsome and smart. Her eyes and eyebrows are like Lin Daiyu. She is articulate and good at sewing. Because she had been spoiled, she had developed an unforgiving character. Once Lady Wang came into the garden and saw her beating and scolding other little maids. She felt that she was not well-brought up by her family and that she listened to others' slanders.When she was very ill, Mrs. Wang pulled herself off the kang and forced her out. Bao- Yu secretly went to visit, Skybright was deeply moved. Skybright died tragically that night.（CHAPTER 77-78）"
			},
			{
				"label": "偷娶尤二姐——————Jia Lian secretly married Second Sister You",
				"value": 4,
				"id": 3788,
				"categories": ["event"],
				"info": "尤二姐模样标致，温柔和顺。贾珍馋涎妻妹的美貌，对尤二姐无微不至，当他玩腻后，就把她让给了贾琏。贾琏因惧怕王熙凤的淫威，只得偷偷娶尤二姐为二房，并把她安置在荣国府外，但不久被王熙凤发现，在她的借刀杀人计谋下，尤二姐备受折磨，当胎儿被庸医打下后，她绝望地吞金自尽。——————Second sister You was pretty, gentle and obedient. Jia Zhen, who was very beautiful and greedy, took such good care of You that when he grew tired of playing with her, he gave her up to Jia Lian. Jia Lian, fearing Wang Xifeng, can only secretly marry a second sister and place her outside the Rong Mansion, but is soon discovered by Wang Xifeng. In The torture of Wang Xifeng, you two elder sister's fetus was quack harm after abortion, she swallowed gold in despair.(CHAPTER 64/68)"
			},
			{
				"label": "软语救贾琏——————Gentle words saved Jia Lian",
				"value": 3,
				"id": 3789,
				"categories": ["event"],
				"info": "巧姐儿长水痘，贾府供奉天花娘娘，贾琏与多浑虫之妻相好，可是12天后巧姐儿病好了，贾琏搬回去住，凤姐命令平儿仔细搜查贾琏的行李，平儿搜到一缕青丝，却对凤姐说什么都没有。——————Jia Lian's daughter developed chicken pox, and Jia Lian moved out of her home. During this period, Jia Lian became friendly with the wife of Droopy Duo. Twelve days later, Jia Lian recovered and moved back in. Xi-feng ordered Patience to search Jia Lian's luggage carefully.（CHAPTER 21）"
			},
			{
				"label": "大闹学堂——————classroom in an uproar",
				"value": 7,
				"id": 3790,
				"categories": ["event"],
				"info": "宝玉准备入塾，袭人为他收拾妥当，叮嘱宝玉功课不必过于操劳。宝玉向家中长辈辞行之后，又独去向黛玉作辞，不辞宝钗。上学期间，宝玉与秦钟因平日就玩的很好且宝玉认为他们都是一类人就形影不离，引发不少风言风语。秦钟又因与“香怜”befriend而引发贾家远亲金荣（贾璜之妻的侄儿）争风吃醋，适逢代儒外出，其孙儿贾瑞因私心处理不公，引起纠纷进而引发学堂内的一场大混战，最后以金荣被迫磕头道歉而告一段落。——————A son is admonished and Li Gui receives an alarming warning，A pupil is abused and Tealeaf throws the classroom in an uproar.(CHAPTER 9)"
			},
			{
				"label": "拐卖巧姐——————Qiao-jie abducted",
				"value": 2,
				"id": 3791,
				"categories": ["event"],
				"info": " 王仁要送巧姐，正为此烦恼，臭味相投，找贾芹喝酒，席间大骂贾府无情无义，贾琏不是东西，妹妹不争气，给王家抹黑，让自己蒙羞。贾芹见时机成熟，说动王仁，这样的动乱时机，谁会顾及一个小女孩的生死，莫若途中乘机买了巧姐，谎称说路上病死了，也就完事了。这样既不会祸害王家，也不会得罪王子腾，也给了贾府一个交代，贾琏和王熙凤是万难出来了，根本不会再有人过问此事。王仁仗着酒气，权衡利弊，一咬牙一跺脚一横心，同意了。这就是王仁和贾芹，一个狠舅，一个奸兄的由来，一个是枉为人，一个假情假意，他们决计要卖了巧姐，报仇雪恨，顺便发笔横财。王熙凤到血崩之症流血而死之时恐怕也没有想到，她的亲人会如此绝情，会如此来算计她的女儿。人性的复杂和丑恶，由此可见。——————Jia fu decline, Wang Ren and Jia Qin to sell Qiao- Jie, revenge, incidentally make a windfall. When Wang Xifeng bleeding to death of the blood collapse, I am afraid that she did not think that her relatives will be so unfeeling, will be so to calculate her daughter. This shows the complexity and ugliness of human nature. (Others written)"
			},
			{
				"label": "乱判葫芦案——————The wronged gourd case",
				"value": 5,
				"id": 3792,
				"categories": ["event"],
				"info": "贾宝玉的表兄薛蟠在应天府与一个小户人家的公子冯渊同时看上了一个被拐的丫头香菱，拐子（就是人口贩子）又一奴卖二主将香菱同时卖于二人，被发觉后二人皆不要退钱只要香菱，薛蟠家大势大，在与冯渊争执时纵奴行凶将其打死，薛蟠本定进京，打死冯渊之后没事人一样就进京探亲了，冯家告上官府。偏生应天府尹是受贾府推介的贾雨村，贾雨村在深知内情的昔日葫芦庙庙祝今日应天府门子的指导下，将这一起人命官司草草了结。——————The Bottle-gourd girl meets an unfortunate young man，And the Bottle-gourd monk settles a protracted lawsuit（CHAPTER 4）"
			},
			{
				"label": "毒设相思局——————Malicious set a lovesickness bureau",
				"value": 5,
				"id": 3793,
				"categories": ["event"],
				"info": "贾敬的寿辰宁府排家宴，贾瑞在园子里碰见熙凤就起色心。此后几次到荣府都没找到熙凤。贾瑞见到凤姐后，凤姐要他晚上在西穿堂相见。贾瑞按约定晚上钻入穿堂，腊月天寒，白冻一晚而归。代儒惩罚贾瑞跪在院内读文章，打了三四十大板，不许吃饭。第二次又在凤姐房后小过道里那座空房子，被贾蓉、贾蔷捉弄。 贾瑞不听跛道人之言，正照风月宝鉴，一命呜呼。——————Jia Jing birthday chenning house row family dinner, Jia Rui met Xi- Feng in the garden and said love. After several times to rong fu did not find Xi-Feng. Jia Rui saw Xi- Feng, Xi- Feng asked him to meet at night in the west hall. Gary waited for her at night as promised, but Xi-Feng didn't show up after a cold night. His grandfather punished Jia Rui kneeling in the hospital to read the article, played three or four ten board, not allowed Jia Rui to eat. The second time in Xi- Feng house behind a small empty house, jia Rong, Jia Qiang played tricks. Instead of listening to the Taoist priest, Jia Rui died in the face of Feng Yueh Pao Chien-a mirror.(CHAPTER 12)"
			},
			{
				"label": "情赠茜香罗——————A crimson cummerbund becomes a pledge of friendship",
				"value": 2,
				"id": 3794,
				"categories": ["event"],
				"info": "主要讲的就是宝玉初次遇见蒋玉菡，两人相互觉得彼此投缘，于是宝玉将自己的扇子坠送给蒋玉菡，蒋玉菡将北静王送的大红汗巾子送给宝玉，作为交换，宝玉将自己的松花色汗巾子结下送给他。——————Bao-yu meets Jiang Yuhan for the first time, and the two feel connected to each other, so Bao-Yu sends Her fan pendant to Jiang Yuhan. Jiang Yuhan gives the red belt that the king of North Jing gives To Bao-Yu, in exchange, Bao-Yu gives Jiang Yuhan her loose design and color belt.(CHAPTER 28)"
			},
			{
				"label": "勇救薛蟠——————Liu Xianglian rescued Xue Pan",
				"image": "no image",
				"value": 2,
				"id": 3795,
				"categories": ["event"],
				"info": "时过境迁，二十回后柳湘莲再度登场，这大概是五年后了。这一次，他性格里的更多光彩得到展现。刚才陈述的是他“惩强”的一面，接下来该介绍他“扶弱”的一面了。遭薛蟠调戏时，他已经“又气又恨”了，但看到薛蟠财物被劫，性命堪忧的时候，他又奋不顾身，挺身斗贼。这样的义举，即使放在今天的法制社会里，也是值得表彰褒奖的英雄之事。他还宽容了薛蟠的过错，与之结拜了生死弟兄，又体现出这位江湖侠客的宽广胸襟。——————When Xue Pan's property was robbed and his life was worrying, Liu Xianglian fought hard and stood up to fight the thief. He also tolerated Xue Pan's fault, and he became a beloved brother of life and death, which also reflected the broad-mindedness of this knight."
			},
			{
				"label": "倪二轻财尚义——————Ni Er's Righteousness",
				"value": 2,
				"id": 3796,
				"categories": ["event"],
				"info": "贾芸想要去他的舅舅卜世仁哪里佘一些麝香、冰片之类的东西，拿去贿赂凤姐，让凤姐给他一个差事，但是卜世人没有同意。贾芸回家的路上遇见了醉金刚倪二刚刚收完利息，贾芸不小心撞上了倪二，倪二本想大骂，后来看见是贾芸就没有骂人，还跟贾芸闲聊了几句，闲聊之中贾芸把事情跟倪二说了，没想到倪二很慷慨的就借给了贾芸钱，倪二本事的放高利贷的，但是这回去没有收利息，借据还是贾芸硬要给的，所以曹公称之为“义侠”。——————The Drunken Diamond shows nobility of character in handling his money, and the Quiet-voiced Girl provides material for fantasy by losing her handkerchief.(CHAPTER 24)"
			},
			{
				"label": "神游太虚幻境——————Jia Bao-yu visits the Land of Illusion",
				"value": 3,
				"id": 3797,
				"categories": ["event"],
				"info": "贾宝玉观赏会芳园的梅花后，在侄媳秦可卿的卧房里睡午觉，做了个神游太虚幻境的美梦。梦中，他遇到了袅娜翩跹的警仙幻姑。仙姑邀请宝玉到她居住的太虚幻境一游。到了那里，忽见有一座牌坊，上书“太虚幻境”四个大字。进入二层门内，只见两边配殿内有“痴情司”， “结怨司”， “朝啼司”， “暮哭司”，“春感司”，“秋悲司”等诸司。宝玉在“薄命司”里看了金陵十二钗正册、副册、又副册。入室，闻一缕幽香，品“千红一窟”茶，饮“万艳同悲”酒，聆听《红楼梦》仙曲十二支。仙姑又将其妹秦可卿许配给宝玉，并授以云雨之事。宝玉与可卿柔情缱绻，软语温存，难解难分。次日，二人携手游玩，至迷津处，被雷声惊醒。————————Bao-yu took a nap in the bedroom of his nephew Qin Keqing and made a dream of traveling THE LAND OF ILLUSION. DEPARTMENT OF FOND INFATUATION. There are multiple parts, namely DEPARTMENT OF CRUEL REJECTION, DEPARTMENT OF EARLY MORNING WEEPING, DEPARTMENT OP LATE NIGHT SOBBING, DEPARTMENT OF SPRING FEVER, DEPARTMENT OF AUTUMN GRIEF. In DEPARTMENT OP THE ILL FATED FAIR, he saw ‘Jinling, Twelve Beauties of; Supplementary Register No. 1’ and ‘Jinling, Twelve Beauties of; Supplementary Register No. 2’.（CHAPTER 5）"
			},
			{
				"label": "借剑杀人——————murder a person with a borrowed knife",
				"value": 3,
				"id": 3798,
				"categories": ["event"],
				"info": "王熙凤她布置的将尤二姐骗入大观圆，令丫头虐待，向老太太告恶状，在尤二姐怀孕后请医生做手脚使其小产，最后让秋桐担罪名，逼得尤二姐吞金自杀。“弄小巧借剑杀人”中的“剑”指的就是丫头秋桐，杀的就是尤二姐。——————Wang Xifeng, who had tricked Second sister You  into going to the Grand View Garden, hired a doctor to arrange a miscarriage after You Er became pregnant, and finally made Qiu Tong take the blame.(CHAPTER 68)"
			},
			{
				"label": "平儿失镯——————Patience lost her bracelet.",
				"image": "no image",
				"value": 4,
				"id": 3799,
				"categories": ["event"],
				"info": "平儿的镯子在一次和大家吃烤鹿肉的时候为了方便而被平儿取了下来放在一旁，这虾须镯本是一对，没想到取下的那一只突然消失了，只剩下一只了。平儿很fond这镯子，也一直找，没想到最后查出来是怡红院中的宝玉的丫鬟坠儿盗取了。平儿为了不让宝玉生气难堪，将镯子拿了回来之后骗大家说，这镯子藏在雪里了，雪融了才发现，并不是被人偷了。一个镯子倒也体现了平儿温和大方的性格。后来晴雯将坠儿撵了出去。——————Patience's bracelet was stolen during a deer roast with the others, only one bracelet is left, Patience loves the bracelet and keeps looking for it, but it turns out to be stolen by Bao-yu's maid Trinket in Happy Red Court. Afterwards, she lied to everyone that the bracelet was hidden in the snow, and it was only discovered after the snow melted that it wasn't stolen.（CHAPTER 49）"
			},
			{
				"label": "平儿行权——————Patience exercised her rights.",
				"value": 3,
				"id": 3800,
				"categories": ["event"],
				"info": "柳嫂子是厨房总管，她的女儿柳五儿想进怡红院当差，因为生病暂时在厨房帮忙。后来被冤枉偷了玫瑰露，那个时候凤姐生病， 很多事情都由平儿来处理，平儿知道柳五儿是冤枉的，所以做主放了柳五儿。——————Bao-yu owns up to a crime he did not commit，And Patience bends authority in order that the innocent may be spared（CHAPTER 61）"
			},
			{
				"label": "司棋被捉——————Chess was captured",
				"value": 3,
				"id": 3801,
				"categories": ["event"],
				"info": "潘又安与司棋在大观园幽会被鸳鸯撞见，畏罪远遁。他发财回家，意欲迎娶司棋，无奈司母不从，司棋撞墙身亡，他也殉情自尽。——————Poon and Chess meet Faithful at the Grand View Garden. However, Chess's mother did not approve of his marriage, so he crashed into the wall and died.（CHAPTER 71）"
			},
			{
				"label": "巧结梅花络——————A flower-patterned fringe",
				"value": 3,
				"id": 3802,
				"categories": ["event"],
				"info": "莺儿是薛宝钗的丫头，手特别巧。每一种样式名称、编法、色彩搭配，清清楚楚，了然于心。因此宝玉请莺儿打一些络子，装点扇子，香坠儿，汗巾子。——————Sulky Silver tastes some lotus-leaf soup，and Golden Oriole knots a flower-patterned fringe（CHAPTER 35）"
			},
			{
				"label": "亲尝莲叶羹——————Tastes some lotus-leaf soup",
				"value": 2,
				"id": 3803,
				"categories": ["event"],
				"info": "宝玉挨打后想吃莲叶羹。王熙凤就着人做了。后来王夫人打发玉钏给宝玉送汤。因为宝玉算是间接害死了玉钏的sister。玉钏就不大搭理宝玉。宝玉喝了一口莲叶羹之后，故意逗玉钏，说这汤不好喝。玉钏说这还不好吃那什么好吃，宝玉说，那你尝尝。玉钏就尝了一尝。——————Bao-yu wants to eat lotus leaf soup after being beaten. Wang Xifeng had someone make the soup. Later, Lady wang orders Silver to bring Bao-yu the soup. After Bao-yu takes a bite of the lotus leaf soup, he asks Silver to taste it too.（CHAPTER 35）"
			},
			{
				"label": "宝玉挨打——————Bao-yu was beaten",
				"value": 5,
				"id": 3804,
				"categories": ["event"],
				"info": "宝玉挨打发生在第三十三回，地点是贾政书房，时间是夏季午休后。它的根本原因是他交结贾家敌对势力忠顺亲王的戏子，犯了政治大忌；导火索是贾环在政老爹面前诬告宝玉“强奸（母婢）未遂，（金钏）赌气投井”。贾政闻而暴怒，回书房关门将宝玉一顿毒打。总共打了大约五十板子，贾母赶来已迟，严斥贾政后，命人将奄奄一息的宝玉从书房带回自己屋里。贾政三番落泪，事后也颇悔下手太重，后脚跟进贾母屋里欲看宝玉，又被贾母斥出屋里。它暗衔“清虚观打醮”、“冯紫英寿宴”两节，近接上一回的“吃胭脂金钏语成谶”，是全书的情节高潮之一。寿宴妓女云儿（告密者）、书房来客贾雨村（engage告密）都不是闲笔。——————An envious younger brother puts in a malicious word or two ，and a scapegrace elder brother receives a terrible chastisement.（CHAPTER 33）"
			},
			{
				"label": "大闹厨房——————create havoc in the kitchen",
				"value": 3,
				"id": 3805,
				"categories": ["event"],
				"info": "司棋让小丫头莲花儿到厨房要碗鸡蛋，没有要到，还惹了一句“头层主子、二层主子”的话，便率众丫头打砸小厨房搞得柳嫂子吃个哑巴亏。司棋此举虽然无理、霸道，但是很直爽！——————Chess asked the little girl Lianhua to ask for a bowl of eggs in the kitchen, but she didn't ask for it and was scolded by the kitchen staff. Chess led the maids to smash the small kitchen. Although Chess's move was very unreasonable and domineering, it was very straightforward!（CHAPTER 61）"
			},
			{
				"label": "香菱学诗——————Caltrop learns to write poetry.",
				"value": 3,
				"id": 3806,
				"categories": ["event"],
				"info": "细想香菱之为人也，根基不让迎探，容貌不让凤秦，端雅不让纨钗，风流不让湘黛，贤惠不让袭平，所惜者幼年罹祸，命运乖蹇，致为侧室。且曾读书，不能与林湘辈并驰于海棠之社耳。然此一人岂可不入园哉。故欲令入园，终无可入之隙，筹画再四，欲令入园必呆兄远行后方可。——————The Love Deluded One turns his thoughts to trade and travel，and the Poetry Enthusiast applies herself to making verses.(CHAPTER 48)"
			},
			{
				"label": "凤姐托孤——————Wang Xifeng entrusts orphans to others",
				"image": "no image",
				"value": 2,
				"id": 3807,
				"categories": ["event"],
				"info": "贾府被抄后，贾母去世，刘姥姥三进贾府，没想到贾府已败落不堪，内忧外患，凤姐见姥姥，往事难回首。凤姐病重，临终含泪把女儿巧姐托付给刘姥姥，并从手腕上褪下一只金镯子交给她，村妇刘姥姥却拒收了，但她爽快地答应了日后照顾巧姐。——————After Jia's mansion was copied, Grandma Jia passed away. Grandma Liu entered Jia's mansion for the third time. Unexpectedly, Jia's mansion was already in ruins. When Xi-feng saw her grandma, she entrusted her daughter Qiaojie to Grandma Liu and wanted to give her the gold bracelet. Grandma Liu didn't ask for it, but she readily agreed to take care of her in the future.（Written by others）"
			},
			{
				"label": "旺儿妇霸成亲——————Wanger's wife tyrant married",
				"value": 3,
				"id": 3808,
				"categories": ["event"],
				"info": "来旺家的儿子，看上了王夫人屋里的彩霞。来旺家的依仗凤姐的权势，强迫彩霞的父母结亲。——————The son who came to Wang's family saw the rainbow in the lady's house. Laiwang's wife relied on Wang xifeng's power to force Rainbow's parents.（CHAPTER 72）"
			},
			{
				"label": "弄权铁槛寺——————Playing with power at Iron Threshold Temple",
				"value": 2,
				"id": 3809,
				"categories": ["event"],
				"info": "凤姐到了水月庵安顿下后，一位老尼乘机，求凤姐办一件事，说长安城里有一户财主姓张，张家小姐有一次进庙烧香，被李衙内看上，李公子便要定要娶这位张小姐，可小姐已经受了前任长安守备公子的聘礼。那张财主便想将女儿嫁与李衙内，要退了守备家的婚约，守备家当然不同意，便与之打起了官司。现在便请凤姐，由贾府出面让守备家主动推婚。凤姐便要求送与她三千两百银，便出手帮这个忙，把退婚这件事给做个了解。——————At Water-moon Priory Xi-feng finds how much profit may procured by the abuse of power（CHAPTER 15）"
			},
			{
				"label": "智能偷情——————Sapientia cheating",
				"value": 3,
				"id": 3810,
				"categories": ["event"],
				"info": "智能儿，水月庵的小尼姑。净虚的徒弟，自幼在贾府走动，无人不识，也常和宝玉、秦钟玩笑。长大后渐知风情，看上秦钟人物风流，秦钟也爱她妍媚。两人情投意合，在馒头庵时幽会数次，秦钟返回家后，她从水月庵私逃出来找秦钟，不意被秦钟father秦业知觉，将她逐出，后不知去向。——————Qin Zhong discovers the pleasures that are to be had under the cover of darkness. Sapientia is the little nun of Water Moon Convent and the apprentice of Jingxu. She and Qin Zhong have a tryst at Steamed-bread Convent.（CHAPTER 15）"
			},
			{
				"label": "勾引薛蝌————seduce Xue Ke",
				"value": 3,
				"id": 3811,
				"categories": ["event"],
				"info": "夏金桂大概是看到薛蟠此次出事没命回来，就对老公的兄弟薛蝌动了念头，她的丫头宝蟾虽说给薛蟠做了房里人，但见薛蟠出事，她们主仆二人各怀心事，都把希望放到了薛蝌的身上。先是宝蟾去试探薛蝌，再是主仆二人联手勾引薛蝌。——————Xue Pang's wife, Xue Jin Gui, seduced Xue Pang's brother, Xue Ke.（Written by others）"
			},
			{
				"label": "探春远嫁——————Tan-chun married away",
				"image": "no image",
				"value": 2,
				"id": 3813,
				"categories": ["event"],
				"info": "探春判词：后面又画着两人放风筝，一片大海，一只大船，船中有一女子，掩面泣涕。也有四句云：才自精明志自高，生于末世运偏消。清明涕送江边望，千里东风一梦遥。——————Blessed with a shrewd mind and a noble heart,Yet born in time of twilight and decay,In spring through tears at river’s bank you gaze,Borne by the wind a thousand miles away."
			},
			{
				"label": "刘姥姥一进荣国府——————The first time Granny Liu entered Rong Mansion.",
				"value": 4,
				"id": 3814,
				"categories": ["event"],
				"info": "刘姥姥家因年关将近，却手头拮据，想起先祖做官时曾在京中认荣国府做了亲戚，便到荣国府讨些过年的钱。见到了当家的二奶奶王熙凤，凤姐将丫头们准备做冬衣的钱给了姥姥，为此刘姥姥十分感激她，并为将来救出凤姐的女儿巧姐埋下了伏线。——————Grannie Liu makes her first entry into the Rong-guo mansion,Wang Xifeng gave Grannie Liu the money that her servants had spent on making winter coats, for which Grannie Liu was very grateful.(CHAPTER 6)"
			},
			{
				"label": "黛玉葬花——————Dai-yu Burial Flower",
				"value": 2,
				"id": 3815,
				"categories": ["event"],
				"info": "林黛玉最怜惜花，觉得花落以后埋在土里最干净，说明她对美有独特的见解。她写了葬花词，以花比喻自己，在《红楼梦》中是最美丽的诗歌之一。贾宝玉和林黛玉在葬花的时候有一段对话，成为《红楼梦》中一场情人之间解除误会的绝唱。——————Beauty Perspiring sports with butterflies by the Raindrop Pavilion，And Beauty Suspiring weeps for fallen blossoms by the Flowers’ Grave（CHAPTER 27）"
			},
			{
				"label": "宝钗扑蝶——————Bao-chai butterfly catcher",
				"value": 3,
				"id": 3816,
				"categories": ["event"],
				"info": "薛宝钗在滴翠亭附近赏春扑蝶的场景，表现了宝钗活泼、旷达的性格。此事之后发生的“滴翠亭事件”，则体现了宝钗的善良机智。此回情节作者通过对人物的刻画及行动的描绘，生动、形象地再现了人物活动的场面，并且为读者展现了一副不可多得的仕女图。——————Xue Baochai blamed Lin Daiyu for eavesdropping. Beauty Perspiring sports with butterflies by the Raindrop Pavilion, and Beauty Suspiring weeps for fallen blossoms by the Flowers’ Grave.（CHAPTER 27）"
			},
			{
				"label": "金钏投井——————Golden commits suicide by jumping well",
				"value": 3,
				"id": 3817,
				"categories": ["event"],
				"info": "贾宝玉调戏金钏戏说：跟太太讨了她去一起。金钏反调笑宝玉让他去赵姨娘处捉贾环和丫头的奸被假寐的王夫人听到，遂怒起打了金钏一掌说她教坏少爷了。宝玉没敢为金钏辩解吓跑了，金钏被逐出府羞愤自尽！——————Bao-yu demonstrates confusion of mind by making his declaration to the wrong person，and Golden shows an unconquerable spirit by ending her humiliation in death.(CHAPTER 32)"
			},
			{
				"label": "大观园试才——————The inspection of the new garden becomes a test of talent",
				"value": 5,
				"id": 3818,
				"categories": ["event"],
				"info": "贾宝玉和sister贾元春之间的感情深厚，贾政想让元妃高兴，就让贾宝玉来题大观园里的匾额和对联，让元妃看到爱弟的进步，这回主要讲的就是贾政带着贾宝玉在大观园里考验儿子的才学，为各处题匾,作对联的故事。——————The inspection of the new garden becomes a test of talent, and Rong-guo House makes itself ready for an important visitor（CHAPTER 17）"
			},
			{
				"label": "秦可卿淫丧天香楼——————Qin-shi posthumously acquires the status of a Noble Dame",
				"value": 3,
				"id": 3819,
				"categories": ["event"],
				"info": "秦可卿嫁给贾蓉不久，就与公公贾珍有了首尾，且二人常在天香楼约会，二人自为众人不知，殊不知宁府下人早看接触端倪，只是慑于贾珍族长的身份，皆不敢声张。但有三个人一直被蒙在鼓里，即秦可卿的两个丫鬟瑞珠和宝珠，以及她的婆婆尤氏，直到有一天晚上，公媳再次私会于天香楼上，但恰好被前来找少奶奶的两个丫鬟撞见了贾珍和秦可卿的“好事”，贾珍匆忙间更衣逃走，秦可卿也慌忙更衣下楼，一不小心遗下了自己常戴的一根簪子在贾珍处。第二天，这根簪子被尤氏从贾珍换下的衣服中获得，因此产生了怀疑，遂唤秦可卿的两个丫鬟来问，两个丫鬟在尤氏的威逼利诱下，大哭着说出真相，此事被秦可卿贾珍得知，秦氏觉得自己再无脸面苟活，于是在一个晚上自缢于天香楼。——————Qin-shi is married to Jia Rong, and soon after, she has an affair with her father-in-law, Jia Zhen. The two often met at the Heavenly Fragrance Pavilion, where they were unaware that many people knew about their affair. When Jia Rong's mother found out about the affair, Qin-Shi felt ashamed of herself and hanged herself one night at the Heavenly Fragrance Pavilion.（CHAPTER 13）"
			},
			{
				"label": "迎春误嫁中山狼——————Ying-chun’s parents betroth her to a Zhong-shan wolf",
				"value": 3,
				"id": 3820,
				"categories": ["event"],
				"info": "贾迎春过门后极尽妇道，对孙恩爱有加，但不久发现孙绍祖一味好色，好赌酗酒……好不好，打一顿撵在下房里睡去……”，孙视迎春为买来的奴仆，动辄非打即骂。迎春乃名门闺秀，性本娇弱，那里经得起如此蹂躏折磨，不久便香销玉殒，一命归西。Jia Ying-chun is very obedient after her marriage, but soon discovers that her husband, Sun Shaozu, is a womanizer, a gambler and a drunkard. Sun Shaozu beats and scolds Ying-chun at every turn, but Ying-chun, a lady of the family, is too fragile to endure such abuse and dies soon afterwards.（CHAPTER 79）"
			},
			{
				"label": "金玉良缘——————Commend the marriage rites of gold and jade",
				"value": 2,
				"id": 3821,
				"categories": ["event"],
				"info": "宝玉身上有一块玉，宝钗有一块金锁，合起来就叫金玉良缘，薛家与贾家两大家族的结合，门当户对的意思。——————Bao-yu was born with a piece of jade, and Xue Bao-chie has a golden lock, which together is called the marriage rites of gold and jade, the union of the two extended families of the Xue and Jia families, which means that the families are paired."
			},
			{
				"label": "王熙凤协理宁国府——————Xi-feng takes on the management of a neighbouring establishment",
				"value": 3,
				"id": 3822,
				"categories": ["event"],
				"info": "秦可卿死，宁国府贾珍的wife尤氏装病不理事，贾珍只好请王熙凤来主持丧事。王熙凤为了显示自己才干，定时点卯，分派任务，处理的井井有条，并且出发了故意搞乱给凤姐下马威的一个。众人听从安排，比较成功的办理了秦可卿的丧事，展示了王熙凤的才干本领。——————Qin Keqing died, and Jia Zhen's wife in Ningguo Mansion pretended to be ill. Jia Zhen had to invite Wang Xifeng to preside over the funeral. Wang Xifeng was able to handle Qin Keqing's funeral in an orderly manner.（CHAPTER 13）"
			},
			{
				"label": "元妃省亲——————Yuan-Chuan went home to visit her family",
				"value": 1,
				"id": 3823,
				"categories": ["event"],
				"info": "元妃省亲时先看到大观园，暗叹过于奢华。后来与贾母等人相遇，都哭了一场。接着见了林黛玉、薛宝钗和薛姨妈，又见了贾宝玉，然后看了匾额，她着各人选一首题诗，薛、林二人得到赞誉。宝玉独占四首，薛宝钗看见他用了“绿玉春犹卷”这一句，提醒他元妃不fond“绿玉”一词，叫宝玉改成了“绿蜡”。宝玉作了三首，正在冥思苦想，黛玉见他只抄“杏帘在望”一首，就帮他作了一首，让宝玉抄。其实黛玉本想今夜大展奇才压倒众人的，但元妃只命一人作一首诗，她只好作罢。结果元妃看了，喜之不尽，说最后一首为上。把山庄名改成了“稻香村”。之后再听了几出戏，也就散了。——————A brief family reunion is permitted by the magnanimity of a gracious Emperor，and an Imperial Concubine takes pleasure in the literary progress of a younger brother.(CHAPTER 18)"
			},
			{
				"label": "甄士隐梦幻识通灵——————Zhen Shi-yin makes the Stone’s acquaintance in a dream",
				"value": 3,
				"id": 3824,
				"categories": ["event"],
				"info": "是贾宝玉和林黛玉的来历。宝玉是石头下凡。这块石头因“无材补天”被女娲抛弃在青埂峰下，又四处游荡，到警幻仙子处做了神瑛侍者，遇见一株绛珠仙草，日日为她灌溉甘露，后来又被一僧一道携了投胎下凡做人，他就是贾宝玉。那株绛珠仙草也跟了石头下凡，她就是林黛玉。——————The jade of Jabuyu was the goddess Nǚ-wa was repairing the sky remaining stone. The beautiful Crimson Pearl Flower, which Disenchantment had been watering, was the former daughter of Lin Daiyu, who was reincarnated as Jia Baoyu.（CHAPTER 1）"
			},
			{
				"label": "晴雯撕扇——————Skybright rips fans off.",
				"value": 3,
				"id": 3825,
				"categories": ["event"],
				"info": "端午佳节间，宝玉因金钏儿之事，心情很糟糕。恰巧晴雯给宝玉换衣时失手把他扇子跌折，便训斥了她几句，晴雯的自尊心受到伤害，还击了一通，不仅把宝玉“气得浑身乱颤”，而且连来劝架的袭人也落了个灰头土脸。最后，宝玉一定要回了太太去，至袭人一干丫鬟跪下求情才罢。而宝玉赴宴回来，仍和晴雯有说有笑。听说晴雯fond听撕扇子的声音，就任凭她将一大堆名扇痛痛快快撕尽了。最后晴雯将宝玉手中的扇子撕了，又把麝月的扇子也撕了。——————Torn fans is the price of silver laughter（CHAPTER 31）"
			},
			{
				"label": "凤姐泼醋——————Xi-feng’s jealousy is the object of an unexpected provocation",
				"image": "no image",
				"value": 4,
				"id": 3826,
				"categories": ["event"],
				"info": "凤姐自觉酒沉，下席回房。小丫头见面扭头就跑，凤姐疑心严审，发觉贾琏与鲍二家的偷情。先打平儿，凤姐踢门而进，撕打叫骂。尤氏等人至，贾琏拔剑欲杀凤姐，凤姐哭往贾母处。邢夫人管治喝退贾琏，贾母笑语解围。李纨拉平儿入园，宝玉让平儿怡红院理妆，为平儿黛玉伤感。邢夫人早起带贾琏过贾母处，贾琏下跪作揖陪罪。鲍二家的上吊自尽，凤姐吓阻，贾琏拿钱发送打点。——————Xi-feng’s jealousy is the object of an unexpected provocation，and Patience’s toilet is a source of unexpected delight（CHAPTER 44）"
			},
			{
				"label": "探春理家——————Tan-chun manages the Jia family.",
				"value": 4,
				"id": 3827,
				"categories": ["event"],
				"info": "王熙凤病倒，王夫人怕无人看管诺大个贾府，叫探春、李纨以及薛宝钗代理府中一切事物，比凤姐在时还厉害。赶上赵姨娘兄弟死了，探春公私分明，不为亲人多给银子，引得赵姨娘大怒。之后裁度众人月例，把园子包给众仆妇，引得众人交口称赞，探春的理家理念得到了具体实施。——————The woman is very sick and her mother-in-law, Lady Wang, fears that there will be no one to look after the house, so she asks Tanchun, Li Fan and Xue Baochai to do everything for her. The two of them are very close to each other, and they are all praised by everyone.（CHAPTER 55）"
			},
			{
				"label": "湘云醉眠芍药裀——————tipsy Xiang-yun sleeps on a peony-petal pillow",
				"value": 1,
				"id": 3828,
				"categories": ["event"],
				"info": "在宝玉等人生日宴席上，史湘云喝醉酒，便在园中山后一块石凳上睡着了。她头枕着一包芍药花瓣，芍药花飞了她一身，手中扇子落在地下，也半被花埋，身边蜂围蝶绕。虽然香梦沉酣，她口中还唧唧嘟嘟说着酒令。众人上前推醒她后，湘云不由心中后悔。——————At the banquet on Bao-yu's birthday, Shi Xiangyun got drunk and fell asleep on a stone bench behind the hill in the garden. She rested her head on a bag of peony petals, peony flowers flew all over her, her fan fell to the ground, and she was surrounded by butterflies. Shi Xiangyun regretted it when everyone came forward to wake her up.（CHAPTER 62）"
			},
			{
				"label": "尤三姐殉情—————— San-jie committed suicide for love.",
				"value": 2,
				"id": 3829,
				"categories": ["event"],
				"info": "柳湘莲与尤三姐相爱后，赠与三姐一双鸳鸯剑为定情物，然后远出官职。不想一别竟是五年。五年中柳湘莲有期盼、有思念，但也听到了许多贾府的传言之讯。在假期中，柳湘莲本想娶妻成亲，但回到京城却从朋友那里听到了贾府的很多乱伦的风月之事。此行却变成了落实贾府男女们肮脏行为的调查，和悔婚约决心的下定。当他来到贾府门前，正值宝玉在门外，寒暄之后，宝玉提到了尤三姐的痴情苦等。柳湘莲急忙摆手摇头并说：“你们东府里除了那两个石头狮子干净，只怕连猫儿狗儿都不干净，我不做这剩王八。”躲在门内的三姐听得真切 ，盼君、迎君的热切激情，如同被冰水陡然泼灌。在回屋还剑之时，将剑鞘递与柳湘莲；顺势自己抽出一柄剑，当着柳湘莲的面愤情自尽。以自己的鲜血和生命证明了自身的清白和对爱情的忠贞。——————Shame drives a warm-hearted young woman to take her life，and shock leads a cold-hearted young gentleman to renounce the world.(CHAPTER 66)"
			},
			{
				"label": "抄检大观园——————a raid on Prospect Garden",
				"value": 8,
				"id": 3830,
				"categories": ["event"],
				"info": "园内发现香囊，王夫人令凤姐和王善保家一起抄检。在怡红院，晴雯愤怒倒出所有东西，并无私弊之物。在探春处，探春不但顶撞凤姐，还打了王善保耳光。在迎春处，搜到司棋adultery证据。在惜春处，搜到入画brother的靴袜。最后，晴雯、司棋、入画被逐出府。——————Lady Wang authorizes a raid on Prospect Garden， Jia Xi-chun breaks off relations with Ning-guo House，In the end, Skybright, Picture and Chess were thrown out.（CHAPTER 74）"
			},
			{
				"label": "黛玉焚稿——————Dai-yu burning poems",
				"value": 3,
				"id": 3831,
				"categories": ["event"],
				"info": "林黛玉得知贾宝玉和薛宝钗定婚的消息后，一病不起，临死前，挣扎着在卧榻边，狠命撕那宝玉送的旧帕和写有诗文的绢子，又叫雪雁点灯笼上火盆，黛玉将绢子撂在火上，雪雁也顾不得烧手，从火里抓起来撂在地下乱踩，却已烧得所余无几了，之后黛玉便含泪而逝。——————After learning of Jia Baoyu's engagement to Xue Bao Nobile, Lin Daiyu fell ill and died in tears after struggling to tear up the gifts she had received from him by her bedside and asking Snowgoose to help her burn her own poems.（Written by others）"
			},
			{
				"label": "黛玉之死——————Daiyu's death",
				"value": 1,
				"id": 3832,
				"categories": ["event"],
				"info": "黛玉听说宝玉结婚的消息后，病情日重。她自料万无生理，就将作为自己和宝玉爱情见证的旧帕与诗稿付之一炬。贾府上下忙于娶亲，无暇顾及黛玉，还把她的丫环叫走使唤。黛玉在直声叫道“宝玉！宝玉！你好——”后便去世了。而此时，远处隐隐约约传来了娶亲的音乐之声，潇湘馆外竹梢风动,月影移墙,好不凄凉冷淡!——————After learning of Jia Baoyu's engagement to Xue Bao Nobile, Lin Daiyu fell ill and died in tears after struggling to tear up the gifts she had received from him by her bedside and asking Snowgoose to help her burn her own poems.（Written by others）"
			},
			{
				"label": "晴雯补裘——————Skybright repairs fur coat",
				"value": 2,
				"id": 3833,
				"categories": ["event"],
				"info": "袭人因母病回家，晴雯夜里受寒伤风，身上烧得烫人。宝玉为舅舅庆寿，贾母给了宝玉一件俄罗斯的孔雀毛做的氅衣，宝玉穿时不小心烧了个洞，麝月忙悄悄拿出来叫人织补，谁知道东西太名贵，没有裁缝敢揽活。睛雯心灵手巧，重病中连夜补好。——————Kind Patience conceals the theft of a Shrimp Whisker bracelet，and brave Skybright repairs the hole in a Peacock Gold snowcape.(CHAPTER 52)"
			},
			{
				"label": "元宵丢英莲——————During the Lantern Festival, Yin-lian was lost",
				"value": 2,
				"id": 3834,
				"categories": ["event"],
				"info": "香菱原名甄英莲，她出身在一二等富贵风流之地姑苏，mother封氏性情贤淑，深明礼义，father甄士隐严正清白，禀性恬淡，为本地望族。年已半百的夫妻俩，膝下无儿，只有一女，乳名英莲。英莲“生得粉妆玉琢，乖觉可喜”，全家极其疼爱。应该说英莲生活在这样的家庭是幸福美好的。不幸的是，在她五岁那年的元霄佳节，士隐命家人抱去看灯，至半夜时家人霍启因小解，将英莲放在一家人家门槛上，待他回来，英莲不见踪影。全家人到处寻找，皆无音讯，英莲早被拐子拐去，另走他乡。——————Caltrop's parents were both very friendly people, but she was abducted by a trafficker during a trip to the Lantern Festival temple fair and her family was eventually separated.（CHAPTER 1）"
			},
			{
				"label": "冷子兴演说荣国府——————Leng Zi-xing discourses on the Jias of Rong-guo House",
				"value": 2,
				"id": 3835,
				"categories": ["event"],
				"info": "大致介绍了宁荣二府的主要家庭成员的情况，二是点明了贾府现时萧条的光景和面临的危机，透露出这样一个钟鸣鼎食之家，如今的儿孙竟一代不如一代了。这些为我们理解小说是写一个处于“末世”的封建家族的衰亡提供了启示。——————In this chapter, the main family members of the Ning and Rong families are introduced in general terms, and the crisis that the Jia family is now facing is highlighted. This is to provide insight for readers to understand that the novel is about the decline of a feudal family in the ’last days‘.（CHAPTER 2）"
			},
			{
				"label": "木石前盟——————The bond of old by stone and flower made",
				"value": 2,
				"id": 3836,
				"categories": ["event"],
				"info": "《红楼梦》中贾宝玉与林黛玉的讹缘，木指黛玉previous incarnation (Buddhism)绛珠仙草，石指宝玉previous incarnation (Buddhism)顽石。神瑛侍者以甘露之水灌溉绛珠草，使其得换人形，修成个女体，名唤绛珠仙子。为报灌溉之德，绛珠仙子情愿随神瑛侍者下凡历劫，将自己一世的眼泪还他。可是一个与此事毫不相干的顽石插足，错领绛珠之泪，以致于绛珠泪尽而逝。故事由两个神话开头，渲染出了佛道的因果关系，以及人生如梦的主旨。可是宝玉口中的“木石前盟”竟然只是一厢情愿的讹缘，起到了当头棒喝的效果，乃是作者苦口婆心的劝诫：放下情迷，原本人生如梦。——————It represents the fate of Jia Baoyu and Lin Daiyu in the Dream of the Red Chamber, and flower refers to Lin Daiyu's previous life. She Ying poured water on the flower to turn it into a human being, called the purple-red pearl. However, a stone intervened and mistakenly accepted the tears, causing Jiangzhu to die of tears."
			},
			{
				"label": "贤袭人娇嗔箴宝玉——————义香发现如何以无言的方式来责备她的主人",
				"value": 3,
				"id": 3837,
				"categories": ["event"],
				"info": "史湘云在贾府玩，夜里和林黛玉睡在一起。贾宝玉一早起床就往林黛玉房间跑，要史湘云给他梳头。袭人跟贾宝玉说：一个男孩子老往女孩子房间跑，这样很不好。薛宝钗觉得袭人有见识。贾宝玉被袭人和薛宝钗说了一番，很不高兴，成天都没有理睬袭人，袭人想只有慢慢劝他。——————Shi Xiangyun is playing in Jia's house and sleeping with Lin Daiyu. Aroma tells Jia Baoyu that it is not good for a boy to go to a girl's room all the time. Xue Baochai thinks that the assailant has insight. Aroma and Xue Baochai are very upset with Jia Baoyu, who ignores Aroma all day long.（CHAPTER 21）"
			},
			{
				"label": "潇湘馆——————Bamboo Lodge",
				"value": 3,
				"id": 3838,
				"categories": ["location"],
				"info": "黛玉的居所。黛玉作诗的笔名就潇湘妃子，这是曹雪芹对黛玉这个人物的赞美。——————Lin Daiyu's residence. Daiyu's pen name for the poem is Bamboo Lodge."
			},
			{
				"label": "蘅芜苑——————Alpinia Park",
				"value": 3,
				"id": 3839,
				"categories": ["location"],
				"info": "薛宝钗的住所，匾额题为“蘅芷清芬”。宝钗亦因此得诗号“蘅芜君”。蘅芜苑离正殿不远，在沁芳池边，是一所外则“无味”，内藏“清雅”的处所。作者通过欲扬先抑的手法，暗喻了宝钗外表藏愚守拙，内在天然可爱，并且亲近佛道的思想性格。——————The residence of Xue Baochai. Alpinia Park is not far from the main hall, next to Seeping Fragrance Lock. Through the method of wanting to promote and suppress, the author implies that Xue Baochai's appearance is silly and clumsy, and the inside is natural and lovely, and he is close to Buddhism and Taoism."
			},
			{
				"label": "暖香坞——————Spring In Winter Room",
				"value": 2,
				"id": 3840,
				"categories": ["location"],
				"info": "惜春的住所。暖香坞situated in大观园的西半区，北面是李纨住的稻香村，南边是薛宝钗的蘅芜苑。——————Jia Xichun's Residence.Spring In Winter Room is located in the western half of Grandview Park, north of Paddy-Sweet Cottage, where Lee Wan lives, and south of Alpinia Park, where Xue Baochai lives."
			},
			{
				"label": "缀锦楼——————Variegated Splendour Tower",
				"value": 3,
				"id": 3841,
				"categories": ["location"],
				"info": "贾迎春的住所。大观园东部有一个庭院，西侧临水，东部靠山，院内西部建筑是紫菱洲，北房正厅，即缀锦楼。——————Jia Yingchun's residence"
			},
			{
				"label": "稻香村——————Paddy-Sweet Cottage",
				"value": 3,
				"id": 3842,
				"categories": ["location"],
				"info": "李纨的住所。转过山怀中，隐隐露出一带黄泥墙，墙上皆用稻茎掩护。有几百枝杏花，如喷火蒸霞一般。里面数楹茅屋，外面却是桑榆槿柘，各色树稚新条，随其曲折，编就两溜青篱。篱外山坡之下，有一土井，旁有桔槔辘轳之属；下面分畦列亩，佳蔬菜花，一望无际。——————Li Wan's place of residence.The Story of the Stone dim-coloured adobe wall crowned with a coping of rice-straw thatch. Inside it were several hundred apricot trees, whose flowering tops resembled the billowing rosy clouds of some vegetable volcano. In their midst stood a little group of reed-thatched cottages. "
			},
			{
				"label": "凤藻宫——————the Imperial Bedchamber",
				"value": 2,
				"id": 3843,
				"categories": ["location"],
				"info": "元春省亲的住所。——————Jia Yuanchun's residence."
			},
			{
				"label": "秋爽斋——————The Studio of Autumn Freshness freshness",
				"value": 3,
				"id": 3844,
				"categories": ["location"],
				"info": "贾探春在大观园的住所。题有“桐剪秋风”匾额。“斋”，书房也。斋较堂，惟气藏而收敛，盖藏修秘处之地，故式不宜敞显，充满了浓郁的书卷气息。——————Jia Tanchun's residence at the Grand View"
			},
			{
				"label": "怡红院——————Happy Red Court",
				"value": 4,
				"id": 3845,
				"categories": ["location"],
				"info": "贾宝玉的住所。试才题对额时，宝玉题为“红香绿玉”，取意蕉棠两植。元宵省亲时，元春不喜“香玉”二字（因暗指黛玉），改为“怡红快绿”，赐名“怡红院”，宝玉因号“怡红公子”。——————Jia Yuanchun named the place for Jia Baoyu's residence."
			},
			{
				"label": "栊翠庵——————Green Lattice Nunnery",
				"value": 2,
				"id": 3846,
				"categories": ["location"],
				"info": "妙玉在大观园中的修行处，是一所园林中点景的尼姑庵。后来惜春出家，便住在此处。对于此建筑布局，书中并未展开描述，只是点到山门、东禅堂、耳房这三处，其中给读者留下深刻印象的是栊翠庵中的红梅。——————Adamantina's retreat in the Grand View was a nunnery with a point view in the garden. She also lived here when Jashichun later became a monk."
			},
			{
				"label": "梨香院——————Pear Fragrance Court",
				"value": 2,
				"id": 3847,
				"categories": ["location"],
				"info": "宝钗初入贾府时，便住在梨香院。在贾府建成大观园以后，“薛姨妈另迁于东北上一所幽静房舍居住，将梨香院早已腾挪出来，另行修理了，就令教习在此教演女戏”（第18回），梨香院又成为了龄官等十二女伶的驻地。再后来，大观园内的女子戏班被遣散，梨香院还临时做过尤二姐的停灵之所（第69回）。——————Xue Baochai lived in Pear Fragrance Court when he first entered the Jia residence, and later, Pear Fragrance Court became the residence of the twelve female actors (Chapter 18). Then later, it temporarily served as a stopover for You Er's spirit (Chapter 69)"
			},
			{
				"label": "荣国府——————Rong Mansion",
				"value": 16,
				"id": 3848,
				"categories": ["location"],
				"info": "荣国公府邸。荣国公贾源是弟弟，死后他的儿子贾代善袭了他的爵位，贾代善的夫人就是贾母，史太君。贾代善生了两个儿子一个女儿，分别是：贾赦、贾政和贾敏。贾代善死后大儿子贾赦（妻：邢夫人）袭了爵位。——————Rongguo General Jia Yuan's residence."
			},
			{
				"label": "宁国府——————Ningguo Mansion",
				"value": 7,
				"id": 3849,
				"categories": ["location"],
				"info": "宁国公府邸。宁国公贾演是brother，死后他的儿子贾代化袭了他的爵位。贾代化死后他的儿子贾敬袭了爵位，贾敬有一儿一女，儿子是贾珍，女儿是惜春。贾敬死后他的儿子贾珍（妻：尤氏）袭了爵位。——————Ningguo Mansion Built at Imperial Command，The residence of General Ning, Jia Yan."
			},
			{
				"label": "苏州————Soochow",
				"value": 9,
				"id": 3850,
				"categories": ["location"],
				"info": "《红楼梦》里地名，即姑苏城。林黛玉祖籍。——————The name of the place in Dream of the Red Chamber, namely Gusu City. Lin Daiyu's Ancestry"
			},
			{
				"label": "大观园——————the Grand View Garden",
				"value": 9,
				"id": 3851,
				"categories": ["location"],
				"info": "贾府为元妃省亲所建别墅园林。——————The garden of the villa Jia Yuanchun built for his return home after becoming a imperial concubine."
			},
			{
				"label": "玄真观——————Xuanzhen Temple",
				"value": 2,
				"id": 3852,
				"categories": ["location"],
				"info": "《红楼梦》里，贾敬修行、炼丹的地方。——————In Dream of the Red Chamber, the place where Jia Jing practices and alchews pills."
			},
			{
				"label": "京郊——————outskirts of a capital city",
				"value": 7,
				"id": 3853,
				"categories": ["location"],
				"info": "地处京城之外，刘姥姥家所处位置。——————Grannie Liu's home location"
			},
			{
				"label": "扬州——————Yangchow",
				"value": 2,
				"id": 3854,
				"categories": ["location"],
				"info": "林黛玉出生的地方，也是林如海捐馆之所。——————The place where Lin Daiyu was born, and where Lin Ruhai died."
			},
			{
				"label": "金陵——————Jinling",
				"value": 31,
				"id": 3855,
				"categories": ["location"],
				"info": "金陵即今天的南京。贾母祖籍。——————Jinling is today's Nanjing. Grandma Jia's Ancestral Home"
			},
			{
				"label": "京城——————capital (city)",
				"value": 11,
				"id": 3856,
				"categories": ["location"],
				"info": "《红楼梦》里写的京城是指长安。——————In Dream of the Red Chamber, the capital is Chang'an."
			},
			{
				"label": "胡州——————Huchow",
				"value": 1,
				"id": 3857,
				"categories": ["location"],
				"info": "作者虚拟的地名，脂评：“胡邹也。”——————Authors' virtual place names"
			},
			{
				"label": "葫芦庙——————Gourd Temple",
				"value": 2,
				"id": 3858,
				"categories": ["location"],
				"info": "应天府的门子曾经是葫芦庙里的小沙僧。贾雨村失意时住过一段时间。在苏州城内。——————Menzi used to be the little sand monk in the gourd temple. Jia Yucun lived for a while when he was frustrated. In the city of Soochow"
			},
			{
				"label": "南海——————South Sea",
				"value": 2,
				"id": 3859,
				"categories": ["location"],
				"info": "《红楼梦》里贾探春远嫁的地方。——————In Dream of the Red Chamber, Jia Tanchun married away."
			},
			{
				"label": "太虚幻境——————the Land of Illusion",
				"value": 1,
				"id": 3860,
				"categories": ["location"],
				"info": "太虚幻境，《红楼梦》中的女儿仙境，警幻仙子司主。它situated in离恨天之上、灌愁海之中的放春山遣香洞，以梦境的形式向甄士隐、贾宝玉二位有缘人显现。——————It is located in the Grotto of Emanating Fragrance on the Mountain of Expanding Spring, and appears in the form of a dream to Yan Shiyin and Jia Baoyu."
			},
			{
				"label": "大同府————Datong Mansion",
				"value": 1,
				"id": 3861,
				"categories": ["location"],
				"info": "《红楼梦》中，贾迎春之夫孙绍祖是山西大同府人。——————In Dream of the Red Chamber, Jia Yingchun's husband, Sun Shaozu, was from Datong, Shanxi Province."
			},
			{
				"label": "阊门——————gate of heaven",
				"value": 3,
				"id": 3862,
				"categories": ["location"],
				"info": "苏州繁华之地，《红楼梦》写道：最是红尘中一二等富贵风流之地。——————Soochow prosperous place, ‘Dream of the Red Chamber’ wrote: the most is the red dust in the first and second class rich and windy place."
			},
			{
				"label": "贾宝玉——————Jia Baoyu",
				"value": 52,
				"image": "贾宝玉.png",
				"sound": true,
				"id": 3863,
				"categories": ["zhuyao"],
				"info": "荣国府衔玉而诞的公子，贾政与王夫人之次子，阖府捧为掌上明珠，对他寄予厚望，他却走上了叛逆之路，痛恨八股文，批判程朱理学，给那些读书做官的人起名“国贼禄蠹”。他不fond“正经书”，却偏爱《牡丹亭》《西厢记》之类的“杂书”。他终日与家里的女孩们厮混，爱她们美丽纯洁，伤悼她们的薄命悲剧。——————The first chapter describes how one piece of stone was left over from when the Wall of Heaven was repaired by the Goddess Nüwa. That stone, changed into a piece of luminous jade, is given a chance to learn the emptiness of human existence by following another incarnation who is to be Jia Baoyu. Baoyu is thus born with a magical piece of jade in his mouth. His name, which literally means ‘precious jade’, was given him in honor of this. The jade and Baoyu share a mystical link, and the Cheng-Gao version ends after the jade is lost for good and Baoyu himself disappears.The second son of Jia Zheng and Madame Wang, the son of the Rongguo family was born with jadeite. The whole family had high hopes for him. He hates the Eight Gui Writings and criticizes the philosophy of Ching and Zhu. He does not like ‘serious books’ and prefers ‘miscellaneous books’ like ‘The Peony Pavilion’ and ‘The Story of the Western Wing’. He spends his days with the girls of his family, loving their beauty and purity and mourning their tragic lives."
			},
			{
				"label": "贾代善——————Jia Deishan",
				"value": 8,
				"id": 3864,
				"categories": ["person"],
				"info": "荣国公贾源是宁国公贾演的弟弟，贾源死后他的儿子贾代善袭了他的爵位。贾代善的夫人就是贾母（又称史太君）。 贾代善生了两个儿子多个女儿，其中有姓名的分别是：贾赦、贾政和贾敏。 贾代善死后大儿子贾赦（妻：邢夫人）袭了爵位。——————Rongguo General Jia Yuan was the younger brother of Ningguo General Jia Yan, and after Jia Yuan's death his son, Jia Daishan, inherited his title. Jia Daishan's wife was Grandmother Jia (also known as Shi Taijun). Jia Daishan gave birth to two sons and several daughters, among whom were named: Jia Pao, Jia Zheng and Jia Min. After Jia Daishan's death, his eldest son Jia Pao (wife: Mrs. Xing) inherited the title"
			},
			{
				"label": "贾代化————Jia Deihua",
				"value": 5,
				"id": 3865,
				"categories": ["person"],
				"info": "贾演长子，贾敷、贾敬之父，京营节度使世袭一等神威将军。——————Jia Yan's eldest son, the father of Jia Chang and Jia Jing, was a hereditary first-class general of the Imperial Court."
			},
			{
				"label": "贾敷————Jia Chang ",
				"value": 4,
				"id": 3866,
				"categories": ["person"],
				"info": "贾代化长子，贾敬之兄。八九岁夭折。——————The eldest son of Jia Daihua, brother of Jia Jing. He died at the age of eight or nine."
			},
			{
				"label": "贾敬——————Jia Jing",
				"value": 6,
				"image": "贾敬.png",
				"id": 3867,
				"categories": ["person"],
				"info": "宁国公贾演的孙子，京营节度使世袭一等神威将军贾代化的次子，贾珍之父。是乙卯科进士，却一味好道，在都外玄真观修炼，烧丹炼汞，别的事一概不管，放纵家人胡作非为。后因吃秘制的丹砂烧胀而死。死后追赐为五品之职。——————The grandson of the Duke of Ning, Jia Yan, and father of Jia Zhen. He was devoted to Taoist culture, practiced in a Xuanzhen temple, burned pills and mercury, and indulged his family in all sorts of misdeeds. Afterwards, he died because he ate the secret pills and burnt up. After his death, he was posthumously bestowed with the rank of Fifth Grade."
			},
			{
				"label": "贾赦——————Jia she",
				"value": 15,
				"image": "贾赦.png",
				"id": 3868,
				"categories": ["zhuyao"],
				"info": "字恩侯，荣国公之孙，贾代善、贾母之长子，邢夫人的丈夫，贾琏、迎春的父亲，是个无耻之徒，他承袭了一等将军之职爵位。生性好色，妾室一片，平日依官作势，行为不检。他不满贾母偏向弟弟贾政，与贾母、贾政貌合神离。这个无耻的封建阶级的末代子孙，终于遭到查抄家产，革去世职，远离都城，充军边地的应得下场。——————He was the grandson of General Rongguo, the eldest son of Jia Daishan and Jia Mu, the husband of Lady Xing, the father of Jia Lian and Yingchun, and a shameless man who inherited the title of First Class General. He is a lustful man with concubines and misbehaves in everyday life. He was unhappy with Grandmother Jia's favoritism towards her brother Jia Zheng, and was unhappy with his mother's and Jia Zheng's appearance. This shameless descendant of the last generation of the feudal class was finally confiscated from his family, dismissed from his post, and sent to the frontier far away from the capital city."
			},
			{
				"label": "贾政——————Jia Zheng",
				"value": 24,
				"image": "贾政.png",
				"id": 3869,
				"categories": ["zhuyao"],
				"info": "字存周，贾母和贾代善所生的次子，贾宝玉的父亲，林黛玉的舅舅，薛宝钗的姨父。他是除贾母外荣国府的最高掌权者，但同贾母一样不常管理府中大小俗务，每日只看书著棋，同一众清客闲聊，是名副其实的甩手掌柜，他并不喜好繁华奢侈的生活，在游览大观园时亦有过归农隐逸之意。他自幼好读书，但并不是天生的方正呆板，出仕前，他“也是个诗酒放诞之人”，但“一切为的是光宗耀祖”，因此重视读书上进，归于正途。为人端方正直，谦恭厚道，人品端方，风声清肃。礼贤下士，济弱扶危，大有祖风，惟失之于迂腐。他一心孝顺贾母，亦想严厉管教子女；他想作好官，可是不谙世情，只解打躬作揖，终日臣坐，形同泥塑，遭人蒙骗，弄得声名狼藉。——————He is the second son of Grandma Jia and Jia Daishan, father of Jia Baoyu, uncle of Lin Daiyu, and uncle of Xue Baochai. He was the highest ruler of the Rongguo residence except for Jia's mother, but like Jia's mother, he did not often manage the affairs of the residence and only read books, played chess, and chatted with the literati. He was not fond of luxurious life and had the intention of returning to farming and secluding himself. He was a good reader since childhood, but he was not born square and stiff, before he became a public servant, he was also a person of poetry and liquor, but  all for the glory of the ancestors, so he attached importance to education and advancement, to the right way. He was an honest and upright man, and he wanted to be filial to his mother and discipline his children. He wanted to be a good official, but he was deceived and became notorious for his lack of understanding of the world."
			},
			{
				"label": "贾蓉——————Jia Rong",
				"value": 11,
				"image": "贾蓉.png",
				"id": 3870,
				"categories": ["zhuyao"],
				"info": "贾珍之子，是一个十六七岁的少年，面目清秀，身材俊俏，轻裘宝带，美服华冠的男子。他原为监生，妻子秦可卿死后，为了在丧礼上风光些，父亲贾珍花了一千两百两银子给他捐了个五品龙禁尉。贾蓉长得是面目清秀，细挑身材，但生活上却和他father贾珍一样荒淫无耻。——————The son of Jia Zhen was a young man of sixteen or seventeen, with a clear face and a handsome figure. He was originally a prisoner, but after his wife Qin Keqing's death, in order to be more glamorous at the funeral, his father Jia Zhen spent 1,200 taels of silver to donate him a fifth-grade dragon forbidden captain. Jia Rong was very handsome, but his life was just as shamelessly lascivious as his father Jia Zhen's. Jia Rong was a handsome man, but his father was just as shamelessly lascivious."
			},
			{
				"label": "贾蔷——————Jia Qiang",
				"value": 7,
				"image": "贾蔷.png",
				"id": 3871,
				"categories": ["zhuyao"],
				"info": "宁国府的正派玄孙。他父母早亡，从小跟贾珍过活，比贾蓉生得还风流俊俏。虽然每日应名去上学，亦只不过虚掩眼目而已，仍旧是斗鸡走狗，赏花阅柳。他上有贾珍溺爱，下有贾蓉匡助，越发自大起来。后成了贾府小戏班梨香院的总管，与小旦龄官相好。——————NingMansion's real Xuan grandson. His parents died young, and he grew up with Jia Zhen, who was even more handsome than Jia Rong. Although he goes to school every day under the name of Jia Rong, he is only an eye-candy, but he still likes to have fun and is lascivious. He was doted on by Jia Zhen and helped by Jia Rong. Later, he became the manager of Pear Fragrance Court, a small opera troupe in the Jia residence, and was in love with the young Dan Charmante."
			},
			{
				"label": "贾兰————Jia Lan",
				"value": 4,
				"image": "贾兰.png",
				"id": 3872,
				"categories": ["person"],
				"info": "贾珠与李纨之子。——————The son of Jia Zhu and Li Fan."
			},
			{
				"label": "贾珍——————Jia zhen",
				"value": 19,
				"image": "贾珍.png",
				"id": 3873,
				"categories": ["zhuyao"],
				"info": "贾敬之子，贾演曾孙。世袭三品爵威烈将军。生活穷奢极欲，虽有一妻二妾，但仍和儿媳秦可卿、妻妹尤二姐关系暧昧。秦可卿死后，是他流泪向王夫人请求让王熙凤料理丧事，让她“爱怎么办就怎么样办”，铺排浪费，为丧礼风光，特意花一千二百两银子为儿子贾蓉捐了个五品龙禁尉，而儿媳葬礼的奢华也证明了他们之间的不正当关系。后因作恶多端，被人参奏革去世职，发配海疆。——————Son of Jia Jing, great-grandson of Jia Yan. He was the son of Jia Jing and the great grandson of Jia Yan. Although he had one wife and two concubines, he still had an ambiguous relationship with his daughter-in-law, Qin Keqing, and his sister-in-law, You Er. After Qin Keqing's death, he spent 1,200 taels of silver to donate a fifth-grade Dragon Warrant Officer for his son Jia Rong, and the lavish funeral of his daughter-in-law proved their illicit relationship. Later, because of his evil deeds, he was dismissed from his post and sent to the sea."
			},
			{
				"label": "贾琏——————Jia Lian",
				"value": 25,
				"image": "贾琏.png",
				"id": 3874,
				"categories": ["zhuyao"],
				"info": "贾赦的长子，刑夫人无子女,异母妹妹迎春,wife王熙凤,女儿巧姐。他捐了个同知的官位，不读书谋求官位。住在荣国府，和妻子王熙凤帮着料理荣府家务，在贾府一众男子中算是第一得力干练之人。他最大的缺点是好色，但并不像贾珍、薛蟠等那样强人所难。女儿巧姐出天花，按迷信要夫妻分房，他一离开王熙凤就找“多姑娘” 鬼混。王熙凤去过生日宴会，他就把鲍二媳妇勾搭上手，见了尤二姐，又贪图其美色，骗娶为二房。父亲贾赦却夸他能干，又把自己的丫环秋桐赏给他。从他不赞同贾雨村为了几把扇子把石呆子害得坑家败业、真情对待尤二姐之死，以及劝阻王熙凤将彩霞配给旺儿品德不好的儿子等事中，可以看出他富有同情心、做事有底线，不以自己世家公子的身份压榨别人。他同王熙凤的关系由一开始的和美转为同床异梦，可以看成是王熙凤的悲剧，也是他的悲剧。——————Jia Pao's eldest son, half-sister Yingchun, wife Wang Xifeng, daughter Qiaojie. He donated an official position in the same Zhi, do not like to study to seek official position. He lives in the Rongguo Mansion, and helps to take care of it with his wife Wang Xifeng, and is considered to be the first competent person among all the men in the Jia Mansion. His greatest weakness was his lust for women, but he was not as forceful as Jia Zhen and Xue Ban. However, he is compassionate and does not use his position as the son of a noble family to exploit others. The relationship between him and Wang Xifeng changes from amicable at the beginning to sharing the same bed, which can be seen as Wang Xifeng's tragedy as well as his tragedy."
			},
			{
				"label": "贾琮——————Jia Cong",
				"value": 4,
				"id": 3875,
				"categories": ["person"],
				"info": "贾赦之子。——————Jia She's son"
			},
			{
				"label": "贾珠——————Jia Zhu",
				"value": 12,
				"id": 3876,
				"categories": ["person"],
				"info": "贾政嫡长子，与元春、宝玉均为王夫人所生，娶妻李纨，育子贾兰，在《红楼梦》中是作为已故人物。——————Jia Zheng, the first-born son of Jia Yuanchun and Jia Baoyu, both born to Lady Wang, married Li Wan and raised Jia Lan, who is a deceased character in Dream of the Red Chamber."
			},
			{
				"label": "贾环——————Jia Huan",
				"value": 10,
				"image": "贾环.png",
				"id": 3877,
				"categories": ["zhuyao"],
				"info": "同贾宝玉为同父异母的弟弟，其母为贾政之妾赵姨娘。贾环颇为顽劣，赶围棋玩耍时，与丫头莺儿撒泼耍赖。贾环十分忌恨其兄贾宝玉，多次陷害宝玉。故意拨翻烛台 ，烫伤宝玉。金钏跳井事件后，诬陷宝玉，使得宝玉遭受贾政毒打。贾环因常常受到不公平对待而生不平、妒嫉之心；贾环虽行为无赖，然而也算尚学，小有才华。——————Jia Baoyu is the half-brother of Jia Zheng's concubine, Aunt Zhao. Jia Huan was quite stubborn and played tricks on Oriole when they were playing Go. Jia Huan was very jealous of his brother, Jia Baoyu, and repeatedly framed Baoyu. Jia Huan was jealous of the unfair treatment he received and was very jealous of his brother."
			},
			{
				"label": "贾璜——————Jia Huang",
				"value": 8,
				"id": 3878,
				"categories": ["person"],
				"info": "贾家“玉”字辈嫡派，璜大奶奶金氏的老公，金荣的姑父。远不如宁荣二府的富势，夫妻俩只守着些小的产业。第十回中道：‘时常到宁荣二府里去请请安，又会奉承凤姐儿并尤氏，所以凤姐儿尤氏也 时常资助资助他，方能如此度日。请安，奉承，尤显得当时宁荣二府溜须拍马之风盛行。——————Jin's husband, Jin Rong's aunt. Far less wealthy than Ning Rong's second Mansion, the couple only kept some small estates. In the middle of Chapter 10, he often went to Ning Rong's two mansions to pay his respects, and would flatter Wang Xifeng and You, so Wang Xifeng and You would often sponsor and support him."
			},
			{
				"label": "贾演————Jia Yan",
				"value": 5,
				"id": 3879,
				"categories": ["person"],
				"info": "荣国公贾源的胞兄，被朝廷封为宁国公，底下有四子（书中仅提及长子贾代化），死后由长子贾代化继承其爵位，贾演与贾源为贾府家业的开创者。——————Rongguo Duke Jia Yuan's brother-in-law, he was named Ningguo General by the court and had four sons under him (only the eldest son Jia Daihua is mentioned in the book), who inherited his title after his death."
			},
			{
				"label": "贾源——————Jia Yuan",
				"value": 4,
				"id": 3880,
				"categories": ["person"],
				"info": "宁国公贾演的胞弟，被朝廷封为荣国公。他是宁国公贾演的胞弟，贾政、贾赦的祖父，贾宝玉的曾祖父。贾源被朝廷封为荣国公，死后由长子贾代善继承其爵位。——————The younger brother of the Duke of Ning, Jia Yan, was named General of the Rongguo by the court. He was the grandfather of Jia Zheng and Jia Pao, and the great-grandfather of Jia Baoyu. After his death, his title was inherited by his eldest son, Jia Daishan"
			},
			{
				"label": "秦钟——————Qin Zhong",
				"value": 10,
				"image": "秦钟.png",
				"id": 3881,
				"categories": ["zhuyao"],
				"info": "表字鲸卿。秦业五十三岁时得的儿子，秦可卿的弟弟。他生得眉清目秀，粉面朱唇，身材俊俏，举止风流，怯怯羞羞的有些女儿之态。秦钟本性怯弱，且带病未痊，受了笞杖，今见老父气死，又添了许多病症，不几日也死了。——————Qin Zhong is around 12 when he first meets Baoyu and only survives for a few years. His elder sister is Qin Keqing, Baoyu's nephew Jia Rong's wife, and so he is technically a generation younger than Baoyu. Both he and Qin Keqing are the adopted children of Qin Ye (秦業). The two boys get along marvelously well and decide to enroll in the Jia clan's school together and become study-mates. He becomes Baoyu's best friend and perhaps lover, mocked by schoolmates for their closeness."
			},
			{
				"label": "王子腾——————Wang ziteng",
				"value": 4,
				"id": 3882,
				"categories": ["person"],
				"info": "都太尉统制县伯王公之后裔，王夫人、薛姨妈、王子胜之兄。初任京营节度使，后擢九省统制，奉旨查边，旋升九省都检点。鲍二家的自缢后，阻其娘家亲戚申诉，并左右都察院审理张华一案的，都是王熙凤倚王子腾之势所为。而他又因贾雨村私断金陵命案便累上保本、引荐雨村进京。——————Lady Wang, Auntie Xue and Prince Sheng's brother. The first served as the capital camp commander, after Mew nine provinces command system, ordered to check the border, spin up nine provinces are prosecutors. She was promoted to Commander of the Nine Provinces and was ordered to check the borders, and was then promoted to inspector of the Nine Provinces. He also introduced Jia Yucun to the capital because of his involvement in the Jinling murder case."
			},
			{
				"label": "王公之子——————General Wang's son.",
				"value": 7,
				"id": 3883,
				"categories": ["person"],
				"info": "王熙凤之祖父。——————Grandfather of Wang Xifeng."
			},
			{
				"label": "王仁——————Wang Ren",
				"value": 4,
				"id": 3884,
				"categories": ["person"],
				"info": "王仁是王熙凤的brother，贾巧姐的舅舅，王仁在这里其实就是“忘仁”的意思，说明他是个忘却仁义的小人，后来贾家败落，王仁居然将自己的外甥女贾巧姐卖到了烟花柳巷之地，几乎害了她一生，幸亏由刘姥姥救出。——————Wang Ren was Wang Xifeng's brother and Jia Qiao's uncle, a villain who forgot about benevolence and righteousness, and then when the Jia family fell, Wang Ren actually sold his niece, Jia Qiao, to a brothel and almost ruined her life."
			},
			{
				"label": "薛蟠——————Xue Pan ",
				"value": 17,
				"image": "薛蟠.png",
				"id": 3885,
				"categories": ["zhuyao"],
				"info": "字文龙（一作“文起”），外号“呆霸王”，薛姨妈之子，薛宝钗之兄。因幼年丧父，寡母又纵容溺爱，终日唯有斗鸡走马，游山玩水。薛蟠任性弄气，诨号呆霸王。不过，薛蟠也很重义气。——————He is a ne'er-do-well lout who is guilty of the killing of a man over a beautiful slave girl, Zhen Yinglian, who is renamed as Xiangling (Lotus). He has the manslaughter case done over with money, then escapes to the capital from Jinling.He is the elder brother of Xue Baochai and the son of Aunt Xue. Pan was also a local bully in Jinling City, where the Xues came from. He is a total opposite of Baochai, who is tactful and cultivated, although he has genuine respect for his sister. He is on the other hand tactless and uncouth, and mixes around with bad company. He eventually marries a shrew, Xia Jingui, who causes much misery to Aunt Xue, Baochai, Xiangling and himself."
			},
			{
				"label": "薛蝌——————Xue Ke",
				"value": 5,
				"image": "薛蝌.png",
				"id": 3886,
				"categories": ["zhuyao"],
				"info": "皇商之子，薛姨妈的侄儿，薛宝琴的胞兄，薛宝钗的堂弟。——————The son of an imperial merchant, nephew of Aunt Xue, brother of Xue Baoqin and cousin of Xue Baochai."
			},
			{
				"label": "史鼐————Shi Nai",
				"value": 2,
				"id": 3887,
				"categories": ["person"],
				"info": "世袭保龄侯、尚书令史公之次孙(也就是史公的嫡长子的次子)，忠靖侯史鼎之兄，史湘云之叔，贾母之侄。——————Uncle of Shi Xiangyun, nephew of Jia Mu."
			},
			{
				"label": "史鼎——————Shi ding",
				"value": 2,
				"id": 3888,
				"categories": ["person"],
				"info": "史湘云之叔，贾母之侄。——————Uncle of Shi Xiangyun, nephew of Grandma Jia ."
			},
			{
				"label": "史侯之子——————son of Marquis Shi",
				"value": 6,
				"id": 3889,
				"categories": ["person"],
				"info": "贾母的哥哥。——————Grandmother Jia's brother."
			},
			{
				"label": "柳湘莲——————Liu Xianglian",
				"value": 8,
				"image": "柳湘莲.png",
				"id": 3890,
				"categories": ["zhuyao"],
				"info": "又称冷面二郎，原系世家子弟。他父母早丧，读书不成。性情豪爽，酷好耍枪舞剑，赌博吃酒，以至眠花宿柳，吹笛弹筝，无所不为。他生得又美，是一个业余的戏剧演员，最喜串戏，擅演生旦风月戏文，在书中和宝玉最合得来。有一次在赖大家赴宴，薛蟠酒后向他调情，被他骗至北门（今德胜门）外苇子坑打了个半死，事后，远走他乡。 后又在路上救了薛蟠，与薛蟠结为兄弟。足见其无邪之心。行事草率，不负责任。——————His parents died at an early age and he was unable to study. He is a bold and generous man who is good with guns and swords, gambling, drinking, playing the flute and zither, and everything else. He was a very pretty boy, an amateur dramatic actor, and he got along well with Baoyu in the books. Once, when Xue Pang flirted with him after a banquet at Lai's house, he beat him half to death and then left for another country. Afterwards, he ran away from his hometown and saved Xue Ban on the way. This shows his innocence. He acted rashly and irresponsibly."
			},
			{
				"label": "贾雨村——————Jia Yucun",
				"value": 9,
				"image": "贾雨村.png",
				"id": 3891,
				"categories": ["zhuyao"],
				"info": "贾雨村是一个提纲挈领式的人物，以“假语村言”提醒读者，统率全文。 贾雨村，名化，字时飞，别号雨村，故为“假语村言”。原系湖州人氏，生于仕宦人家。但到他时，祖宗根基已尽，人口衰丧，只剩下他一人。他想进京求取功名，无奈囊内空空，只得暂寄姑苏城里葫芦庙中安身，每日卖文作字为生。后因甄士隐相助，他才有钱上路，考中进士，做了知府。不久因贪酷徇私被革职，受聘至林如海家任林黛玉启蒙教师。在贾政的极力帮助下，他又官复原职，但为官不正，乱判了一起“葫芦案”（为“糊涂案”），后来这一案件被世人所知，因为“因嫌纱帽小，致使锁枷杠”。——————Jia Yucun was the childhood tutor of Lin Daiyu. He later ask the help of his distant relatives in the Jia Family to obtain a job and title in the capital."
			},
			{
				"label": "贾瑞————Jia Rui",
				"value": 4,
				"image": "贾瑞.png",
				"id": 3892,
				"categories": ["zhuyao"],
				"info": "贾府义学塾贾代儒的长孙。贪图便宜又好色，欺自己的嫂子，死于王熙凤设的“相思局”中。——————Jia Dai Ru's eldest grandson. He was cheap and lustful, greedy for his sister-in-law's beauty, and eventually died in a love-affair set up by Wang Xifeng."
			},
			{
				"label": "蒋玉菡——————Jiang Yuhan",
				"value": 6,
				"id": 3893,
				"categories": ["zhuyao"],
				"info": "忠顺王府戏班的名角，擅唱小旦，小名琪官（一作棋官）。贾宝玉曾以玉玦扇坠和袭人所给松花汗巾相赠，蒋玉菡回赠以北静王所赐茜香国女国王贡奉的大红汗巾。贾府彻底败落后，蒋玉菡娶宝玉房中大丫头袭人为妻。在贾府被抄家后，蒋玉菡夫妇资助了贫穷的贾宝玉夫妇。蒋玉菡妩媚温柔，随机应答，很有礼貌。——————A famous actress in the opera troupe of the Zhongshun royal family, she was an excellent singer and was known by her nickname Bijou, and was given a jade pendant and a turquoise kerchief by Aroma in return for which she was given a red kerchief by the King of Northern Jing. The Jia family was completely ruined and Jiang Yuhan married Aroma. After the confiscation of the Jia residence, Jiang Yuhan and his wife support the poor Jia Baoyu and his wife. Jiang Yuhan is feminine and gentle, and responds to random questions."
			},
			{
				"label": "贾芸——————Jia Yun",
				"value": 7,
				"image": "贾芸.png",
				"id": 3894,
				"categories": ["zhuyao"],
				"info": "生有一张容长脸儿，长挑身材，甚是斯文清秀。父亲早逝，因贾宝玉一句玩笑话“像我儿子”，他便伶俐地说：“如若宝叔不嫌侄儿蠢笨，认作儿子，就是我的造化了。”贾芸，贾府族人，西廊下五嫂子的儿子。为了到荣国府谋事做，对凤姐百般奉承，又夸她能干又送她香料，得了一个管花草的职位。而为了攀入贾府中心，他不惜对小他几岁的宝玉认父亲，并赠了两盆白海棠。而他也是一个重情重义的人，贾府败落后帮助过身陷困境的宝玉和凤姐，并爱上了丫头小红，捡到她的手帕后一番接触，两人渐渐陷入爱河，上演了一出和宝黛之恋同样纯美的爱情故事。——————Jia Yun, a member of the Jia Clan. In order to find a job in the Rongguo residence, she flatters Wang Xifeng, praises her for her ability and gives her spices, and gets a position in charge of flowers and plants. In order to get into the heart of the Jia family, he acknowledges his father to Jia Baoyu, who is a few years younger than him, and gives her two pots of white begonias. He is also a man of great affection and loyalty, after the defeat of the Jia family, helped Jia Baoyu and Wang Xifeng in trouble, and fell in love with the girl Crimson, found her handkerchief after the two gradually fell in love, staged a pure and beautiful love story!"
			},
			{
				"label": "倪二——————Ni Er",
				"value": 2,
				"image": "倪二.png",
				"id": 3895,
				"categories": ["person"],
				"info": "贾芸的街坊，绰号醉金刚，虽是个泼皮无赖，“却因人而使，颇颇的有义侠之名”，故作者特设回目《醉金刚轻财尚义侠》。——————The Drunken Diamond shows nobility of character in handling his money, and the Quiet-voiced Girl provides material for fantasy by losing her handkerchief.(CHAPTER 24)"
			},
			{
				"label": "林如海——————Lin Ruhai",
				"value": 5,
				"image": "林如海.png",
				"id": 3896,
				"categories": ["zhuyao"],
				"info": "姑苏林家的子孙，娶妻贾敏（已先于林如海病故），育有一子，三岁时没了，仅有一女林黛玉。——————A scion of the Lin family, soochow married Jia Min (who had already preceded Lin Ruhai in illness) and had a son, who was lost at the age of three, and Lin Daiyu was his daughter."
			},
			{
				"label": "焦大——————Jia Da",
				"value": 2,
				"image": "焦大.png",
				"id": 3897,
				"categories": ["zhuyao"],
				"info": "从小跟宁国公贾演出过三四回兵，曾从死人堆里把奄奄一息的主子背出来。没有饭吃，他饿著肚子去偷东西给主子吃，没有水喝，他自己喝马尿，把得来的半碗水给主子喝。由于以往的功劳情分，宁府的主子们对他另眼相看，不大难为他。他对宁国府后代糜烂的生活深恶痛绝，也只有他在喝醉酒后敢大骂他们：“每日偷狗戏鸡，爬灰的爬灰，养小叔子的养小叔子”，吓得众小厮魂飞魄丧，把他捆起来，用土和马粪满满填了他一嘴。——————Since he was a child, he had been on three or four expeditions with Jia act, and had carried the dying Jia act out from the dead. With no food to eat, he went hungry and stole food for his masters. Due to his past merits, NingMansion's masters looked at him differently and did not have much trouble with him. He abhorred the surly lives of Ning's offspring, and he was the only one who dared to curse them when he was drunk."
			},
			{
				"label": "秦业——————Qin Ye",
				"value": 2,
				"id": 3898,
				"categories": ["person"],
				"info": "秦钟生父，秦可卿养父。他的名字有一种隐意，是“情孽”.任工部营缮郎，夫人早亡，因素与贾府有些瓜葛，故将养女许配给了贾蓉。五旬之上方得了秦钟，因此对儿子期望极高。纵使宦囊羞涩，仍东拼西凑的恭恭敬敬封了二十四两贽见礼，亲自带了秦钟，来代儒家拜见了。这一点倒是和现代人很相像的。正是：早知日后闲争气，岂肯今朝错读书。当他有发现水月庵智能私找秦钟，气得旧病发作而亡。——————Qin Zhong's biological father, Qin Keqing's adoptive father. His wife died young, and the factor had some connection with the Jia family, so he betrothed his adopted daughter to Jia Rong. Qin Zhong was only in his fifties when he gave birth to Qin Zhong, so he had high expectations of his son. When he discovers that Sapientia, a nun of the River Goddess Convent, is looking for Qin Zhong, he is furious and dies of an old illness."
			},
			{
				"label": "王公——————Lord Wang",
				"value": 2,
				"id": 3899,
				"categories": ["person"],
				"info": "王夫人之祖父。——————Lady Wang's grandfather"
			},
			{
				"label": "贾代儒之子——————Jia Daiyu's son",
				"value": 3,
				"id": 3900,
				"categories": ["person"],
				"info": "贾代儒之子。——————Jia Daiyu's son"
			},
			{
				"label": "薛公之孙——————Grandson of Lord Xue.",
				"value": 1,
				"id": 3901,
				"categories": ["person"],
				"info": "薛公之孙。——————Grandson of Lord Xue."
			},
			{
				"label": "史侯——————Marquis Shi",
				"value": 3,
				"id": 3902,
				"categories": ["person"],
				"info": "红楼梦中史侯是史湘云祖父的父亲，有两个孩子，分别是史太君和史湘云祖父。女孩史太君嫁入贾代善门下，也就是我们说的贾母。而儿子有三个孩子，史鼐和史鼎和史湘云的爸爸。史湘云父母只有史湘云一个孩子，史湘云嫁给了卫若兰。——————In Dream of Red Mansions, Marquis Shi is the father of Shi Xiangyun's grandfather, who has two children, Shi Taijun (Grandmother Jia) and Shi Xiangyun's grandfather. The son has three children, Shi Nai and Shi Ding and one is Shi Xiangyun's father. Shi Xiangyun's parents had only one child, Shi Xiangyun married Wei Ruolan."
			},
			{
				"label": "甄士隐——————Zhen Shiyin",
				"value": 8,
				"image": "甄士隐.png",
				"id": 3903,
				"categories": ["zhuyao"],
				"info": "姓甄，名费，谐音“废”，字士隐。“甄士隐”取意为“真事隐”。书中有“因曾历过一番梦幻之后，故将真事隐去。”一句。正如贾雨村是“假语村言”一样。甄士隐是和贾雨村两相对照而写的，作者在开卷第一段里就明确表示他撰拟这两个名字的寓意。写甄士隐是为了写一个经历了骨肉分离、家遭火灾、下半世坎坷而终于醒悟出世的人物形象。他可能是作者自身的影子，同时也是提系着全书主题的一个线索。——————Zhen Shiyin also known as Zhen Fei is the father of Xiangling. He is also a good friend of Jia Yucun. In the Chapter 1, his daughter get kidnapped and he never see her again. He may be the author's own shadow, but also a mention A clue to the theme of the book."
			},
			{
				"label": "邢忠——————Xing Zhong",
				"value": 2,
				"image": "邢忠.png",
				"id": 3904,
				"categories": ["person"],
				"info": "邢岫烟父，邢夫人兄，薛蝌岳父。他因家中艰难，故携家上京投靠贾府。——————He was the father of Xing Xiuyan, the brother of Lady Xing, and the father-in-law of Xue Tadao. Because of his family's hardships, he took his family to the capital to join the Jia family."
			},
			{
				"label": "板儿——————Ban Er",
				"value": 7,
				"image": "板儿.png",
				"id": 3905,
				"categories": ["zhuyao"],
				"info": "刘姥姥的外孙。在小说第六回“刘姥姥一进荣国府”中，多处生动地描写了板儿未经世面的村野孩童形象。及至成年，娶贾巧姐为妻。——————Granny Liu's grandson. In Chapter 6, when Granny Liu enters the Rongguo residence, there are many vivid depictions of Ban er as an untutored village child. When he reaches adulthood, he marries Jia Qiaojie."
			},
			{
				"label": "孙绍祖——————Sun Shaozu",
				"value": 5,
				"image": "孙绍祖.png",
				"id": 3906,
				"categories": ["zhuyao"],
				"info": "迎春丈夫孙绍祖在家境困难时曾经拜倒在贾府门下，乞求帮助。后来，孙绍祖在京袭了官职，又“在兵部候缺题升”，贾家衰败后，孙绍祖向他逼债，任意践踏迎春。迎春判词有“迎春遭遇中山狼”一幅，画中的孙绍祖，高壮如异兽，十分可怕。“中山狼”之形态毕出也。在这桩弱女悍夫的不幸婚姻的室内细节，文字没有写到之处，似乎都可从画中窥出。——————Jia Yingchun's husband, Sun Shaozu, was once begging for help from the Jia family when the family was in dire straits. Later, Sun Shaozu became an official in the capital and trampled on Jia Yingchun at will. He is a vicious and terrible xiao."
			},
			{
				"label": "李贵——————Li Gui",
				"value": 2,
				"image": "李贵.png",
				"id": 3907,
				"categories": ["zhuyao"],
				"info": "李嬷嬷子，宝玉之贴身跟班。虽不识书，学舌什么“呦呦鹿鸣，荷叶浮萍”，但颇明事理，众顽童大闹学堂时亏他力劝，并指明各人的不是，方才平息了事端。宝玉探秦钟时，他亦如长兄般慰藉。他在贾府中亦是体面的男仆，有小厮服侍。——————The son of Jia Baoyu's nanny, Baoyu's personal sidekick. Although he is not a scholar, he is quite sensible and sensible. When the children were making a scene in the school, he helped to calm down the situation by showing them what was wrong. When Baoyu visited Qin Zhong, he was as comforting as an elder brother. In the Jia residence, he was also a respectable manservant, with other servants to serve him."
			},
			{
				"label": "赵天梁——————Zhao Tianliang",
				"value": 1,
				"id": 3908,
				"categories": ["person"],
				"info": "贾琏的乳母的儿子。——————Gabriel's nanny's son."
			},
			{
				"label": "赵天栋——————Zhao Tiandong",
				"value": 1,
				"id": 3909,
				"categories": ["person"],
				"info": "贾琏的乳母的儿子。——————Gabriel's nanny's son"
			},
			{
				"label": "贾代儒——————Jia Dairu",
				"value": 14,
				"image": "贾代儒.png",
				"id": 3910,
				"categories": ["zhuyao"],
				"info": "贾代儒是贾府中“代”字辈的长辈，其人生有三大不幸：早年丧父，中年丧子，晚年丧孙。宝玉两次进塾就读，八股文也是跟他学的。他儿子、儿媳均早亡，故担负起对孙子的教养责任。他对贾瑞管教甚严，一旦贾瑞在外擅自过夜，他必定重罚。——————Jia Dai Ru was the elder of the Jia family, and his life was marked by three major misfortunes: the loss of his father in his early years, the loss of his son in his middle years, and the loss of his grandson in his later years. Bao Yu went to school twice, and learned the Eight Gu Zi from him. His son and daughter-in-law all died young, so he took on the responsibility of raising his grandson. He was very strict with Jia Rui, and if Jia Rui stayed overnight without permission, he would always punish him severely."
			},
			{
				"label": "赖大——————Lai Da",
				"value": 4,
				"image": "赖大.png",
				"id": 3911,
				"categories": ["person"],
				"info": "赖嬷嬷之子，赖尚荣之父。是“熬了两三辈子，好容易挣出”来的“家生子儿”，因为赖嬷嬷“年高服侍过”贾府的老主子，又得到贾母的“赏脸”，他才做了荣府大总管。——————Grandma Lai's son, Lai Shangrong's father. It was because Sister Lai had served the old master of the Jia Mansion before and was favored by the Jia mother that he became the head housekeeper of the Mansion."
			},
			{
				"label": "赵国基——————Zhao Guoji",
				"value": 1,
				"id": 3912,
				"categories": ["person"],
				"info": "赵姨娘弟弟，荣府男仆。曾随侍贾环上学。赵国基死时，正值探春理家，为了发送赏银的多寡，赵姨娘与探春曾翻脸大闹。——————Aunt Zhao's younger brother, a servant in the Rong residence. He used to attend school with Jia Huan. At the time of Zhao Guoji's death, when Jia Tanchun was managing the household, Auntie Zhao and Jia Tanchun had a big falling out over a small amount of reward money."
			},
			{
				"label": "吴贵——————Wu Gui",
				"value": 3,
				"id": 3913,
				"categories": ["person"],
				"info": "晴雯的姑舅brother，老实胆小，人都叫他贵儿。——————Skybright's aunt and brother. Honest and timid."
			},
			{
				"label": "花自芳——————Hua Zifang",
				"value": 1,
				"image": "花自芳.png",
				"id": 3914,
				"categories": ["person"],
				"info": "怡红院大丫环花袭人之兄。 因生活困顿，与父母一道将袭人卖与贾府。父亲死后，情况渐好，遂又和母亲商议，要赎出袭人。宝玉私访花家，自芳惶恐相见，殷勤款待，曲尽奴才之意。——————Aroma is the brother of Aroma, the eldest maid in Yik Hong Yuan. After his father's death, the family's situation improves, and he and his mother discuss the possibility of redeeming Aroma."
			},
			{
				"label": "王成之父——————Wang Cheng's father",
				"value": 1,
				"id": 3915,
				"categories": ["person"],
				"info": "王成之父昔年与凤姐之祖王夫人之父认识。因贪王家的势利，便连了宗认作侄儿。——————Wang Cheng's father was acquainted with Lady Wang's father in the past. He was greedy for the Wang family's wealth, so he took her as his nephew."
			},
			{
				"label": "王成——————Wang Cheng",
				"value": 3,
				"id": 3916,
				"categories": ["person"],
				"info": "刘姥姥的亲家，王狗儿之父。因家业萧条，合家搬往城外乡下居住，在刘姥姥初进大观园前不久病故。——————Granny Liu's in-laws, the father of Wang Gu'er. Because of the lack of money, the family moved to the countryside and died shortly before Granny Liu's first visit to the Grand View Garden."
			},
			{
				"label": "狗儿————Gou er",
				"value": 6,
				"id": 3917,
				"categories": ["person"],
				"info": "王成之子，刘姥姥女婿。祖上曾作小京官，周瑞昔年为争买田地事，曾得他一臂之力。后家道中落，便务农为业。他在穷愁困顿中听到刘姥姥去贾府走动的建议，赶紧怂恿刘姥姥启身前往。——————Son of Wang Cheng, son-in-law of Granny Liu. His ancestor used to be a small government official in Beijing, and Zhou Rui used to help him buy land. His family had fallen on hard times, so he worked as a farmer. In the midst of poverty, he heard Granny Liu's suggestion to go to the Jia Mansion to ask for money, and encouraged Granny Liu to go there."
			},
			{
				"label": "周瑞————Zhou Rui",
				"value": 4,
				"image": "周瑞.png",
				"id": 3918,
				"categories": ["person"],
				"info": "冷子兴岳丈。荣府的男管家。——————Leng Zixing's father-in-law. Rong Mansion's male butler."
			},
			{
				"label": "林之孝——————Lin Zhixiao",
				"value": 3,
				"image": "林之孝.png",
				"id": 3919,
				"categories": ["person"],
				"info": "荣国府管家，负责管理银库账房的，为人处世十分低调。——————The Mansion of Rongguo, who manages the bank accounts, is very discreet."
			},
			{
				"label": "鲍二————Bao er",
				"value": 2,
				"id": 3920,
				"categories": ["person"],
				"info": "贾府男仆。————servant of the Jia Mansion"
			},
			{
				"label": "金文翔——————Kim Wencheung",
				"value": 3,
				"id": 3921,
				"categories": ["person"],
				"info": "鸳鸯的brother。他是贾母房里的买办。——————Faithful's brother. He's the buyer in Grandma Jai's house."
			},
			{
				"label": "香怜——————Xiang Lian",
				"value": 2,
				"id": 3922,
				"categories": ["person"],
				"info": "贾家义学中的小学生。——————Pupils in the Jiajia Yi School"
			},
			{
				"label": "贾菌————Jia Jun",
				"value": 5,
				"id": 3923,
				"categories": ["person"],
				"info": "荣府近派的重孙，娄氏之子。少孤，在家塾中读书时与贾兰最好，年纪虽小，志气却大，极是淘气不怕人的，在顽童闹学时，他不肯吃亏，十分顽皮。——————The great grandson of Rong mansion near school, son of Lou. When he was studying in the family school, he was the best with Jia Lan, who was very naughty despite his young age and great ambition."
			},
			{
				"label": "贾蓝——————Jia Blue",
				"value": 4,
				"id": 3924,
				"categories": ["person"],
				"info": "贾蓝在《红楼梦》中只是一个符号式的人物，是个“牛心左性”的孩童而已。——————Jia blue is only a symbolic character in the Dream of the Red Chamber."
			},
			{
				"label": "金荣——————Kim Rong",
				"value": 3,
				"id": 3925,
				"categories": ["person"],
				"info": "贾璜的娘家侄子。——————Juan's wife's maiden nephew."
			},
			{
				"label": "茗烟——————Tealeaf ",
				"value": 5,
				"image": "茗烟.png",
				"id": 3926,
				"categories": ["zhuyao"],
				"info": "贾宝玉最得力的书僮和小厮就叫焙茗。 一般认为焙茗即茗烟。但早期版本的《红楼梦》中并未交代改名事宜。 程本及后来的通行本在二十四回中有交代： 只见茗烟在那里掏小雀儿呢。贾芸在他身后，把脚一跺，道：“茗烟小猴儿又淘气了！”茗烟回头，见是贾芸，便笑道：“何苦二爷唬我们这么一跳。”因又笑说：“我不叫‘茗烟’了，我们宝二爷嫌‘烟’字不好，改了叫‘焙茗’了。二爷明儿只叫我焙茗罢。”贾芸点头笑着同进书房，便坐下问：“宝二爷下来了没有？”——————Jabberwocky's best servant boy and lackey, who had once changed his name."
			},
			{
				"label": "潘又安——————Pan Youan",
				"value": 2,
				"image": "潘又安.png",
				"id": 3927,
				"categories": ["zhuyao"],
				"info": "贾府小厮，司棋青梅竹马的姑舅表弟。他性格懦弱，胆小怕事，跟司棋在大观园幽会被鸳鸯撞见，畏罪远遁。他发财回家，意欲迎娶司棋，无奈司母不从，司棋撞墙身亡，他也殉情自尽。——————A young man from the Jia Mansion, Chess' childhood friend's uncle and cousin. He is cowardly and fearful, so he runs away with Chess when they meet in the Grand View Garden. He is a rich man who wants to marry Chess, but Chess's mother refuses to let him, so he crashes into a wall and dies."
			},
			{
				"label": "贾芹——————Jia Qin",
				"value": 2,
				"image": "贾芹.png",
				"id": 3929,
				"categories": ["person"],
				"info": "贾府小和尚小道士的总管。他在贾家祖庙里，夜夜聚赌，贾政见后，革去了他的总管一职。——————The head of the little monk and priest of the Jaffa House. He was in the ancestral temple of the Jia family, gathering nightly to gamble, and when Jia Zheng met him, he dismissed him from his position as chief steward."
			},
			{
				"label": "玉爱——————Yu Ai",
				"value": 1,
				"id": 3930,
				"categories": ["person"],
				"info": "贾家义学中的小学生。——————A pupil of the Jia Jia Yi School."
			},
			{
				"label": "来升——————Lai Sheng",
				"value": 3,
				"id": 3931,
				"categories": ["person"],
				"info": "首见第十回《金寡妇贪利权受辱 张太医论病细穷源》。——————Appeared in Chapter 10‘Widow Jin’s self-iinterest gets the better of her righteous indignation，and Doctor Zhang’s diagnosis reveals the origin of a puzzling disease’"
			},
			{
				"label": "俞禄——————Yu Lu",
				"value": 3,
				"id": 3932,
				"categories": ["person"],
				"info": "俞禄是一个小管家。——————Yu Lu is a little housekeeper."
			},
			{
				"label": "杏奴——————Apricots",
				"value": 1,
				"id": 3933,
				"categories": ["person"],
				"info": "柳湘莲的小厮。——————Liu Xianglian's slave."
			},
			{
				"label": "赖尚荣——————Lai Shangrong",
				"value": 3,
				"image": "赖尚荣.png",
				"id": 3934,
				"categories": ["person"],
				"info": "赖嬷嬷的孙子。赖家本是贾家的家生奴仆，但赖尚荣一落娘胎，就被主子放了出来，成为自由人。——————Grandma Lai's grandson. The Lai family was originally the family servant of the Jia family, but was free from Lai Shang-rong."
			},
			{
				"label": "金彩————Jin Cai",
				"value": 2,
				"id": 3935,
				"categories": ["person"],
				"info": "鸳鸯、金文翔之父，出生于1841年——————The father of Faithful and Kim Wencheung was born in 1841."
			},
			{
				"label": "邢德全——————Xing dequan",
				"value": 1,
				"id": 3936,
				"categories": ["person"],
				"info": "邢夫人胞弟，邢岫烟之叔。——————Mrs. Xing's younger brother, uncle of Xing Xiuyan."
			},
			{
				"label": "隆儿——————Rong Er",
				"value": 1,
				"id": 3937,
				"categories": ["person"],
				"info": "贾琏的小厮。——————Jia Lian's Slave"
			},
			{
				"label": "兴儿——————Xing Er",
				"value": 3,
				"id": 3938,
				"categories": ["person"],
				"info": "贾琏的心腹小厮，他曾对尤二姐细说荣府成员。后王熙凤发觉贾琏偷娶一事，就拿他来盘问，要他自己打自己嘴巴。————————Jia Lian's Slave，He was once told by Yu Er that he was a member of the Rong Mansion. Later, Wang Xifeng discovers Jia Lian's secret marriage and questions him about it."
			},
			{
				"label": "王善保——————Wang Shanbao",
				"value": 2,
				"id": 3939,
				"categories": ["person"],
				"info": "十二家人之一。 邢夫人的slave。——————One of the Twelve Families. Lady Xing's servant."
			},
			{
				"label": "冷子兴——————Leng Zixing",
				"value": 5,
				"image": "冷子兴.png",
				"id": 3940,
				"categories": ["person"],
				"info": "冷子兴是周瑞的女婿，都城中的古董商，和贾雨村是好朋友。他对贾雨村介绍荣国府，使贾家众人在他口中整体亮相。——————Leng Zixing is Zhou Rui's son-in-law, an antique dealer in the capital, and a good friend of Jia Yucun. He introduces the Rongguo residence to Jia Yucun, making the Jia family's overall appearance in his mouth."
			},
			{
				"label": "卜世仁——————Pu Shiren",
				"value": 1,
				"image": "卜世仁.png",
				"id": 3941,
				"categories": ["person"],
				"info": "贾芸母舅，香料铺主人。——————Jia Yun's maternal uncle, owner of the spice shop."
			},
			{
				"label": "冯紫英——————Feng Ziyin",
				"value": 1,
				"image": "冯紫英.png",
				"id": 3942,
				"categories": ["person"],
				"info": "冯紫英是神武将军冯唐之子，与贾府中贾宝玉、薛蟠等人都有来往。——————Feng Ziying was the son of Feng Tang, a powerful general, and had dealings with Jia Baoyu and Xue Ban in the Jia family."
			},
			{
				"label": "凤姐之父——————Wang Xifeng's father",
				"value": 4,
				"id": 3943,
				"categories": ["person"],
				"info": "有钱的皇商氏族——————The wealthy royal merchant clan."
			},
			{
				"label": "史湘云之父—————Shi Xiangyun's father",
				"value": 2,
				"id": 3944,
				"categories": ["person"],
				"info": "史侯之子。——————The Margrave's son."
			},
			{
				"label": "卫若兰——————Wei Ruolan",
				"value": 2,
				"image": "卫若兰.png",
				"id": 3945,
				"categories": ["person"],
				"info": "在《红楼梦》中只出现过很少的几次，仅在秦氏出殡时出现了一次，书中点明他的身份是“王孙公子”。他之所以成为引人注目的人物，是由于脂批的特意提及。——————He appears only a few times in Dream of the Red Chamber, and only once at Qin's funeral, where he is identified as son of nobility. The reason why he became a notable figure is that he is specifically mentioned in the fat lottery."
			},
			{
				"label": "梅翰林之子——————Son of Hanlin Mei",
				"value": 2,
				"id": 3946,
				"categories": ["person"],
				"info": "薛宝琴的丈夫。——————Xue Baoqin's husband."
			},
			{
				"label": "吴兴登——————Wu Xingdeng",
				"value": 2,
				"id": 3947,
				"categories": ["person"],
				"info": "贾府家仆。——————servant of the Jia family"
			},
			{
				"label": "旺儿——————Wang ER",
				"value": 5,
				"image": "旺儿.png",
				"id": 3948,
				"categories": ["person"],
				"info": "旺儿，又叫来旺儿，是王熙凤的小厮。——————Wang Er, also known as Lai Wanger, is Wang Xifeng's slave."
			},
			{
				"label": "封肃——————Su Feng",
				"value": 2,
				"id": 3949,
				"categories": ["person"],
				"info": "封肃是甄士隐的岳父，殷实的务农人家。——————Zhen Shiyin's father-in-law, an honest farmer's family"
			},
			{
				"label": "李纨之哥——————Li Wan's Brother ",
				"value": 2,
				"id": 3950,
				"categories": ["person"],
				"info": "李纨之哥。——————Li Wan's Brother"
			},
			{
				"label": "小沙弥——————little sandman",
				"value": 3,
				"image": "门子.png",
				"id": 3951,
				"categories": ["zhuyao"],
				"info": "贾雨村的门子，见风使舵，善于专营。——————He Jia Yucun's subordinates are good at flexibility and interpersonal relationships."
			},
			{
				"label": "皇上——————the Emperor",
				"value": 1,
				"id": 3952,
				"categories": ["person"],
				"info": "没有具体提到，是贾元春的husband。——————It's not specifically mentioned. He is Jia Yuanchun's husband."
			},
			{
				"label": "薛姨父——————Uncle Xue",
				"value": 2,
				"id": 3953,
				"categories": ["person"],
				"info": "薛蟠之父。——————Xue Pan's father"
			},
			{
				"label": "北静王——————King Bejing",
				"value": 3,
				"image": "北静王.png",
				"id": 3954,
				"categories": ["zhuyao"],
				"info": "北静王，名水溶，年未弱冠，形容秀美，性情谦和。因祖上与贾府有世交之谊，故从未以异姓相见，更不以王位自居。——————King Bejing, known as Shuirong, is a young man with a handsome face and a modest disposition. Because of his ancestor's friendship with Jiafu, he has never met anyone with a different surname, nor does he claim to be a king."
			},
			{
				"label": "应天府——————Yingtian Mansion",
				"value": 2,
				"id": 3955,
				"categories": ["location"],
				"info": "应天府是今天河南的商丘。而金陵是指南京，明时称应天。应天和应天府不是同一个地方。曹雪芹本来就是故意混淆了红楼的时间和地点。——————Yingtian Mansion is now Shangqiu, Henan Province. And Jinling means Nanjing, which was called Yingtian in the Ming Dynasty. Yingtian and Yingtian Mansion are not the same place. Cao Xueqin would have deliberately confused the time and place of the book"
			},
			{
				"label": "喜儿——————Xi Er",
				"value": 1,
				"id": 3956,
				"categories": ["person"],
				"info": "贾珍的attendant。——————Jia Zhen's sidekick"
			},
			{
				"label": "寿儿——————Shou Er",
				"value": 1,
				"id": 3957,
				"categories": ["person"],
				"info": "贾宝玉的一个小厮。——————Jia Baoyu's Slave"
			},
			{
				"label": "钱槐——————Qian Huai",
				"value": 1,
				"id": 3958,
				"categories": ["person"],
				"info": "荣府男仆，被派跟贾环上学。他是赵姨娘内侄，父母在库上管帐。他看上柳五儿标致，就倚势求亲，怎耐五儿执意不从，他“心中又气又愧，发恨定要弄取成配，方了此愿”。——————A man servant of the Rongfu family, he was sent to school with Jiahuan. He is the nephew of Auntie Zhao, whose parents are in charge of the accounts. He likes Liu Wuer's beauty and wants to marry her."
			},
			{
				"label": "乌进孝——————Wu Jingxiao",
				"value": 1,
				"image": "乌进孝.png",
				"id": 3959,
				"categories": ["person"],
				"info": "宁府黑山村庄村长——————The mayor of the Black Mountain village owned by Ning Mansion."
			},
			{
				"label": "南安郡王——————Lord Nan'an",
				"value": 3,
				"id": 3960,
				"categories": ["person"],
				"info": "南安郡王是一位王爷。《红楼梦》里后来写贾府为秦可卿大办丧事，来了四家王爷参加祭奠，他们是东平郡王、南安郡王、西宁郡王和北静郡王。——————Lord Nan'an was a prince. Later in Dream of the Red Chamber, the Jia family held a funeral for Qin Keqing, and four princes came to pay their respects: Lord Dongpin, Lord Nan'an, Lord Xining and Lord Beijin."
			},
			{
				"label": "冯渊——————Feng Yuan",
				"value": 2,
				"id": 3961,
				"categories": ["person"],
				"info": "金陵省一个小乡绅之子。自幼父母双亡，又无兄弟，只他一个人守着些薄产度日。——————The son of a small town gentry in Jinling Province. His parents died when he was young, and he has no brothers, so he's the only one living off some money."
			},
			{
				"label": "李守中——————Li ShouZhong",
				"value": 2,
				"id": 3962,
				"categories": ["person"],
				"info": "李纨之父，曾为国子祭酒。——————Li Wan's father, a former national celebrant."
			},
			{
				"label": "单聘仁——————Shan Pingren",
				"value": 1,
				"id": 3963,
				"categories": ["person"],
				"info": "单聘仁为贾政门下清客相公，对宝玉阿谀奉承。脂批以此名寓“善与骗人之意”。——————Jia Zheng's scholar, who is flattering to Baoyu and likes to cheat people."
			},
			{
				"label": "程日兴——————Cheng Rixing",
				"value": 1,
				"id": 3964,
				"categories": ["person"],
				"info": "程日兴，贾政门下清客相公，亦在古董行做事，宝玉说画美人是他的绝技。——————Jia Zheng's scholar also works in an antique shop, and his specialty is painting beautiful women."
			},
			{
				"label": "詹光——————Zhan Guang",
				"value": 1,
				"id": 3965,
				"categories": ["person"],
				"info": "詹光字子亮，为贾政门下清客相公。善绘工细楼台，兴建大观园时，他也参加规划设计；为大观园题写对联匾额时，他也参加讨论。平时则陪贾政下棋聊天，见到宝玉百般奉承，极尽丑态。贾府失势，人也就辞去了。脂砚斋说作者给清客们起名多有调侃之意，詹光“盖沾光之意”（甲戌本）也。——————He was a scholar under Jia Zheng. He was good at drawing fine buildings and terraces, and he also took part in the planning and design of the Grand View Garden when it was built, and he also took part in the discussion of the inscription of the couplet plaque for the Grand View Garden. In his spare time, he played chess with Jia Zheng and chatted with him, and when he saw Baoyu, he flattered him in every possible way."
			},
			{
				"label": "昭儿——————Zhao Er",
				"value": 2,
				"id": 3967,
				"categories": ["person"],
				"info": "贾琏心腹小厮。曾随贾琏送黛玉回扬州探林如海，如海殁，他即赶回京城报丧取衣。——————Jia Lian's important slave. He sent Lin Daiyu back to Yangchow with Jia Lian to see Lin Ruhai, and when Lin Ruhai died, he rushed back to the capital to report his death."
			},
			{
				"label": "癞头和尚——————scabby monk",
				"value": 3,
				"image": "癞头和尚.png",
				"id": 3968,
				"categories": ["zhuyao"],
				"info": "癞头和尚虽然其貌不扬，但却是小说中实在在的“神仙”，更是被曹雪芹寓以了既能令人富贵、又能一朝回贫的深刻含义。——————Scabby Monk have a small but important role to play. They are the real immortals in the novel, and the author implies that they can both make people rich and return to poverty once again."
			},
			{
				"label": "跛足道人——————crippled Taoist",
				"value": 4,
				"image": "跛足道人.png",
				"id": 3969,
				"categories": ["zhuyao"],
				"info": "跛足道人，他看到了一个欲望无穷、沽名钓誉、巧取豪夺的泥浊世界————crippled Taoist, he saw a muddy world of endless desire, fame and ingenuity."
			},
			{
				"label": "霍启——————Huo Qi",
				"value": 3,
				"id": 3970,
				"categories": ["person"],
				"info": "甄士隐的家奴。谐音“祸起”。因为弄丢了甄士隐年方三岁的爱女甄英莲，便逃往他乡去了。——————Zhen Shiyin's household slave. He ran away because he had lost Zhen Shi Yin's three-year-old daughter, Zhen Ying Lian."
			},
			{
				"label": "旺儿之子——————Wang Er's son.",
				"value": 5,
				"id": 3971,
				"categories": ["person"],
				"info": "旺儿之子。——————Wang Er's son."
			},
			{
				"label": "神瑛侍者——————Divine Luminescent Stone-in-Waiting",
				"value": 2,
				"id": 3972,
				"categories": ["zhuyao"],
				"info": "神瑛侍者为贾宝玉的前身，他对三生石畔的绛珠仙草曾有灌溉之恩。贾宝玉身上的通灵宝玉是由顽石变化而成的。后在”绛珠“”泪尽夭折“后，经历了与宝钗”恩爱夫妻不到冬“、贾府的”忽喇喇似大厦倾“、女儿们的：“三春去后诸芳尽”等等人间不适后，心灰意冷地“悬崖散手”，与“绛珠”“证了前缘”。——————Divine Luminescent Stone-in-Waiting is Jia Baoyu’s previous life. He once had irrigation for the Crimson Pearl Flower beside the Stone of Three Incarnations. The Nuwa on Jia Baoyu's body was transformed from the rest of the stone to fill the sky."
			},
			{
				"label": "林黛玉——————Lin DaYu",
				"value": 21,
				"image": "林黛玉.png",
				"sound": true,
				"id": 4037,
				"categories": ["Jinling"],
				"info": "金陵十二钗之冠。林如海与贾敏之女，宝玉的姑表妹，寄居荣国府 。她生性孤傲，多愁善感，才思敏捷。她与宝玉真心相爱，是宝玉反抗封建礼教的同盟，是自由恋爱的坚定追求者。——————The most important woman among the Twelve Maidens of Chin Ling. The daughter of Lin Ruhai and Jia Min, the cousin of Jia Baoyu, lives in Mansion in Rongguo. She is aloof, sentimental, and quick-thinking. She and Baoyu truly love each other, Baoyu’s companion against feudal ethics, and a firm pursuer of free love."
			},
			{
				"label": "薛宝钗——————Xue Baochai",
				"value": 17,
				"image": "薛宝钗.png",
				"sound": true,
				"id": 4038,
				"categories": ["Jinling"],
				"info": "金陵十二钗之二，来自四大家族之薛家，薛姨妈之女。她大方典雅，举止雍容。她对官场黑暗深恶痛绝，但仍规谏宝玉读书做官。有一个金锁，与贾宝玉的通灵宝玉被外人称为金玉良缘。——————The second of The Twelve Maidens of Chin Ling, she is from the Xue family, the daughter of Aunt Xue. She is generous, elegant and graceful. She abhorred the darkness of officialdom, but still admonished Baoyu to study and become an official. She has a golden lock and a jadeite with Jia Baoyu that is known as the ‘Golden Jade’."
			},
			{
				"label": "贾巧姐——————Jia Qiaojie",
				"value": 7,
				"image": "贾巧姐.png",
				"id": 4039,
				"categories": ["Jinling"],
				"info": "金陵十二钗之十，贾琏与王熙凤的女儿。因生在七月初七，刘姥姥给她取名为“巧姐”。在贾府败落后，王仁和贾环要把她卖与藩王作使女。在紧急关头，幸亏刘姥姥相救，把她带去乡下。——————The tenth of The Twelve Maidens of Chin Ling, the daughter of Jia Lian and Wang Xifeng. She was born on the seventh day of the seventh month of the lunar calendar and was named Qiao Jie (Qiao Jie). When the Jia residence fell apart, Wang Ren and Jia Huan tried to sell her to the king as a maid. Fortunately, Granny Liu rescued her and took her to the countryside."
			},
			{
				"label": "贾惜春——————Jia Xichun",
				"value": 8,
				"image": "贾惜春.png",
				"sound": true,
				"id": 4040,
				"categories": ["Jinling"],
				"info": "金陵十二钗之八，宁国府贾珍的妹妹，贾府四小姐，爱好绘画。因father贾敬一味好道炼丹，mother又早逝，她一直在荣国府贾母身边长大。由于没有父母疼爱，养成了孤僻冷漠的性格，抄检大观园时，她狠心撵走丫环入画。四大家族的没落，三个sister的结局，使她产生了弃世的念头，看破红尘出家为尼。——————The eighth of The Twelve Maidens of Chin Ling, the younger sister of Jia Zhen of the Mansion of Ningguo, the fourth daughter of the Jia family, is a lover of painting. She grew up in the Mansion of Rongguo because her father, Jia Jing, was an alchemist, and her mother died young. With no parents to love her, she was raised to be an eccentric and cold character. The fall of her four big families and the end of her three sisters made her become a nun."
			},
			{
				"label": "王熙凤——————Wang Xifeng",
				"value": 25,
				"image": "王熙凤.png",
				"sound": true,
				"id": 4041,
				"categories": ["Jinling"],
				"info": "金陵十二钗之九，来自四大家族之王家，王夫人的内侄女，贾琏之妻。她精明强干，深得贾母和王夫人的信任，成为荣国府的管家奶奶，她为人处事圆滑周到，图财害命的事也干过不少，她支持宝黛爱情。——————The Twelve Maidens of Chin Ling is a niece of Madame Wang and the wife of Jia Lian, a member of the Wang family. She is the wife of Jia Lian. She is a smart and capable woman who has won the trust of both Lady Wang and Grandma Jia, and has become the manager of the Mansion.She supports Baoyu and Daiyu's love for each other."
			},
			{
				"label": "贾迎春——————Jia Yingchun",
				"value": 10,
				"image": "贾迎春.png",
				"sound": true,
				"id": 4042,
				"categories": ["Jinling"],
				"info": "金陵十二钗之七，是贾赦与妾所生，贾府二小姐。她老实无能，懦弱怕事，有“二木头”的诨名。她不但作诗猜谜不如姐妹们，在处世为人上，也只知退让，任人欺侮。贾赦欠了孙家五千两银子还不出，就把她嫁给孙家，原著前80回未交代结局，根据金陵十二钗判词，最后被husband孙绍祖虐待致死。——————The Twelve Maidens of Chin Ling is the seventh child of Jia Pao and his concubine, the second youngest daughter of the Jia family. She is an honest, incompetent, cowardly and fearful woman. She is not only inferior to her sisters in poetry and riddles, but she is also willing to give in and let others bully her. Jia Pao, who owes Sun's family 5,000 taels of silver, marries her off to Sun's family and is eventually maltreated to death by her husband, Sun Shaozu."
			},
			{
				"label": "李纨——————Li Wan",
				"value": 12,
				"image": "李纨.png",
				"sound": true,
				"id": 4043,
				"categories": ["Jinling"],
				"info": "金陵十二钗之十一，贾珠遗孀，生子贾兰。李纨虽处于膏粱锦绣之中，竟如“槁木死灰”一般，一概不闻不问，只知道抚养亲子，闲时陪侍小姑等女红、诵读而已  。她是个恪守封建礼法的节妇的典型。——————The Twelve Maidens of Chin Ling is the eleventh, widow of Jia Zhu, who gave birth to Jia Lan. She only knew how to raise her own children and spent her free time with her aunt doing needlework and reading. She was a typical example of a temperate woman who adhered to feudal rituals."
			},
			{
				"label": "贾元春——————Jia Yuanchun",
				"value": 9,
				"image": "贾元春.png",
				"sound": true,
				"id": 4044,
				"categories": ["Jinling"],
				"info": "金陵十二钗之三，贾政与王夫人之长女，贾府大小姐。因贤孝才德，选入宫作女史。秦可卿出殡不久，元春晋封贵妃  。贾府为了迎接她省亲，建造了大观园。她给家族带来了“烈火烹油，鲜花著锦之盛”，但自己幽闭深宫，不能尽天伦之乐。——————The Twelve Maidens of Chin Ling was the third, the eldest daughter of Jia Zheng and Madame Wang, the eldest daughter of the Jia family. Because of her virtuousness and filial piety, she was chosen to be a female historian of the palace. Soon after Qin Keqing's funeral, she was promoted to the title of noble consort in Yuanchun. In order to welcome her home, the Jia Mansion built the Grand View Garden. She brought prosperity to the family, but she was secluded in the palace, unable to enjoy her family life."
			},
			{
				"label": "贾探春——————Jia Tanchun",
				"value": 14,
				"image": "贾探春.png",
				"sound": true,
				"id": 4045,
				"categories": ["Jinling"],
				"info": "金陵十二钗之四，贾政与赵姨娘所生，贾府三小姐。她精明能干，个性刚烈，有“玫瑰花”之诨名。抄检大观园时，她当众扇了王善保家的一巴掌。她对贾府的危局颇有感触，用兴利除弊的改革来挽救。改革虽成功，但无济大事。——————The Twelve Maidens of Chin Ling is the fourth, born to Jia Zheng and Miss Zhao, the third daughter of the Jia family. The Twelve Maidens of Chin Ling, the third daughter of the Jia family, was born to Jia Zheng and Aunt Zhao, and was known as ‘The Rose’. During the raid on the Grand View Garden, she slapped Wang Shanbao's family in public. She was impressed by the dire situation of the Jia family, and saved them by introducing reforms to remove the disadvantages. Although the reforms were successful, they could not save the Jia family in the end."
			},
			{
				"label": "邢夫人——————Lady Xing",
				"value": 12,
				"image": "邢夫人.png",
				"id": 4046,
				"categories": ["zhuyao"],
				"info": "贾赦之wife，无儿无女，地位尴尬，比不上妯娌王夫人。她禀性愚犟，只知奉承贾赦，家中小老婆一堆 ，一应大小事务，俱由贾赦摆布。出入银钱，一经她手，便克扣异常，婪取财货。儿女奴仆，一人不靠，一言不听，故甚不得人心。——————Jia Pao's wife, with no children, is in an awkward position, not as good as his sister-in-law, Mrs. Wang. She is stubborn and only knows how to flatter Jia Pao, and her concubines are all arranged by Jia Pao. The woman is not popular in the family."
			},
			{
				"label": "赵姨娘——————Mrs. Zhao",
				"value": 11,
				"image": "赵姨娘.png",
				"id": 4047,
				"categories": ["zhuyao"],
				"info": "赵姨娘是荣国府二老爷贾政之妾，环三爷贾环和三姑娘贾探春之生母。赵姨娘成了贾政的妾，这是她幸运的一步，却也是不幸的开始。——————Aunt Zhao was the concubine of Jia Zheng, the second son of the Rongguo family, and the biological mother of Jia Huan and Jia Tanchun. The fact that Zhao became the concubine of Jia Zheng was a lucky step for her, but also the beginning of misfortune."
			},
			{
				"label": "贾敏——————Jia Min",
				"value": 10,
				"id": 4048,
				"categories": ["person"],
				"info": "贾敏既是贾代善与史太君之女，也是林黛玉之母。风华绝代，才情不凡，在《红楼梦》这本名著中作为已故人物出场。贾母最疼爱的小女儿，贾敏在未嫁之时受到贾母的呵护令王夫人刻骨铭心。嫁与巡盐御史林如海为妻。先育有一子，早夭，后生下林黛玉。早逝。——————Jia Min is both the daughter of Jia Daishan and Shi Taijun, and the mother of Lin Daiyu. She was the daughter of Jia Daishan and Taijun Shi, as well as the mother of Lin Daiyu. She was a magnificent and talented young woman who appeared in the famous book Dream of the Red Chamber as a deceased character. The mother of Jia's favorite youngest daughter, Jia Min in unmarried by the grandmother Jia's care made Mrs. Wang engraved in her heart. She was married to Lin Ruhai. She had one son, who died young, and then gave birth to Lin Daiyu. Her untimely death"
			},
			{
				"label": "贾母————Grandma Jia",
				"value": 14,
				"image": "贾母.png",
				"id": 4049,
				"categories": ["zhuyao"],
				"info": "来自四大家族之史家，贾府老太太，宝玉祖母 。在贾家从重孙媳妇做起，一直到有了重孙媳妇。她凭着自己的精明能干，才坐稳了贾家大家长的位置。——————From the Shi family of four great families, the old lady of the Jia family and grandmother of Jia Baoyu . She started in the Jia family as a great-grand-daughter-in-law until she had a great-grand-daughter-in-law. With her shrewdness and ability, she was able to secure the position of the head of the Jia family"
			},
			{
				"label": "妙玉——————Adamantina",
				"value": 3,
				"image": "妙玉.png",
				"sound": true,
				"id": 4050,
				"categories": ["Jinling"],
				"info": "金陵十二钗之六，苏州人氏。祖上是读书仕宦人家，因自幼多病，买了许多替身皆不中用，只得入了空门，带发修行。父母亡故后，她随师父进京。师父圆寂后，王夫人赏识她的佛学修为，请她入住大观园栊翠庵，原著前80回未交代结局。——————The Sixth of The Twelve Maidens of Chin Ling, a native of SooChow. Her ancestors were educated and worked as government officials, but due to illness at an early age, she had to take her hair to the temple. After the death of her parents, she went to Beijing with her master. After her master's death, Madame Wang appreciated her Buddhist training and invited her to stay at the Green Lattice Nunnery."
			},
			{
				"label": "王夫人——————Lady Wang",
				"value": 21,
				"image": "王夫人.png",
				"id": 4051,
				"categories": ["zhuyao"],
				"info": "王夫人是故事主角贾宝玉和十二钗之一的皇妃贾元春之母，贾政之妻，是荣国府掌权管事的家长之一。她性格沉闷守旧，贾母形容她老实，又多病多痛。——————Lady Wang is the mother of the main character Jia Baoyu and the imperial consort Jia Yuanchun, the wife of Jia Zheng, one of the heads of the Rongguo residence. She is dull and old-fashioned, and is described by Grandma Jia as honest, sickly, and painful."
			},
			{
				"label": "史湘云——————Shi Xiangyun",
				"value": 12,
				"image": "史湘云.png",
				"sound": true,
				"id": 4052,
				"categories": ["Jinling"],
				"info": "金陵十二钗之五，来自四大家族之史家，是贾母的侄孙女。自幼父母双亡，在家一点儿也作不得主，不时还要三更半夜做针线活儿。她心直口快，开朗豪爽，心怀坦荡，从未把儿女私情略萦心上。——————Fifth of The Twelve Maidens of Chin Ling is a niece of Grandma Jia's nephew and granddaughter from a family of four great families. She is the niece of Jia's mother. Her parents died when she was young, so she is not in charge of her own family and has to do needlework in the middle of the night from time to time. She is quick-witted, cheerful, and open-minded."
			},
			{
				"label": "秦可卿——————Qin Keqin",
				"value": 13,
				"image": "秦可卿.png",
				"sound": true,
				"id": 4053,
				"categories": ["Jinling"],
				"info": "金陵十二钗之十二，宁国府贾蓉之妻。她是营缮司郎中秦邦业从养生堂抱养的女儿，小名可儿，大名兼美。她长得袅娜纤巧，性格风流，行事又温柔和平，深得贾母等人的欢心  。但公公贾珍与她关系暧昧，致使其年轻早夭。——————Twelfth of The Twelve Maidens of Chin Ling , wife of the Ningguo mansion Jia Rong. She was the adopted daughter of Qin Ye, whose nickname was Ke er, and whose first name was also Jianmei. She was a slender, graceful, gentle and peaceful woman, who was very popular with Grandmother Jia and others. But her father-in-law, Jia Zhen, had an affair with her, which led to her early death."
			},
			{
				"label": "晴雯——————Skybright  ",
				"value": 9,
				"id": 4054,
				"categories": ["youfuce"],
				"info": "金陵十二钗又副册之首，贾宝玉房里的四个大丫鬟之一，虽是丫鬟，但在宝玉房里过得千金小姐的生活。她有林黛玉之风。一次王夫人进园子看见她打骂小丫鬟，觉得她不合世家教养，再加上王善保家的等小人进谗，王夫人在她病得“四五日水米不曾沾牙”的情况下，从炕上拉下来，硬给撵了出去。宝玉偷偷前去探望，晴雯深为感动。当夜，晴雯悲惨地死去。——————Belonging to Jinling, Twelve Beauties of; Supplementary Register No. 2, one of the four maids in Jia Baoyu's room, Jinling is a maid, but she lives the life of a thousand golden girls in Baoyu's room. She had the style of Lin Daiyu. The first one is the one that is the most important. That night, Skybright died a tragic death."
			},
			{
				"label": "袭人——————Aroma",
				"value": 8,
				"image": "袭人.png",
				"id": 4055,
				"categories": ["youfuce"],
				"info": "袭人原名珍珠，花姓，金陵十二钗又副册第二位，宝玉房里四个大丫鬟之首。从小因家贫被父母卖入贾府为婢，原是跟着贾母，起先服侍史湘云几年，贾母见喜袭人心地纯良，恪尽职守，便命她服侍宝玉。她对人和气，处事稳重，工作认真，得到大观园中上下人等的夸奖，是出了名的贤女。——————Belonging to Jinling, Twelve Beauties of; Supplementary Register No. 2. She is the first of four maids in the Baoyu household. When she was young, her parents sold her into the Jia residence as a servant girl, and she served Shi Xiangyun for several years. She is known for her kindness, steadiness and conscientiousness, and is praised by everyone in the Grand View Garden."
			},
			{
				"label": "平儿————Patience",
				"value": 7,
				"image": "平儿.png",
				"id": 4056,
				"categories": ["fuce"],
				"info": "王熙凤的陪嫁丫头，贾琏的通房大丫头。她是个极聪明、极清俊的女孩儿。虽是凤姐的心腹，要帮着凤姐料理事务，但她为人很好，心地善良，平儿从不弄权仗势欺人，本能地同情那些和她地位相仿或更低的奴隶们，常背着王熙凤做些好事。——————The bride of Wang Xifeng, Jia Lian's common slave, is an extremely intelligent and handsome girl. She is an extremely intelligent and handsome girl. Patience is a good and kind-hearted girl, and she has no intention of bullying anyone, but she instinctively sympathizes with the slaves who are similar to her and often does good deeds behind Wang Xifeng's back"
			},
			{
				"label": "鸳鸯——————Faithful",
				"value": 5,
				"image": "鸳鸯.png",
				"id": 4057,
				"categories": ["youfuce"],
				"info": "随父姓金，是贾母的大丫头，甚受信任，因为这个缘故，她在贾府的丫头中有很高的地位。贾母平日倚之若左右手。贾母玩牌，她坐在旁边出主意；贾母摆宴，她入座充当令官。她自重自爱，从不以此自傲，仗势欺人，因此深得上下各色人等的好感和尊重。——————Grandma Jia is the eldest daughter of her father, Jinling, and is the most trusted of all the maids in the Jia family. She is the eldest maid in the Jia family and is very trusted by all the people in the family."
			},
			{
				"label": "紫鹃——————Nightingale",
				"value": 6,
				"image": "紫鹃.png",
				"id": 4058,
				"categories": ["youfuce"],
				"info": "贾母房里的二等小丫头。贾母见林黛玉来时只带了两个人，恐不中使，便把鹦哥给了黛玉，改名为紫鹃。她聪明灵慧，和黛玉关系很好，情同姐妹，一时一刻不离开，是黛玉的“闺中贵友”，一心一意为黛玉着想，见黛玉是个孤儿，又和宝玉相爱，就劝黛玉趁老太太还硬朗的时候作定大事要紧。为此，她想出林家要接黛玉回苏州的话来试宝玉，使宝玉痴病大发。黛玉死后，随黛玉灵柩回苏州，为黛玉守灵。——————Nightingale is the little girl in Lady Jia's room, and when she sees that Lin Daiyu has come with only two people, she gives her to Lin Daiyu. She is very smart, she is very close to Daiyu, and she is devoted to Daiyu. She sees that Daiyu is an orphan and is in love with Baoyu, so she advises Daiyu to make important decisions while Lady Jia is still healthy. After Daiyu's death, she returns to SooChow with Daiyu's coffin."
			},
			{
				"label": "莺儿——————Oriole",
				"value": 3,
				"image": "莺儿.png",
				"id": 4059,
				"categories": ["youfuce"],
				"info": "薛宝钗的丫头，她甚是乖巧。——————Xue Baochai's servant girl, she was very well-behaved."
			},
			{
				"label": "玉钏——————Silver",
				"value": 3,
				"image": "玉钏.png",
				"id": 4060,
				"categories": ["youfuce"],
				"info": "金钏的妹妹，王夫人的丫头。金钏投井后，王夫人便把金钏的月钱给了玉钏。金钏周年，玉钏独坐廊下垂泪，可见底层人民的骨肉之情。——————Golden's sister, the slave of the Lady Wang, who gives Golden's monthly money to Silver after his suicide, and Silver's tears on Golden's anniversary show the bond between them."
			},
			{
				"label": "金钏——————Golden",
				"value": 4,
				"image": "金钏.png",
				"id": 4061,
				"categories": ["youfuce"],
				"info": "王夫人房中的丫鬟。本姓白。有一个妹妹，叫做“玉钏”，同是王夫人房中丫头。后跳井自杀。金钏给人以不谙世事，天真烂漫的印象。投井自杀的结局也就更点明其人刚烈、其质清洁。——————She was a maid in Lady Wang's chamber. There is a sister, named Silver, who is also a servant girl in Mrs. Wang's room. Golden gives people the impression that she is unworldly and naive, and then she commits suicide by jumping into a well. The ending of his suicide by jumping into the well further indicates that he was strong and fierce."
			},
			{
				"label": "彩云——————Suncloud",
				"value": 2,
				"image": "彩云.png",
				"id": 4062,
				"categories": ["person"],
				"info": "彩云是一个与贾环玩得很要好的丫头，后来她被贾环误会后染了无医之症。——————A maid, Suncloud, is a young woman who is very close to Jia Huan, but she is misunderstood by him and falls ill with an incurable disease."
			},
			{
				"label": "司棋——————Chess",
				"value": 7,
				"image": "司棋.png",
				"id": 4063,
				"categories": ["youfuce"],
				"info": "贾迎春的丫头。脾气刚烈，雷厉风行。与潘又安adultery，被撵出大观园。最终与潘又安双双殉情而死。与其主子迎春“二木头”的性格形成了很大的反差。——————Jia Yingchun's servant girl, with a fierce temper, was expelled from the Grand View Garden. She had an affair with Pan You'an and was expelled from the Grand View Garden. She died in love with Pan again, unlike Jia Yingchun's dull personality."
			},
			{
				"label": "芳官——————Charmante",
				"value": 2,
				"image": "芳官.png",
				"id": 4064,
				"categories": ["guan"],
				"info": "贾府买来的戏班成员，正旦。戏班解散后成了贾宝玉的丫环，后来由于旁人诬陷，王夫人把她撵了出去，让她godmother在府外给她找个女婿，她不甘心再被godmother买卖就出家去了。——————A member of the opera troupe bought by the Jia family, Jinling.After the troupe was disbanded, she became Jia Baoyu's maid. Later, because of a false accusation, Madame Wang threw her out of the house and asked her godmother to find her a son-in-law outside the house.She didn't want to be traded by her godmother anymore, so she became a nun."
			},
			{
				"label": "麝月——————Musk",
				"value": 4,
				"image": "麝月.png",
				"id": 4065,
				"categories": ["youfuce"],
				"info": "怡红院里的四大丫鬟之一，她在书中的出场并不多，但是一个不可缺少的角色，因为她是唯一一个见证了贾府的走向衰败的全程、目睹了女儿的薄命的命运。——————one of Jia Baoyu's four maids, does not make many appearances in the book, but she is an indispensable character, as she is the only one who witnesses the decline of the Jia family and the fate of the women."
			},
			{
				"label": "香菱——————Caltrop",
				"value": 9,
				"image": "香菱.png",
				"id": 4066,
				"categories": ["fuce"],
				"info": "本名甄英莲，homeland姑苏，甄士隐独女，眉心有米粒大小的一点胭脂胎记。养大后原是卖给金陵公子冯渊，中途却被薛蟠抢回去做小妾，宝钗给她起名叫香菱。—————— Caltrop, originally from SooChow, is the only daughter of Zhen Shiyin, who has a birthmark the size of a grain of rice on her brow. She was abducted and sold to Feng Yuan, a gentleman from Jinling, when she was young, but halfway through, she was snatched by Xue Pan to become his concubine."
			},
			{
				"label": "抱琴——————Lutany",
				"value": 1,
				"id": 4067,
				"categories": ["person"],
				"info": "抱琴是贾门大姐大贾元春的丫头，她是随元春进宫的侍女。——————Jia Yuanchun's maid, she is the only named maid who enters the palace with Yuanchun."
			},
			{
				"label": "宝蟾——————Moonbeam",
				"value": 4,
				"image": "宝蟾.png",
				"id": 4068,
				"categories": ["fuce"],
				"info": "宝蟾是夏金桂的The maidservant accompanying the bride丫头。长有三分姿色，举止轻浮。——————Moonbeam is Xia Jingui's chambermaid. She has a good appearance, but her manners are frivolous."
			},
			{
				"label": "雪雁——————Snowgoose",
				"value": 2,
				"image": "雪雁.png",
				"id": 4069,
				"categories": ["youfuce"],
				"info": "雪雁是林黛玉从苏州家里带来的小丫头，为林黛玉的贴身丫头之一。 雪雁年龄虽小，却是个聪慧之人。虽无害人之心，却有防人之意。——————She is the little maid brought by Lin Daiyu from SooChow's house. Although Snowgoose was young, she was a smart person. Although harmless, but defensive"
			},
			{
				"label": "春纤——————Chunqian",
				"value": 1,
				"id": 4070,
				"categories": ["person"],
				"info": "林黛玉丫环。——————Lin Daiyu's maid "
			},
			{
				"label": "文杏——————Wenxing",
				"value": 1,
				"id": 4071,
				"categories": ["person"],
				"info": "薛宝钗丫环。——————Xue Baochai's maid"
			},
			{
				"label": "碧月——————Biyue",
				"value": 3,
				"id": 4072,
				"categories": ["person"],
				"info": "李纨的丫头。——————Li Wan's maid"
			},
			{
				"label": "琥珀——————Amber ",
				"value": 1,
				"id": 4073,
				"categories": ["person"],
				"info": "贾母身边的大丫鬟，照顾贾母起居生活，也负责传话、取物等各色杂事。——————A maid by the side of Grandma Jia's wife, she takes care of Jia's mother's daily life and is also responsible for delivering messages and collecting things."
			},
			{
				"label": "翠墨——————Ebony",
				"value": 1,
				"id": 4074,
				"categories": ["person"],
				"info": "贾探春的贴身丫鬟。——————Jia Tanchun's personal servant girl"
			},
			{
				"label": "薛姨妈——————Aunt Xue",
				"value": 10,
				"image": "薛姨妈.png",
				"id": 4075,
				"categories": ["zhuyao"],
				"info": "薛蟠和薛宝钗之母，王夫人之妹。她以“慈”著称，由于举止言行得体，贾母常愿与她对坐聊天。她十分溺爱自己的子女，尤其怜惜薛蟠独根孤种，未免溺爱纵容，遂至老大无成，任薛蟠在外为所欲为。——————She was the mother of Xue Ban and Xue Bao Nobile, and the sister of Madam Wang. After the death of her husband, she lived in the Pear Fragrance Garden of the Jia Mansion with her two children. She was known for her kindness, and because of her proper manners and behavior, Aunt Jia was often willing to sit and chat with her. She doted on her children, especially on Xue Ban, who was a lonely and isolated child, and was so indulgent and pampered that the eldest child failed and was allowed to do whatever he wanted."
			},
			{
				"label": "夏金桂——————Xia Jingui",
				"value": 7,
				"image": "夏金桂.png",
				"id": 4076,
				"categories": ["zhuyao"],
				"info": "薛蟠的妻子。她被寡母纵容教养长大，她爱自己尊若菩萨，窥他人秽如粪土，外具花柳之姿，内秉风雷之性，嫁到薛家，使得薛家上下吃尽了苦头。夏金桂是个泼辣、善妒、狠毒的形象。——————She is the wife of Xue Ban, a widowed mother who raised her. She was brought up by her widowed mother, who treated others like dirt and was very sexy. She married into the Xue family and made them suffer a lot. Xia Jingui is a spicy, jealous and vicious character."
			},
			{
				"label": "薛宝琴——————Xue Baoqin",
				"value": 6,
				"image": "薛宝琴.png",
				"id": 4077,
				"categories": ["fuce"],
				"info": "皇商之女，小时跟父亲跑过不少地方。她是薛姨妈的侄女，薛蝌的胞妹，薛蟠，薛宝钗的堂妹。她长得十分美貌，贾母甚是喜爱，夸她比画上的还好看，曾欲把她说给贾宝玉为妻。王夫人也认她为干女儿。她自幼读书识字，本性聪敏，在大观园里曾作《怀古绝句十首》。后嫁都中梅翰林之子。她是一位近乎完美的人。她的美艳与纯真和邢岫烟的内敛与清高、李纹、李绮的超脱与淡然截然不同，十分耀眼。主要成就为作怀古诗10首。本性聪敏，才华横溢，性格开朗热情、活泼爱动。——————The daughter of an imperial merchant, she traveled extensively with her father when she was young. She is Aunt Xue's niece and Xueke's sister-in-law. Xue Pan and Xue Bao Nobile's cousin. She was so beautiful that Auntie Jia was so fond of her that she praised her for being more beautiful than the picture on the wall and once offered her to Jia Baoyu as his wife. Mrs. Wang also recognized her as her goddaughter. At an early age, she was very intelligent and literate by nature. She was a near-perfect person with a cheerful, enthusiastic, lively and active personality."
			},
			{
				"label": "邢岫烟——————Xing Xiuyan",
				"value": 6,
				"image": "邢岫烟.png",
				"id": 4078,
				"categories": ["fuce"],
				"info": "邢岫烟是邢忠夫妇的女儿，邢夫人的侄女。她家道贫寒，一家人前来投奔邢夫人，就在大观园迎春的住处紫菱洲住下。邢夫人对邢岫烟并不真心疼爱，只不过为了脸面之情。邢夫人甚至要求邢岫烟把每月二两银子的月钱省下一两来给她自己的父母，使得邢岫烟只得典当衣服来维持她在大观园的开支。邢岫烟生得端雅稳重，知书达礼，被薛姨妈看中，央求贾母作媒说与薛蝌，后嫁给薛蝌。——————Xing Xiuyan is the daughter of Mr. and Mrs. Xing Zhong and the niece of Mrs. Xing. Her family was poor and came to live with Mrs. Xing in Purple Caltrop Isle. Mrs. Xing did not really love her. Lady Xing even asked her to save one of her two taels of silver to give to her parents, leaving her to pawn her clothes to make ends meet. As a result, she was forced to pawn her clothes to keep up with her expenses, but she was chosen by Auntie Xue, who married Xue Ke."
			},
			{
				"label": "尤氏——————You Shi",
				"value": 9,
				"image": "尤氏.png",
				"id": 4079,
				"categories": ["zhuyao"],
				"info": "她是贾珍的继室。虽为宁国府当家奶奶，但并无实权，素日只是顺从贾珍。她没什么才干，也没口齿。——————She is Jia Zhen's stepfamily. She is the head of the Mansion of Ning Guo, but she has no real power and has always been obedient to Jia Zhen. She has no talent and no words."
			},
			{
				"label": "尤二姐——————You Erjie",
				"value": 7,
				"image": "尤二姐.png",
				"id": 4080,
				"categories": ["fuce"],
				"info": "贾琏的二房，是贾珍夫人尤氏的继母带来的女儿。尤二姐模样标致，温柔和顺。贾珍馋涎妻妹的美貌，对尤二姐无微不至，当他玩腻后，就把她让给了贾琏。贾琏因惧怕王熙凤的淫威，只得偷偷娶尤二姐为二房，并把她安置在荣国府外，但不久被王熙凤发现，在她的借刀杀人计谋下，尤二姐备受折磨，当胎儿被庸医打下后，她绝望地吞金自尽。——————Jia Lian's second wife. Jia Lian's second wife, You Er, is a beautiful, gentle and obedient woman. Jia Lian is so afraid of Wang Xifeng that he has no choice but to secretly marry You Erjie and place her outside the Rongguo Mansion, but she is soon discovered by Wang Xifeng.You Erjie,  You Erjie commits suicide after her unborn child is killed by a quack."
			},
			{
				"label": "尤三姐——————You San-jie",
				"value": 5,
				"image": "尤三姐.png",
				"id": 4081,
				"categories": ["fuce"],
				"info": "尤氏继母带来的女儿，尤二姐的妹妹，亦称作尤小妹。尤三姐模样儿风流标致，她又偏爱打扮得出色，自有一种万人不及的风情体态。贾珍、贾琏、贾蓉等好色之徒，对她颇为馋涎。但尤三姐不愿像sister那样遭人玩弄，她用泼辣作为武器，捍卫自己的清白。她看中柳湘莲后，就一心一意等他。但因柳湘莲认为宁国府多好色之徒（贾珍贾蓉之流），怀疑尤三姐也是个不干净之人，要索回定礼，刚烈的尤三姐在奉还定礼时自杀。尤三姐个性泼辣刚烈，不像sister尤二姐般任人摆布。——————You Sanjie is the daughter of You's stepmother and the younger sister of You Erjie. You's third sister is very beautiful. However, she does not want to be manipulated like her sister and uses her ruthlessness as a weapon to defend her innocence. When she fell in love with Liu Xianglian, she waited for him wholeheartedly. However, because Liu Xianglian thought that the Ningguo residence was full of lecherous men, she suspected that You San Sister was also an impure person and wanted to return the ransom."
			},
			{
				"label": "刘姥姥——————Granny Liu",
				"value": 4,
				"image": "刘姥姥.png",
				"id": 4082,
				"categories": ["zhuyao"],
				"info": "刘姥姥是一位来自乡下贫农家庭的谙于世故的老婆婆，凤姐女儿巧姐的命运与她密切相关。她幽默风趣，精明强干，机智过人，她敢做敢为，有计有谋有办法，毫不顾虑拯救巧姐。——————Granny Liu is an old woman from a poor farming family in the countryside who is closely involved in the fate of Qiao Jie, Wang Xifeng's daughter. She is funny, clever and clever, and has the courage to do what is right and to save Qiao Jie."
			},
			{
				"label": "刘氏——————Miss Liu",
				"value": 5,
				"id": 4083,
				"categories": ["person"],
				"info": "刘姥姥的女儿。——————Granny Liu's daughter."
			},
			{
				"label": "同喜——————fellowship",
				"value": 1,
				"id": 4084,
				"categories": ["person"],
				"info": "薛姨妈房中丫头。——————Aunt Xue's maid."
			},
			{
				"label": "小红——————Crimson",
				"value": 7,
				"image": "小红.png",
				"id": 4085,
				"categories": ["youfuce"],
				"info": "小红在凤姐处得到重用。她俏丽恬静，口齿清楚，说话简短，又很齐全，不受封建礼教束缚，敢于追逐自己的幸福，自己的爱情，和贾芸通过手帕私定终身。——————Crimson is used under Wang Xifeng. She is pretty and quiet, articulate, short and complete, not bound by feudal rites, and dares to pursue her own happiness and love."
			},
			{
				"label": "鲍二家的——————Bao Er's wife.",
				"value": 4,
				"id": 4086,
				"categories": ["person"],
				"info": "鲍二家的是贾府男仆鲍二的老婆，鲍二家的是个悲剧人物，她与主子贾琏眉目传情，趁着凤姐生日，收了贾琏送来的“两块银子，两根簪子，两匹缎子”，跑去贾琏与王熙凤的屋里厮混偷情，被王熙凤当场捉奸。——————Bao Er's wife is a tragic character. She is in love with her master, Jia Lian, and she takes advantage of Wang Xifeng's birthday to receive a gift from Jia Lian."
			},
			{
				"label": "瑞珠——————Gem",
				"value": 3,
				"image": "瑞珠.png",
				"id": 4087,
				"categories": ["fuce"],
				"info": "秦可卿的丫环。秦可卿生前与公公贾珍关系暧昧，服侍秦可卿的瑞珠应该有所觉察，因此受到贾珍的威胁。秦可卿死后，瑞珠触柱而亡。——————Qin Keqing's maidservant. Rui Zhu, who was serving Qin Keqing, is threatened by Jia Zhen, an eunuch with whom Qin Keqing had an affair. After Qin Keqing's death, Ruiju commits suicide by crashing into a pillar."
			},
			{
				"label": "藕官——————Nenuphar ",
				"value": 3,
				"image": "藕官.png",
				"id": 4088,
				"categories": ["guan"],
				"info": "藕官是贾家买来的十二个唱戏的优伶之一，小戏子。为人义气，当她的朋友芳官被赵姨娘侮辱时，藕官冒着随时被驱逐的危险和伙伴们一起将平时不可一世的姨娘打了个痛快。戏班解散后，她成了林黛玉的丫环。后来因不肯聘嫁他人而出家为尼，长伴青灯古佛。——————Nenuphar is one of the twelve opera singers purchased by the Jia family. Righteous, when her friend Parfumée is insulted by Aunt Zhao, Nenuphar risks expulsion at any moment by beating the aunt. After the troupe was disbanded, she became Lin Daiyu's maid. She later became a nun because she refused to marry someone else."
			},
			{
				"label": "蕊官——————Etamine",
				"value": 1,
				"image": "蕊官.png",
				"id": 4089,
				"categories": ["guan"],
				"info": "蕊官是梨香院女伶，后遁入空门。——————Etamine is one of the twelve singer-performers purchased by the Jia family. She later became a nun."
			},
			{
				"label": "入画——————Picture",
				"value": 2,
				"image": "入画.png",
				"id": 4090,
				"categories": ["person"],
				"info": "贾惜春的丫环。——————Jia Xichun's maid"
			},
			{
				"label": "彩屏——————Caipin",
				"value": 1,
				"id": 4091,
				"categories": ["person"],
				"info": "贾惜春的一名丫鬟。——————Jia Xichun's maid"
			},
			{
				"label": "彩儿——————Caier",
				"value": 1,
				"id": 4092,
				"categories": ["person"],
				"info": "服侍贾惜春的小小丫环。——————Jia Xichun's maid"
			},
			{
				"label": "丰儿——————Felicity",
				"value": 1,
				"id": 4093,
				"categories": ["person"],
				"info": "王熙凤的小丫环。在王熙凤房中位置仅次于平儿。——————Wang Xifeng's youngest maid. Second only to Patience in Wang Xifeng's room."
			},
			{
				"label": "绣橘——————Tangerine",
				"value": 1,
				"image": "绣橘.png",
				"id": 4094,
				"categories": ["person"],
				"info": "贾迎春的丫头，她伶牙俐齿、好胜争强。是一个一心护主的二等小丫鬟。最后，迎春被贾赦许嫁孙绍祖之时，绣橘是四个陪嫁丫鬟之一。绣橘性格泼辣，有义护义。——————Jia Yingchun's maid, she is quick-witted and competitive. She is a second-class servant girl who is devoted to protecting her master. Tangerine is one of the four maids who accompany Jia Yingchun when she is promised to Sun Shaozu by Jia pardons, and she is spirited and protective of her lord."
			},
			{
				"label": "侍书——————Scribe",
				"value": 2,
				"image": "侍书.png",
				"id": 4095,
				"categories": ["person"],
				"info": "贾探春的丫鬟。——————Jia Tanchun's maid,"
			},
			{
				"label": "小鹊——————Magpie",
				"value": 2,
				"id": 4096,
				"categories": ["person"],
				"info": "小鹊是个机灵、有心机的丫头。——————Magpie is a clever and resourceful maid."
			},
			{
				"label": "翠缕——————Kingfisher",
				"value": 1,
				"image": "翠缕.png",
				"id": 4097,
				"categories": ["person"],
				"info": "史湘云的丫环。她是一位天真的丫鬟，性格如主人一般，豪爽直言。——————Shi Xiangyun's maid. She is naive and as bold and outspoken as her master."
			},
			{
				"label": "榛儿——————Hazelnut",
				"value": 1,
				"id": 4098,
				"categories": ["person"],
				"info": "香菱的丫鬟。——————Caltrop's maid."
			},
			{
				"label": "小螺——————snail",
				"value": 1,
				"id": 4099,
				"categories": ["person"],
				"info": "薛宝琴的小丫环。——————Xue Baoqin's maid."
			},
			{
				"label": "篆儿——————Zhuaner",
				"value": 1,
				"id": 4100,
				"categories": ["person"],
				"info": "邢岫烟的丫环。——————Xing Xiuyan's maid"
			},
			{
				"label": "茄官——————Aubergine",
				"value": 1,
				"id": 4101,
				"categories": ["guan"],
				"info": "贾府梨香院优伶，饰老旦。—————— Pear Fragrance Court's singer, as Old Dan."
			},
			{
				"label": "善姐——————Mercy",
				"value": 2,
				"image": "善姐.png",
				"id": 4102,
				"categories": ["person"],
				"info": "本为王熙凤身边的丫头，后被凤姐特意送给尤二姐使唤。“善姐”二字实为反讽：名为“善”，但其人不善。 善姐伶牙俐齿，时时对尤二姐冷嘲热讽，又“不服使唤”，故意在饮食起居上作践二姐。——————Mercy (Mercy Wong), a young woman who is the daughter of Wang Xifeng (Mercy Wong), is a smart and sarcastic woman who is always sarcastic towards You Erjie."
			},
			{
				"label": "素云——————Suyun",
				"value": 2,
				"id": 4103,
				"categories": ["person"],
				"info": "素云是李纨的丫环。——————Li Wan's maid."
			},
			{
				"label": "小吉祥儿——————lucky",
				"value": 1,
				"id": 4104,
				"categories": ["person"],
				"info": "赵姨娘跟前的一个小丫头。——————Aunt Zhao's maid."
			},
			{
				"label": "葵官——————Althee",
				"value": 1,
				"id": 4105,
				"categories": ["guan"],
				"info": "贾府买来的十二个唱戏的女孩子之一。后来成为湘云的丫鬟。——————One of the twelve opera girls bought by Jia Mansion. Later became Shi Xiangyun's maid"
			},
			{
				"label": "宝珠——————Jewel",
				"value": 2,
				"image": "宝珠.png",
				"id": 4106,
				"categories": ["fuce"],
				"info": "秦可卿的丫环。秦可卿死后，宝珠见秦氏没有孩子，愿为义女，请任摔丧驾灵之任，后在铁槛寺陪伴秦可卿之灵，执意不肯回宁国府。——————Qin Keqing's maid. After Qin Keqing's death, she volunteered to become her goddaughter to accompany Qin Keqing's spirit at Iron Threshold Temple, stubbornly refusing to return to Ningguo mansion."
			},
			{
				"label": "同贵——————Tonggui",
				"value": 1,
				"id": 4107,
				"categories": ["person"],
				"info": "薛姨妈的丫鬟——————Auntie Xue's maid."
			},
			{
				"label": "炒豆儿——————Chao Douer",
				"value": 1,
				"id": 4108,
				"categories": ["person"],
				"info": "尤氏身边的小丫头。在李纨房中，炒豆儿为尤氏端水只弯腰捧着，被李纨斥责后才跪下。事情发生在大观园抄检之后，显示出最讲等级规矩的贾府实际上已经纪律松散，衰败的现象逐步加剧，仆妇佣人也不那么服帖了。——————You Shi's maid. In Li Wan's room, Chao Douer only bends over to hold water for You Shi and only kneels down after being rebuked by Li Wan. Showing that the most hierarchically disciplined Jia House has in fact become undisciplined and progressively more decrepit, the maids have become disobedient."
			},
			{
				"label": "银蝶——————silver butterfly",
				"value": 1,
				"id": 4109,
				"categories": ["person"],
				"info": "尤氏的丫头。——————You Shi's maid."
			},
			{
				"label": "小舍儿——————Xiao Sher",
				"value": 2,
				"id": 4110,
				"categories": ["person"],
				"info": "小舍儿是金桂从小儿在家使唤的。——————Slave of Xia Jingui"
			},
			{
				"label": "艾官——————Artemisie",
				"value": 1,
				"id": 4111,
				"categories": ["guan"],
				"info": "贾府梨香院女伶，饰老外。戏班解散后，她做了探春的丫头。众女伶被逐出大观园后，她被干娘领出自行聘嫁。——————One of the twelve opera girls bought by Jia Mansion. After all the actresses were expelled from the Grand View Garden, she was led by her godmother to take a bride."
			},
			{
				"label": "文官——————Elegante",
				"value": 1,
				"id": 4112,
				"categories": ["guan"],
				"info": "贾府中十二个唱戏的女子之一，饰小生。在“十二官”中是个领头的，她由于口齿伶俐，甚得贾母欢心，薛姨妈等人也赞为“好个灵透孩子”，戏班解散后，贾母便留下她自使。——————One of the twelve opera girls bought by Jia Mansion plays the role of Xiaosheng, a leading role in the Twelve Officials. After the troupe was disbanded, Grandma Jia left her as a servant girl because of her eloquence."
			},
			{
				"label": "彩霞——————Sunset",
				"value": 5,
				"id": 4113,
				"categories": ["zhuyao"],
				"info": "彩霞是王夫人的大丫头，有时却又是赵姨娘身边的二等丫头。她非常能干，不仅要提醒王夫人大小家事，就连贾政在家出外去的一应大小家事，也得由她记着。她和贾环还合得来，不时规劝他安分些，何苦讨人嫌，但贾环并不领情。赵姨娘素日和彩霞好，巴不得彩霞能嫁给贾环，自己有个臂膀。赵姨娘求贾政说情，又要贾环去讨，贾环却认为不过是个丫头，丢开手便走了。后由王熙凤和贾琏作主，配给容貌丑陋、酗酒赌博的旺儿之子。——————She is Lady Wang's maid. She is very capable and has to keep track of not only Lady Wang's big and small family affairs, but also Jia Zheng's big and small family affairs when he goes out at home. She and Jia Huan get along well, and Auntie Zhao, who is close to Sunset, wants Sunset to marry Jia Huan, but Jia Huan thinks she is just a maid. However, Jia Huan does not want to marry Sunset because he thinks Sunset is just a maid. Sunset's marriage to Jia Huan was arranged by Wang Xifeng and Jia Lian, and Sunset was given to the son of Wang Er, an ugly, alcoholic and gambling addict."
			},
			{
				"label": "娇红——————Jiaohong",
				"value": 1,
				"id": 4114,
				"categories": ["person"],
				"info": "邢夫人的丫头。——————Lady Xing‘s maid"
			},
			{
				"label": "秋桐——————Autumn",
				"value": 3,
				"image": "秋桐.png",
				"id": 4115,
				"categories": ["zhuyao"],
				"info": "原为贾赦的丫环。贾琏偷娶尤二姐后，出门为father贾赦办事，事情办的很出色，贾赦十分欢喜，夸他能干，把秋桐赏他为妾。秋桐自以为揣摩到了凤姐的心思，加上自己是贾赦所赐，无人敢冒犯她。王熙凤曾借把尤二姐迫害而死。——————After Jia Lian marries You Erjie, he goes out to work for his father, Jia She, and does a good job. Autumn, originally Jia She’s maid, was later given to Jia Lian to be a concubine by Jia She. Wang Xifeng used her to persecute You Er to death."
			},
			{
				"label": "娇杏——————Jiaoxing",
				"value": 3,
				"image": "娇杏.png",
				"id": 4117,
				"categories": ["fuce"],
				"info": "娇杏是甄家的丫环——————Jiao Xing is a maid of the Zhen family"
			},
			{
				"label": "菂官——————Pivoine",
				"value": 1,
				"id": 4118,
				"categories": ["guan"],
				"info": "贾府买来的十二个唱戏的女孩之一，饰小旦。她在戏中与小生藕官常扮夫妻，二人相好异常，同性相恋。但不久她夭亡了，致使藕官伤心欲绝，哭得死去活来。——————One of the twelve opera girls bought by Jia Mansion plays the role of Little Dan. In this opera, she often plays the role of a couple with Nenuphar, who is in love with her. She died soon afterwards, leaving Nenuphar heartbroken."
			},
			{
				"label": "旺儿媳妇——————Wanger's wife.",
				"value": 5,
				"id": 4119,
				"categories": ["zhuyao"],
				"info": "荣府女仆，王熙凤的心腹。她仗着与丈夫一起专替凤姐出力办事，放账收债。故无所忌惮，她倚势为“酗酒赌博”，“容貌丑陋”的儿子强娶彩霞，逼得彩霞之母纵不愿意也只好忍气吞声同意了。她是奴仆中的一“霸”。——————The maid of the Rong residence belongs to Wang Xifeng. She works for Wang Xifeng and is a loan shark to collect debts. Sunset's mother is forced to marry Sunset for her gambling and ugly son, and is forced to swallow her pride."
			},
			{
				"label": "王嬷嬷——————Nanny Wang.",
				"value": 2,
				"image": "王嬷嬷.png",
				"id": 4120,
				"categories": ["person"],
				"info": "林黛玉的奶娘——————Lin Daiyu's nanny."
			},
			{
				"label": "李嬷嬷——————Nanny Li",
				"value": 3,
				"image": "李嬷嬷.png",
				"id": 4121,
				"categories": ["person"],
				"info": "贾宝玉的乳母。她是一个年老爱唠叨的人。儿子李贵是跟宝玉上学的跟班。——————Jia Baoyu's nanny. She is a nagging person. Her son, Li Gui, is a servant who goes to school with Baoyu."
			},
			{
				"label": "多姑娘——————the Mattress",
				"value": 4,
				"image": "多姑娘.png",
				"id": 4122,
				"categories": ["zhuyao"],
				"info": "多姑娘是晴雯的表嫂，在晴雯临死病重、宝玉前去探望之时看出来了她的善以及对真爱的一丝羡慕，因为在作者的笔下，“多姑娘儿”代表了女性对男权社会的一种反抗，寄托了作者对女性解放的希望。——————The Mattress is Skybright's cousin's sister-in-law, and when Skybright is deathly ill and Baoyu visits, she sees her goodness and a hint of envy for true love. She holds the author's hope for the liberation of women."
			},
			{
				"label": "赖大家的——————Lai Da's wife.",
				"value": 3,
				"id": 4123,
				"categories": ["person"],
				"info": "赖大的妻子。——————Lai Da's wife."
			},
			{
				"label": "吴兴登家的——————Wu Xingdeng's wife.",
				"value": 4,
				"id": 4124,
				"categories": ["person"],
				"info": "王夫人房里的奴才。——————The maid in Lady Wang's room."
			},
			{
				"label": "王善保家的——————Wang Sunbao's wife.",
				"value": 6,
				"image": "王善保家的.png",
				"id": 4125,
				"categories": ["person"],
				"info": "她是荣国府大房太太邢夫人的陪房婆子，也是邢夫人的心腹。——————She is the maid of Lady Xing of Rongguo Manison, and Lady Xing's henchman."
			},
			{
				"label": "柳嫂子——————Mrs. Liu",
				"value": 3,
				"id": 4126,
				"categories": ["person"],
				"info": "大观园内厨房主管，柳五儿之母。——————Kitchen supervisor in the Grand View Garden, mother of Fivey."
			},
			{
				"label": "李纹——————Li Wen",
				"value": 3,
				"id": 4127,
				"categories": ["fuce"],
				"info": "李婶娘之女，李纨堂妹。——————Daughter of Aunt Li, cousin of Li Wan."
			},
			{
				"label": "李绮——————Li Qi",
				"value": 3,
				"id": 4128,
				"categories": ["fuce"],
				"info": "李纹的妹妹，李纨的堂妹。——————Daughter of Aunt Li, cousin of Li Wan."
			},
			{
				"label": "李婶娘——————Aunt Li",
				"value": 4,
				"id": 4129,
				"categories": ["person"],
				"info": "李纹、李绮之母。——————Mother of Li Wen and Li Qi"
			},
			{
				"label": "青儿——————Qinger",
				"value": 3,
				"id": 4130,
				"categories": ["person"],
				"info": "王狗儿之女——————Wang Gu'er's daughter"
			},
			{
				"label": "周瑞家的——————Zhou rui‘s wife",
				"value": 6,
				"image": "周瑞家的.png",
				"id": 4131,
				"categories": ["zhuyao"],
				"info": "周瑞家的，是王夫人的陪房，冷子兴的岳母。常在大观园及王夫人、琏二奶奶处做事露面。处事较为圆滑、见风使舵，是贾宝玉口中典型的“鱼眼睛”形象。 在荣国府里，周瑞家的管太太奶奶们出行的事。她的husband周瑞管宁国府地租庄子银钱的出入。——————She is Mrs. Wang's maid and Leng Zixing's mother-in-law, and is often seen in the Grand View Garden and with Mrs. Wang and Grandma Lian. She is more tactful and sees the light. In the Rongguo Masion, Zhou Rui's wife was in charge of the wives' and grandmothers' travels. Her husband, Zhou Rui, was in charge of Ningguo Masion's land rent money."
			},
			{
				"label": "林之孝家的——————Lin Zhixiao‘s Wife",
				"value": 4,
				"image": "林之孝家的.png",
				"id": 4132,
				"categories": ["person"],
				"info": "林之孝家的是林红玉（小红）之母，也是荣国府大管家之一，为人行事低调，与其夫被喻为“天聋地哑”，地处管家高位却如此行事低调，实属难得，但也是媚上欺下，时不时也会利用自己的权利谋些好处。——————Crimson's mother is also one of the big butlers of the Mansion of Glory. But from time to time, she would use her power to her advantage."
			},
			{
				"label": "柳五儿—————— Fivey",
				"value": 2,
				"image": "柳五儿.png",
				"id": 4133,
				"categories": ["youfuce"],
				"info": "柳嫂子之女，十六岁，她虽是厨役之女，幸亏平儿相助，她们母女的冤情得以洗清。——————Mrs. Liu's daughter, aged sixteen, is the daughter of a cook, but she is very pretty. Thanks to Patience's help, the mother and daughter are cleared of all wrongdoing."
			},
			{
				"label": "秦显家的——————Qin Xian's wife",
				"value": 1,
				"image": "秦显家的.png",
				"id": 4134,
				"categories": ["person"],
				"info": "秦显的老婆——————Qin Xian's wife"
			},
			{
				"label": "莲花儿——————lotus",
				"value": 2,
				"id": 4135,
				"categories": ["person"],
				"info": "迎春房里的小丫头。司棋让她吩咐厨房炖鸡蛋，柳嫂不从，她就同柳嫂口角，后又赌气添了一大篇话，惹得司棋火起，带领丫头们大闹厨房。——————Jia Yingchun's maid. Chess asked her to tell the kitchen to stew eggs. Mrs. Liu was unwilling. They had a big fight, which made Chess angry and led the maids into the kitchen."
			},
			{
				"label": "金氏——————Jin Shi",
				"value": 2,
				"id": 4136,
				"categories": ["person"],
				"info": "贾璜之妻。——————Jia Huang's Wife"
			},
			{
				"label": "五嫂子——————Mrs.Fivey",
				"value": 2,
				"id": 4138,
				"categories": ["person"],
				"info": "贾芸之母。——————Jia Yun's mother."
			},
			{
				"label": "来升媳妇——————Laisheng's wife",
				"value": 2,
				"id": 4139,
				"categories": ["person"],
				"info": "宁府都总管赖二之妻。在秦氏丧仪中听凤姐令，每日揽总查看，不敢疏忽。——————Ning Mansion is in charge of Lai's wife. Listen to Wang Xifeng's orders in the Qin Shi funeral."
			},
			{
				"label": "龄官——————Charmante",
				"value": 2,
				"image": "龄官.png",
				"id": 4140,
				"categories": ["guan"],
				"info": "贾家买来的十二个唱戏的女孩之一。长相、气质很像林黛玉，她与贾蔷的爱情也给了宝玉不一样的启发。——————One of the twelve opera singing girls bought by the Jia family. Looking and acting like Lin Daiyu, her love for Jia Qiang also inspires Baoyu in a different way."
			},
			{
				"label": "封氏——————Feng Shi",
				"value": 5,
				"id": 4141,
				"categories": ["person"],
				"info": "甄士隐的夫人——————甄士隐的夫人"
			},
			{
				"label": "赖嬷嬷——————Nana lai",
				"value": 2,
				"image": "赖嬷嬷.png",
				"id": 4142,
				"categories": ["person"],
				"info": "贾府管事之一，赖大的mother，孙子赖尚荣在贾府的帮助做了知县。——————One of Jia Mansion's stewards, Lai Da's mother, and grandson, Lai Shang Rong, became a governor with the help of the Jia Mansion."
			},
			{
				"label": "周姨娘——————Mrs. Zhou",
				"value": 1,
				"id": 4143,
				"categories": ["person"],
				"info": "贾政的妾——————Jia Zheng's concubine"
			},
			{
				"label": "翠云——————Chuiyun",
				"value": 1,
				"id": 4144,
				"categories": ["person"],
				"info": "贾赦之妾——————Jia She's concubine"
			},
			{
				"label": "嫣红——————Yanhong",
				"value": 1,
				"id": 4145,
				"categories": ["person"],
				"info": "贾赦的妾——————Jia She's concubine"
			},
			{
				"label": "坠儿——————Trinket",
				"value": 3,
				"image": "坠儿.png",
				"id": 4146,
				"categories": ["person"],
				"info": "宝玉的小丫头，因偷了平儿的一个镯子，被晴雯得知后，气得晴雯蛾眉倒蹙，凤眼圆睁，把她撵了出去。——————Baoyu's maid, who was thrown out by Skybright for stealing one of Patience's bangles."
			},
			{
				"label": "智能儿——————Sapientia",
				"value": 2,
				"id": 4147,
				"categories": ["zhuyao"],
				"info": "秦钟之相好——————Qin Zhongzhi's lover"
			},
			{
				"label": "净虚——————Jinxu",
				"value": 1,
				"id": 4148,
				"categories": ["person"],
				"info": "水月庵的尼姑，小尼姑智能儿的师父。——————River Goddess Convent's nun, Sapientia's master."
			},
			{
				"label": "万儿——————Swastika",
				"value": 3,
				"id": 4149,
				"categories": ["person"],
				"info": "贾珍、尤氏的丫头——————Jia Zhen and You's servant girl"
			},
			{
				"label": "司棋母——————Chess‘ mother",
				"value": 2,
				"image": "司棋母.png",
				"id": 4150,
				"categories": ["person"],
				"info": "阻挠女儿和自己的侄儿自己结合，以致潘又安、司棋双双徇情自尽。——————Preventing her daughter from marrying with her nephew, Pan Youan and Chess both committed suicide."
			},
			{
				"label": "白大娘——————Mrs. White",
				"value": 2,
				"id": 4151,
				"categories": ["person"],
				"info": "金钏、玉钏之母——————Golden and Silver's mother"
			},
			{
				"label": "尤老娘——————Mrs. You",
				"value": 1,
				"image": "尤老娘.png",
				"id": 4152,
				"categories": ["person"],
				"info": "尤二姐、尤三姐的亲娘，也是宁国府尤氏的继母，两个女儿也与尤氏没有血缘关系。她的两个女儿都生的青春貌美，她想用国色天香的尤二姐来嫁给贾琏，提高她在贾府的地位，可是后来尤二姐被凤姐害死了，尤三姐也因想柳湘莲订婚不成，自刎了。从mother的角度来说，她是一个失败的mother，失去了两个女儿。——————You Erjie, You Sanjie's mother-in-law, and the stepmother of Ningguo's mansion You Shi. Both of her daughters were young and beautiful. She wanted to use her daughter to improve her status in Jia's residence, but both daughters died later. From a mother’s point of view, she is a failed mother, having lost two daughters"
			},
			{
				"label": "周奶奶——————Nanny Zhou",
				"value": 1,
				"id": 4153,
				"categories": ["person"],
				"info": "史湘云之奶娘——————Shi Xiongyun's Nana"
			},
			{
				"label": "豆官——————Cardamome",
				"value": 1,
				"id": 4154,
				"categories": ["guan"],
				"info": "贾家买来唱戏的女优伶。戏班解散后，随侍薛宝琴。——————A female opera singer bought by the Jia family. After the troupe is disbanded, she accompanies Xue Baoqin."
			},
			{
				"label": "文花——————Wenhua",
				"value": 1,
				"id": 4155,
				"categories": ["person"],
				"info": "贾珍的小妾，很会唱曲——————Jia Zhen's concubine, who is very good at singing."
			},
			{
				"label": "赵嬷嬷————Nana Zhao",
				"value": 3,
				"image": "赵嬷嬷.png",
				"id": 4156,
				"categories": ["person"],
				"info": "贾琏的乳母。曾求贾琏夫妇给她的两个儿子找份差事干。——————Jia Lian's nanny. She begged Lian and his wife to find work for her two sons."
			},
			{
				"label": "娄氏——————Lou Shi",
				"value": 1,
				"id": 4157,
				"categories": ["person"],
				"info": "贾菌之母——————mother of Jia Jun"
			},
			{
				"label": "老叶妈——————Tealeaf‘s mother",
				"value": 1,
				"id": 4158,
				"categories": ["person"],
				"info": "宝玉小厮茗烟之母——————Tealeaf‘s mother"
			},
			{
				"label": "周氏——————Mrs.Zhou",
				"value": 1,
				"id": 4160,
				"categories": ["person"],
				"info": "贾芹之母——————Mother of Jia Qin"
			},
			{
				"label": "佩凤——————Peifeng",
				"value": 1,
				"id": 4161,
				"categories": ["person"],
				"info": "贾珍之妾——————Jia Zhen's concubine,"
			},
			{
				"label": "代儒夫人——————Madame Dairu",
				"value": 2,
				"image": "代儒夫人.png",
				"id": 4162,
				"categories": ["person"],
				"info": "贾瑞之祖母——————JiaRui‘s Grandma"
			},
			{
				"label": "春燕——————Chunyan",
				"value": 2,
				"image": "春燕.png",
				"id": 4163,
				"categories": ["person"],
				"info": "何婆子之女，聪明伶俐乐于助人。——————Daughter of Granny He. She's intelligent and helpful."
			},
			{
				"label": "何婆子——————Granny He",
				"value": 1,
				"image": "何婆子.png",
				"id": 4164,
				"categories": ["person"],
				"info": "秦钟的丫头春燕之母。——————The mother of Qin Zhong's maid Chun Yan."
			},
			{
				"label": "碧痕——————Emerald ",
				"value": 1,
				"image": "碧痕.png",
				"id": 4165,
				"categories": ["person"],
				"info": "贾宝玉的丫鬟，她心气很高。——————Jia Baoyu's maid, she has a high spirits"
			},
			{
				"label": "笑儿——————Happy",
				"value": 1,
				"id": 4166,
				"categories": ["person"],
				"info": "史湘云的丫头——————Shi Xiangyun's maid"
			},
			{
				"label": "警幻仙姑——————the fairy Disenchantment disenchantment",
				"value": 2,
				"image": "警幻仙姑.png",
				"id": 4167,
				"categories": ["zhuyao"],
				"info": "太虚幻境司主，相当于西方的维纳斯、丘比特。她首次提出“意淫”的概念。——————The owner of the Land of Illusion is the Western equivalent of Venus and Cupid. She first introduced the concept of masturbation."
			},
			{
				"label": "马道婆——————Witch Ma",
				"value": 4,
				"image": "马道婆.png",
				"id": 4168,
				"categories": ["zhuyao"],
				"info": "贾宝玉寄名的godmother，是个搞封建迷信，邪魔歪道的混帐东西，经常出入贾府各房各屋。——————Jia Baoyu's foster-name godmother is a feudal, superstitious, evil and devious villain who frequents the Jia residence."
			},
			{
				"label": "南安太妃——————imperial consort of Nan An",
				"value": 5,
				"image": "南安太妃.png",
				"id": 4169,
				"categories": ["zhuyao"],
				"info": "她决定了贾府三小姐探春的命运——————She decided Jia Tanchun's fate."
			},
			{
				"label": "夏婆子——————Granny Xia",
				"value": 1,
				"id": 4170,
				"categories": ["person"],
				"info": "她是藕官的godmother，小蝉的外婆，平日在大观园当差。——————She was Nenuphar's godmother, Cicada's grandmother."
			},
			{
				"label": "费婆子——————Granny Fei",
				"value": 1,
				"id": 4171,
				"categories": ["person"],
				"info": "邢夫人的丫鬟——Mrs. Xing's maid"
			},
			{
				"label": "周瑞之女——————Daughter of Zhou Rui",
				"value": 4,
				"id": 4172,
				"categories": ["person"],
				"info": "周瑞之女——————Daughter of Zhou Rui"
			},
			{
				"label": "玉官——————Topaze ",
				"value": 3,
				"image": "玉官.png",
				"id": 9999,
				"categories": ["guan"],
				"info": "玉官是贾家买来的十二个唱戏的优伶之一。——————Topaze is one of the twelve opera singers purchased by the Jia family. "
			},
			{
				"label": "宝官——————Trésor ",
				"value": 3,
				"image": "宝官.png",
				"id": 9998,
				"categories": ["guan"],
				"info": "宝官是贾家买来的十二个唱戏的优伶之一。——————Trésor is one of the twelve opera singers purchased by the Jia family. "
			},
			{
				"label": "绛珠仙子——————Vermilion Pearl Plant",
				"value": 2,
				"id": 4173,
				"categories": ["zhuyao"],
				"info": "传说中的美丽仙女，林黛玉的previous incarnation (Buddhism)，一心回报神瑛侍者的灌溉之恩。——————The legendary beautiful fairy, Lindsay's former life, is determined to return the favor of Divine Luminescent Stone-in-Waiting's irrigation."
			}
		],
		"edges": [
			{
				"id": 3776,
				"label": "situated in",
				"from": 3838,
				"to": 3851
			},
			{
				"id": 3777,
				"label": "situated in",
				"from": 3839,
				"to": 3851
			},
			{
				"id": 3778,
				"label": "situated in",
				"from": 3840,
				"to": 3851
			},
			{
				"id": 3779,
				"label": "situated in",
				"from": 3841,
				"to": 3851
			},
			{
				"id": 3780,
				"label": "situated in",
				"from": 3842,
				"to": 3851
			},
			{
				"id": 3781,
				"label": "situated in",
				"from": 3843,
				"to": 3856
			},
			{
				"id": 3782,
				"label": "situated in",
				"from": 3844,
				"to": 3851
			},
			{
				"id": 3783,
				"label": "situated in",
				"from": 3845,
				"to": 3851
			},
			{
				"id": 3784,
				"label": "situated in",
				"from": 3846,
				"to": 3851
			},
			{
				"id": 3785,
				"label": "situated in",
				"from": 3847,
				"to": 3848
			},
			{
				"id": 3786,
				"label": "situated in",
				"from": 3851,
				"to": 3856
			},
			{
				"id": 3787,
				"label": "situated in",
				"from": 3852,
				"to": 3853
			},
			{
				"id": 3788,
				"label": "situated in",
				"from": 3858,
				"to": 3850
			},
			{
				"id": 3789,
				"label": "situated in",
				"from": 3862,
				"to": 3850
			},
			{
				"id": 3122,
				"label": "mother",
				"from": 3863,
				"to": 4051
			},
			{
				"id": 3090,
				"label": "father",
				"from": 3863,
				"to": 3869
			},
			{
				"id": 3142,
				"label": "wife",
				"from": 3863,
				"to": 4038
			},
			{
				"id": 3251,
				"label": "sister",
				"from": 3863,
				"to": 4044
			},
			{
				"id": 3262,
				"label": "teacher",
				"from": 3863,
				"to": 3910
			},
			{
				"id": 3271,
				"label": "wet nurse",
				"from": 3863,
				"to": 4121
			},
			{
				"id": 3278,
				"label": "befriend",
				"from": 3863,
				"to": 3881
			},
			{
				"id": 3289,
				"label": "befriend",
				"from": 3863,
				"to": 3890
			},
			{
				"id": 3292,
				"label": "befriend",
				"from": 3863,
				"to": 3893
			},
			{
				"id": 3294,
				"label": "befriend",
				"from": 3863,
				"to": 3954
			},
			{
				"id": 3295,
				"label": "same clan",
				"from": 3863,
				"to": 3878
			},
			{
				"id": 3312,
				"label": "attendant",
				"from": 3863,
				"to": 3907
			},
			{
				"id": 3316,
				"label": "attendant",
				"from": 3863,
				"to": 3926
			},
			{
				"id": 3320,
				"label": "slave",
				"from": 3863,
				"to": 4055
			},
			{
				"id": 3328,
				"label": "slave",
				"from": 3863,
				"to": 4054
			},
			{
				"id": 3335,
				"label": "slave",
				"from": 3863,
				"to": 4065
			},
			{
				"id": 3337,
				"label": "slave",
				"from": 3863,
				"to": 4064
			},
			{
				"id": 3338,
				"label": "slave",
				"from": 3863,
				"to": 4163
			},
			{
				"id": 3339,
				"label": "slave",
				"from": 3863,
				"to": 4165
			},
			{
				"id": 3340,
				"label": "engage",
				"from": 3863,
				"to": 3779
			},
			{
				"id": 3382,
				"label": "engage",
				"from": 3863,
				"to": 3825
			},
			{
				"id": 3396,
				"label": "engage",
				"from": 3863,
				"to": 3781
			},
			{
				"id": 3401,
				"label": "engage",
				"from": 3863,
				"to": 3790
			},
			{
				"id": 3402,
				"label": "engage",
				"from": 3863,
				"to": 3782
			},
			{
				"id": 3403,
				"label": "engage",
				"from": 3863,
				"to": 3783
			},
			{
				"id": 3404,
				"label": "engage",
				"from": 3863,
				"to": 3784
			},
			{
				"id": 3405,
				"label": "engage",
				"from": 3863,
				"to": 3794
			},
			{
				"id": 3406,
				"label": "engage",
				"from": 3863,
				"to": 3797
			},
			{
				"id": 3407,
				"label": "engage",
				"from": 3863,
				"to": 3799
			},
			{
				"id": 3408,
				"label": "engage",
				"from": 3863,
				"to": 3802
			},
			{
				"id": 3409,
				"label": "engage",
				"from": 3863,
				"to": 3803
			},
			{
				"id": 3410,
				"label": "engage",
				"from": 3863,
				"to": 3804
			},
			{
				"id": 3411,
				"label": "engage",
				"from": 3863,
				"to": 3810
			},
			{
				"id": 3412,
				"label": "engage",
				"from": 3863,
				"to": 3815
			},
			{
				"id": 3413,
				"label": "engage",
				"from": 3863,
				"to": 3817
			},
			{
				"id": 3414,
				"label": "engage",
				"from": 3863,
				"to": 3818
			},
			{
				"id": 3415,
				"label": "engage",
				"from": 3863,
				"to": 3833
			},
			{
				"id": 3416,
				"label": "engage",
				"from": 3863,
				"to": 3821
			},
			{
				"id": 3417,
				"label": "engage",
				"from": 3863,
				"to": 3837
			},
			{
				"id": 3418,
				"label": "engage",
				"from": 3863,
				"to": 3785
			},
			{
				"id": 3255,
				"label": "brother",
				"from": 3863,
				"to": 3876
			},
			{
				"id": 3187,
				"label": "residency",
				"from": 3863,
				"to": 3845
			},
			{
				"id": 3222,
				"label": "homeland",
				"from": 3863,
				"to": 3855
			},
			{
				"id": 3261,
				"label": "godmother",
				"from": 3863,
				"to": 4168
			},
			{
				"id": 3250,
				"label": "previous incarnation (Buddhism)",
				"from": 3863,
				"to": 3972
			},
			{
				"id": 3223,
				"label": "homeland",
				"from": 3864,
				"to": 3855
			},
			{
				"id": 3188,
				"label": "residency",
				"from": 3864,
				"to": 3848
			},
			{
				"id": 3143,
				"label": "wife",
				"from": 3864,
				"to": 4049
			},
			{
				"id": 3091,
				"label": "father",
				"from": 3864,
				"to": 3880
			},
			{
				"id": 3224,
				"label": "homeland",
				"from": 3865,
				"to": 3855
			},
			{
				"id": 3189,
				"label": "residency",
				"from": 3865,
				"to": 3849
			},
			{
				"id": 3092,
				"label": "father",
				"from": 3865,
				"to": 3879
			},
			{
				"id": 3225,
				"label": "homeland",
				"from": 3866,
				"to": 3855
			},
			{
				"id": 3190,
				"label": "residency",
				"from": 3866,
				"to": 3849
			},
			{
				"id": 3093,
				"label": "father",
				"from": 3866,
				"to": 3865
			},
			{
				"id": 3256,
				"label": "brother",
				"from": 3867,
				"to": 3866
			},
			{
				"id": 3226,
				"label": "homeland",
				"from": 3867,
				"to": 3855
			},
			{
				"id": 3191,
				"label": "residency",
				"from": 3867,
				"to": 3852
			},
			{
				"id": 3094,
				"label": "father",
				"from": 3867,
				"to": 3865
			},
			{
				"id": 3383,
				"label": "engage",
				"from": 3868,
				"to": 3820
			},
			{
				"id": 3341,
				"label": "engage",
				"from": 3868,
				"to": 3786
			},
			{
				"id": 3227,
				"label": "homeland",
				"from": 3868,
				"to": 3855
			},
			{
				"id": 3192,
				"label": "residency",
				"from": 3868,
				"to": 3848
			},
			{
				"id": 3182,
				"label": "concubine",
				"from": 3868,
				"to": 4144
			},
			{
				"id": 3176,
				"label": "concubine",
				"from": 3868,
				"to": 4145
			},
			{
				"id": 3144,
				"label": "wife",
				"from": 3868,
				"to": 4046
			},
			{
				"id": 3123,
				"label": "mother",
				"from": 3868,
				"to": 4049
			},
			{
				"id": 3095,
				"label": "father",
				"from": 3868,
				"to": 3864
			},
			{
				"id": 3397,
				"label": "engage",
				"from": 3869,
				"to": 3818
			},
			{
				"id": 3384,
				"label": "engage",
				"from": 3869,
				"to": 3812
			},
			{
				"id": 3342,
				"label": "engage",
				"from": 3869,
				"to": 3804
			},
			{
				"id": 3329,
				"label": "slave",
				"from": 3869,
				"to": 4116
			},
			{
				"id": 3321,
				"label": "slave",
				"from": 3869,
				"to": 4096
			},
			{
				"id": 3272,
				"label": "wet nurse",
				"from": 3869,
				"to": 4142
			},
			{
				"id": 3257,
				"label": "brother",
				"from": 3869,
				"to": 3868
			},
			{
				"id": 3228,
				"label": "homeland",
				"from": 3869,
				"to": 3855
			},
			{
				"id": 3193,
				"label": "residency",
				"from": 3869,
				"to": 3848
			},
			{
				"id": 3183,
				"label": "concubine",
				"from": 3869,
				"to": 4143
			},
			{
				"id": 3177,
				"label": "concubine",
				"from": 3869,
				"to": 4047
			},
			{
				"id": 3145,
				"label": "wife",
				"from": 3869,
				"to": 4051
			},
			{
				"id": 3124,
				"label": "mother",
				"from": 3869,
				"to": 4049
			},
			{
				"id": 3096,
				"label": "father",
				"from": 3869,
				"to": 3864
			},
			{
				"id": 3385,
				"label": "engage",
				"from": 3870,
				"to": 3793
			},
			{
				"id": 3343,
				"label": "engage",
				"from": 3870,
				"to": 3788
			},
			{
				"id": 3279,
				"label": "befriend",
				"from": 3870,
				"to": 3874
			},
			{
				"id": 3194,
				"label": "residency",
				"from": 3870,
				"to": 3849
			},
			{
				"id": 3146,
				"label": "wife",
				"from": 3870,
				"to": 4053
			},
			{
				"id": 3097,
				"label": "father",
				"from": 3870,
				"to": 3873
			},
			{
				"id": 3344,
				"label": "engage",
				"from": 3871,
				"to": 3793
			},
			{
				"id": 3296,
				"label": "same clan",
				"from": 3871,
				"to": 3870
			},
			{
				"id": 3280,
				"label": "befriend",
				"from": 3871,
				"to": 3881
			},
			{
				"id": 3274,
				"label": "adultery",
				"from": 3871,
				"to": 4140
			},
			{
				"id": 3263,
				"label": "teacher",
				"from": 3872,
				"to": 3910
			},
			{
				"id": 3195,
				"label": "residency",
				"from": 3872,
				"to": 3848
			},
			{
				"id": 3125,
				"label": "mother",
				"from": 3872,
				"to": 4043
			},
			{
				"id": 3098,
				"label": "father",
				"from": 3872,
				"to": 3876
			},
			{
				"id": 3398,
				"label": "engage",
				"from": 3873,
				"to": 3780
			},
			{
				"id": 3386,
				"label": "engage",
				"from": 3873,
				"to": 3822
			},
			{
				"id": 3345,
				"label": "engage",
				"from": 3873,
				"to": 3819
			},
			{
				"id": 3336,
				"label": "slave",
				"from": 3873,
				"to": 3959
			},
			{
				"id": 3330,
				"label": "slave",
				"from": 3873,
				"to": 3932
			},
			{
				"id": 3322,
				"label": "slave",
				"from": 3873,
				"to": 3931
			},
			{
				"id": 3317,
				"label": "attendant",
				"from": 3873,
				"to": 3957
			},
			{
				"id": 3313,
				"label": "attendant",
				"from": 3873,
				"to": 3956
			},
			{
				"id": 3297,
				"label": "same clan",
				"from": 3873,
				"to": 3878
			},
			{
				"id": 3275,
				"label": "adultery",
				"from": 3873,
				"to": 4053
			},
			{
				"id": 3229,
				"label": "homeland",
				"from": 3873,
				"to": 3855
			},
			{
				"id": 3196,
				"label": "residency",
				"from": 3873,
				"to": 3849
			},
			{
				"id": 3178,
				"label": "concubine",
				"from": 3873,
				"to": 4161
			},
			{
				"id": 3147,
				"label": "wife",
				"from": 3873,
				"to": 4079
			},
			{
				"id": 3099,
				"label": "father",
				"from": 3873,
				"to": 3867
			},
			{
				"id": 3399,
				"label": "engage",
				"from": 3874,
				"to": 3789
			},
			{
				"id": 3387,
				"label": "engage",
				"from": 3874,
				"to": 3826
			},
			{
				"id": 3346,
				"label": "engage",
				"from": 3874,
				"to": 3788
			},
			{
				"id": 3331,
				"label": "slave",
				"from": 3874,
				"to": 3967
			},
			{
				"id": 3323,
				"label": "slave",
				"from": 3874,
				"to": 4102
			},
			{
				"id": 3318,
				"label": "attendant",
				"from": 3874,
				"to": 3937
			},
			{
				"id": 3314,
				"label": "attendant",
				"from": 3874,
				"to": 3938
			},
			{
				"id": 3298,
				"label": "same clan",
				"from": 3874,
				"to": 3878
			},
			{
				"id": 3276,
				"label": "adultery",
				"from": 3874,
				"to": 4122
			},
			{
				"id": 3273,
				"label": "wet nurse",
				"from": 3874,
				"to": 4156
			},
			{
				"id": 3230,
				"label": "homeland",
				"from": 3874,
				"to": 3855
			},
			{
				"id": 3197,
				"label": "residency",
				"from": 3874,
				"to": 3848
			},
			{
				"id": 3185,
				"label": "concubine",
				"from": 3874,
				"to": 4115
			},
			{
				"id": 3184,
				"label": "concubine",
				"from": 3874,
				"to": 4080
			},
			{
				"id": 3179,
				"label": "concubine",
				"from": 3874,
				"to": 4056
			},
			{
				"id": 3148,
				"label": "wife",
				"from": 3874,
				"to": 4041
			},
			{
				"id": 3100,
				"label": "father",
				"from": 3874,
				"to": 3868
			},
			{
				"id": 3299,
				"label": "same clan",
				"from": 3875,
				"to": 3878
			},
			{
				"id": 3198,
				"label": "residency",
				"from": 3875,
				"to": 3848
			},
			{
				"id": 3126,
				"label": "mother",
				"from": 3875,
				"to": 4046
			},
			{
				"id": 3101,
				"label": "father",
				"from": 3875,
				"to": 3868
			},
			{
				"id": 3332,
				"label": "slave",
				"from": 3876,
				"to": 4072
			},
			{
				"id": 3324,
				"label": "slave",
				"from": 3876,
				"to": 4103
			},
			{
				"id": 3300,
				"label": "same clan",
				"from": 3876,
				"to": 3878
			},
			{
				"id": 3231,
				"label": "homeland",
				"from": 3876,
				"to": 3855
			},
			{
				"id": 3199,
				"label": "residency",
				"from": 3876,
				"to": 3848
			},
			{
				"id": 3149,
				"label": "wife",
				"from": 3876,
				"to": 4043
			},
			{
				"id": 3127,
				"label": "mother",
				"from": 3876,
				"to": 4051
			},
			{
				"id": 3102,
				"label": "father",
				"from": 3876,
				"to": 3869
			},
			{
				"id": 3347,
				"label": "engage",
				"from": 3877,
				"to": 3804
			},
			{
				"id": 3315,
				"label": "attendant",
				"from": 3877,
				"to": 3958
			},
			{
				"id": 3301,
				"label": "same clan",
				"from": 3877,
				"to": 3878
			},
			{
				"id": 3258,
				"label": "brother",
				"from": 3877,
				"to": 3874
			},
			{
				"id": 3252,
				"label": "sister",
				"from": 3877,
				"to": 4045
			},
			{
				"id": 3200,
				"label": "residency",
				"from": 3877,
				"to": 3848
			},
			{
				"id": 3128,
				"label": "mother",
				"from": 3877,
				"to": 4047
			},
			{
				"id": 3103,
				"label": "father",
				"from": 3877,
				"to": 3869
			},
			{
				"id": 3150,
				"label": "wife",
				"from": 3878,
				"to": 4136
			},
			{
				"id": 3325,
				"label": "slave",
				"from": 3879,
				"to": 3897
			},
			{
				"id": 3232,
				"label": "homeland",
				"from": 3879,
				"to": 3855
			},
			{
				"id": 3201,
				"label": "residency",
				"from": 3879,
				"to": 3849
			},
			{
				"id": 3259,
				"label": "brother",
				"from": 3880,
				"to": 3879
			},
			{
				"id": 3233,
				"label": "homeland",
				"from": 3880,
				"to": 3855
			},
			{
				"id": 3202,
				"label": "residency",
				"from": 3880,
				"to": 3848
			},
			{
				"id": 3388,
				"label": "engage",
				"from": 3881,
				"to": 3790
			},
			{
				"id": 3348,
				"label": "engage",
				"from": 3881,
				"to": 3810
			},
			{
				"id": 3290,
				"label": "befriend",
				"from": 3881,
				"to": 3922
			},
			{
				"id": 3264,
				"label": "teacher",
				"from": 3881,
				"to": 3910
			},
			{
				"id": 3253,
				"label": "sister",
				"from": 3881,
				"to": 4053
			},
			{
				"id": 3104,
				"label": "father",
				"from": 3881,
				"to": 3898
			},
			{
				"id": 3234,
				"label": "homeland",
				"from": 3882,
				"to": 3855
			},
			{
				"id": 3105,
				"label": "father",
				"from": 3882,
				"to": 3883
			},
			{
				"id": 3235,
				"label": "homeland",
				"from": 3883,
				"to": 3855
			},
			{
				"id": 3106,
				"label": "father",
				"from": 3883,
				"to": 3899
			},
			{
				"id": 3349,
				"label": "engage",
				"from": 3884,
				"to": 3791
			},
			{
				"id": 3236,
				"label": "homeland",
				"from": 3884,
				"to": 3855
			},
			{
				"id": 3107,
				"label": "father",
				"from": 3884,
				"to": 3943
			},
			{
				"id": 3389,
				"label": "engage",
				"from": 3885,
				"to": 3795
			},
			{
				"id": 3350,
				"label": "engage",
				"from": 3885,
				"to": 3792
			},
			{
				"id": 3293,
				"label": "befriend",
				"from": 3885,
				"to": 3890
			},
			{
				"id": 3291,
				"label": "befriend",
				"from": 3885,
				"to": 3942
			},
			{
				"id": 3281,
				"label": "befriend",
				"from": 3885,
				"to": 3925
			},
			{
				"id": 3277,
				"label": "adultery",
				"from": 3885,
				"to": 4068
			},
			{
				"id": 3265,
				"label": "teacher",
				"from": 3885,
				"to": 3910
			},
			{
				"id": 3237,
				"label": "homeland",
				"from": 3885,
				"to": 3855
			},
			{
				"id": 3180,
				"label": "concubine",
				"from": 3885,
				"to": 4066
			},
			{
				"id": 3151,
				"label": "wife",
				"from": 3885,
				"to": 4076
			},
			{
				"id": 3129,
				"label": "mother",
				"from": 3885,
				"to": 4075
			},
			{
				"id": 3108,
				"label": "father",
				"from": 3885,
				"to": 3953
			},
			{
				"id": 3351,
				"label": "engage",
				"from": 3886,
				"to": 3811
			},
			{
				"id": 3260,
				"label": "brother",
				"from": 3886,
				"to": 3885
			},
			{
				"id": 3152,
				"label": "wife",
				"from": 3886,
				"to": 4078
			},
			{
				"id": 3238,
				"label": "homeland",
				"from": 3887,
				"to": 3855
			},
			{
				"id": 3109,
				"label": "father",
				"from": 3887,
				"to": 3889
			},
			{
				"id": 3239,
				"label": "homeland",
				"from": 3888,
				"to": 3855
			},
			{
				"id": 3110,
				"label": "father",
				"from": 3888,
				"to": 3889
			},
			{
				"id": 3240,
				"label": "homeland",
				"from": 3889,
				"to": 3855
			},
			{
				"id": 3111,
				"label": "father",
				"from": 3889,
				"to": 3902
			},
			{
				"id": 3390,
				"label": "engage",
				"from": 3890,
				"to": 3795
			},
			{
				"id": 3352,
				"label": "engage",
				"from": 3890,
				"to": 3829
			},
			{
				"id": 3319,
				"label": "attendant",
				"from": 3890,
				"to": 3933
			},
			{
				"id": 3282,
				"label": "befriend",
				"from": 3890,
				"to": 3881
			},
			{
				"id": 3391,
				"label": "engage",
				"from": 3891,
				"to": 3835
			},
			{
				"id": 3353,
				"label": "engage",
				"from": 3891,
				"to": 3792
			},
			{
				"id": 3309,
				"label": "Same clan",
				"from": 3891,
				"to": 3869
			},
			{
				"id": 3283,
				"label": "befriend",
				"from": 3891,
				"to": 3940
			},
			{
				"id": 3241,
				"label": "homeland",
				"from": 3891,
				"to": 3857
			},
			{
				"id": 3203,
				"label": "residency",
				"from": 3891,
				"to": 3955
			},
			{
				"id": 3181,
				"label": "concubine",
				"from": 3891,
				"to": 4117
			},
			{
				"id": 3392,
				"label": "engage",
				"from": 3892,
				"to": 3790
			},
			{
				"id": 3354,
				"label": "engage",
				"from": 3892,
				"to": 3793
			},
			{
				"id": 3204,
				"label": "residency",
				"from": 3892,
				"to": 3856
			},
			{
				"id": 3112,
				"label": "father",
				"from": 3892,
				"to": 3900
			},
			{
				"id": 3393,
				"label": "engage",
				"from": 3893,
				"to": 3804
			},
			{
				"id": 3355,
				"label": "engage",
				"from": 3893,
				"to": 3794
			},
			{
				"id": 3284,
				"label": "befriend",
				"from": 3893,
				"to": 3954
			},
			{
				"id": 3153,
				"label": "wife",
				"from": 3893,
				"to": 4055
			},
			{
				"id": 3356,
				"label": "engage",
				"from": 3894,
				"to": 3796
			},
			{
				"id": 3302,
				"label": "same clan",
				"from": 3894,
				"to": 3863
			},
			{
				"id": 3285,
				"label": "befriend",
				"from": 3894,
				"to": 3871
			},
			{
				"id": 3205,
				"label": "residency",
				"from": 3894,
				"to": 3853
			},
			{
				"id": 3154,
				"label": "wife",
				"from": 3894,
				"to": 4085
			},
			{
				"id": 3130,
				"label": "mother",
				"from": 3894,
				"to": 4138
			},
			{
				"id": 3357,
				"label": "engage",
				"from": 3895,
				"to": 3796
			},
			{
				"id": 3206,
				"label": "residency",
				"from": 3895,
				"to": 3856
			},
			{
				"id": 3358,
				"label": "engage",
				"from": 3896,
				"to": 3780
			},
			{
				"id": 3207,
				"label": "residency",
				"from": 3896,
				"to": 3850
			},
			{
				"id": 3155,
				"label": "wife",
				"from": 3896,
				"to": 4048
			},
			{
				"id": 3208,
				"label": "residency",
				"from": 3897,
				"to": 3849
			},
			{
				"id": 3242,
				"label": "homeland",
				"from": 3899,
				"to": 3855
			},
			{
				"id": 3243,
				"label": "homeland",
				"from": 3900,
				"to": 3853
			},
			{
				"id": 3113,
				"label": "father",
				"from": 3900,
				"to": 3910
			},
			{
				"id": 3244,
				"label": "homeland",
				"from": 3902,
				"to": 3855
			},
			{
				"id": 3359,
				"label": "engage",
				"from": 3903,
				"to": 3824
			},
			{
				"id": 3333,
				"label": "slave",
				"from": 3903,
				"to": 3970
			},
			{
				"id": 3326,
				"label": "slave",
				"from": 3903,
				"to": 4117
			},
			{
				"id": 3245,
				"label": "homeland",
				"from": 3903,
				"to": 3850
			},
			{
				"id": 3209,
				"label": "residency",
				"from": 3903,
				"to": 3862
			},
			{
				"id": 3156,
				"label": "wife",
				"from": 3903,
				"to": 4141
			},
			{
				"id": 3360,
				"label": "engage",
				"from": 3905,
				"to": 3814
			},
			{
				"id": 3246,
				"label": "homeland",
				"from": 3905,
				"to": 3853
			},
			{
				"id": 3157,
				"label": "wife",
				"from": 3905,
				"to": 4039
			},
			{
				"id": 3131,
				"label": "mother",
				"from": 3905,
				"to": 4083
			},
			{
				"id": 3114,
				"label": "father",
				"from": 3905,
				"to": 3917
			},
			{
				"id": 3361,
				"label": "engage",
				"from": 3906,
				"to": 3820
			},
			{
				"id": 3247,
				"label": "homeland",
				"from": 3906,
				"to": 3861
			},
			{
				"id": 3210,
				"label": "residency",
				"from": 3906,
				"to": 3856
			},
			{
				"id": 3158,
				"label": "wife",
				"from": 3906,
				"to": 4042
			},
			{
				"id": 3132,
				"label": "mother",
				"from": 3907,
				"to": 4121
			},
			{
				"id": 3133,
				"label": "mother",
				"from": 3908,
				"to": 4156
			},
			{
				"id": 3134,
				"label": "mother",
				"from": 3909,
				"to": 4156
			},
			{
				"id": 3303,
				"label": "same clan",
				"from": 3910,
				"to": 3869
			},
			{
				"id": 3248,
				"label": "homeland",
				"from": 3910,
				"to": 3853
			},
			{
				"id": 3159,
				"label": "wife",
				"from": 3910,
				"to": 4162
			},
			{
				"id": 3160,
				"label": "wife",
				"from": 3911,
				"to": 4123
			},
			{
				"id": 3135,
				"label": "mother",
				"from": 3911,
				"to": 4142
			},
			{
				"id": 3161,
				"label": "wife",
				"from": 3913,
				"to": 4122
			},
			{
				"id": 3310,
				"label": "Same clan",
				"from": 3916,
				"to": 3883
			},
			{
				"id": 3115,
				"label": "father",
				"from": 3916,
				"to": 3915
			},
			{
				"id": 3162,
				"label": "wife",
				"from": 3917,
				"to": 4083
			},
			{
				"id": 3116,
				"label": "father",
				"from": 3917,
				"to": 3916
			},
			{
				"id": 3311,
				"label": "Kindness",
				"from": 3918,
				"to": 3917
			},
			{
				"id": 3163,
				"label": "wife",
				"from": 3918,
				"to": 4131
			},
			{
				"id": 3164,
				"label": "wife",
				"from": 3919,
				"to": 4132
			},
			{
				"id": 3165,
				"label": "wife",
				"from": 3920,
				"to": 4086
			},
			{
				"id": 3362,
				"label": "engage",
				"from": 3921,
				"to": 3786
			},
			{
				"id": 3117,
				"label": "father",
				"from": 3921,
				"to": 3935
			},
			{
				"id": 3266,
				"label": "teacher",
				"from": 3922,
				"to": 3910
			},
			{
				"id": 3363,
				"label": "engage",
				"from": 3923,
				"to": 3790
			},
			{
				"id": 3304,
				"label": "same clan",
				"from": 3923,
				"to": 3870
			},
			{
				"id": 3286,
				"label": "befriend",
				"from": 3923,
				"to": 3924
			},
			{
				"id": 3267,
				"label": "teacher",
				"from": 3923,
				"to": 3910
			},
			{
				"id": 3136,
				"label": "mother",
				"from": 3923,
				"to": 4157
			},
			{
				"id": 3364,
				"label": "engage",
				"from": 3924,
				"to": 3790
			},
			{
				"id": 3305,
				"label": "same clan",
				"from": 3924,
				"to": 3870
			},
			{
				"id": 3268,
				"label": "teacher",
				"from": 3924,
				"to": 3910
			},
			{
				"id": 3365,
				"label": "engage",
				"from": 3925,
				"to": 3790
			},
			{
				"id": 3269,
				"label": "teacher",
				"from": 3925,
				"to": 3910
			},
			{
				"id": 3366,
				"label": "engage",
				"from": 3926,
				"to": 3790
			},
			{
				"id": 3270,
				"label": "teacher",
				"from": 3926,
				"to": 3910
			},
			{
				"id": 3137,
				"label": "mother",
				"from": 3926,
				"to": 4158
			},
			{
				"id": 3367,
				"label": "engage",
				"from": 3927,
				"to": 3801
			},
			{
				"id": 3307,
				"label": "same clan",
				"from": 3929,
				"to": 3874
			},
			{
				"id": 3139,
				"label": "mother",
				"from": 3929,
				"to": 4160
			},
			{
				"id": 3308,
				"label": "same clan",
				"from": 3930,
				"to": 3863
			},
			{
				"id": 3166,
				"label": "wife",
				"from": 3931,
				"to": 4139
			},
			{
				"id": 3334,
				"label": "slave",
				"from": 3932,
				"to": 3938
			},
			{
				"id": 3327,
				"label": "slave",
				"from": 3932,
				"to": 4149
			},
			{
				"id": 3368,
				"label": "engage",
				"from": 3934,
				"to": 3812
			},
			{
				"id": 3287,
				"label": "befriend",
				"from": 3934,
				"to": 3890
			},
			{
				"id": 3118,
				"label": "father",
				"from": 3934,
				"to": 3911
			},
			{
				"id": 3254,
				"label": "sister",
				"from": 3936,
				"to": 4046
			},
			{
				"id": 3167,
				"label": "wife",
				"from": 3939,
				"to": 4125
			},
			{
				"id": 3369,
				"label": "engage",
				"from": 3940,
				"to": 3835
			},
			{
				"id": 3211,
				"label": "residency",
				"from": 3940,
				"to": 3856
			},
			{
				"id": 3168,
				"label": "wife",
				"from": 3940,
				"to": 4172
			},
			{
				"id": 3119,
				"label": "father",
				"from": 3943,
				"to": 3883
			},
			{
				"id": 3120,
				"label": "father",
				"from": 3944,
				"to": 3889
			},
			{
				"id": 3169,
				"label": "wife",
				"from": 3945,
				"to": 4052
			},
			{
				"id": 3170,
				"label": "wife",
				"from": 3946,
				"to": 4077
			},
			{
				"id": 3171,
				"label": "wife",
				"from": 3947,
				"to": 4124
			},
			{
				"id": 3370,
				"label": "engage",
				"from": 3948,
				"to": 3788
			},
			{
				"id": 3172,
				"label": "wife",
				"from": 3948,
				"to": 4119
			},
			{
				"id": 3212,
				"label": "residency",
				"from": 3949,
				"to": 3850
			},
			{
				"id": 3173,
				"label": "wife",
				"from": 3950,
				"to": 4129
			},
			{
				"id": 3371,
				"label": "engage",
				"from": 3951,
				"to": 3792
			},
			{
				"id": 3249,
				"label": "homeland",
				"from": 3951,
				"to": 3850
			},
			{
				"id": 3213,
				"label": "residency",
				"from": 3951,
				"to": 3858
			},
			{
				"id": 3140,
				"label": "mother",
				"from": 3953,
				"to": 4075
			},
			{
				"id": 3214,
				"label": "residency",
				"from": 3954,
				"to": 3856
			},
			{
				"id": 3790,
				"label": "situated in",
				"from": 3955,
				"to": 3855
			},
			{
				"id": 3215,
				"label": "residency",
				"from": 3960,
				"to": 3859
			},
			{
				"id": 3174,
				"label": "wife",
				"from": 3960,
				"to": 4169
			},
			{
				"id": 3372,
				"label": "engage",
				"from": 3961,
				"to": 3792
			},
			{
				"id": 3216,
				"label": "residency",
				"from": 3961,
				"to": 3855
			},
			{
				"id": 3217,
				"label": "residency",
				"from": 3962,
				"to": 3855
			},
			{
				"id": 3373,
				"label": "engage",
				"from": 3963,
				"to": 3818
			},
			{
				"id": 3374,
				"label": "engage",
				"from": 3964,
				"to": 3818
			},
			{
				"id": 3375,
				"label": "engage",
				"from": 3965,
				"to": 3818
			},
			{
				"id": 3376,
				"label": "engage",
				"from": 3967,
				"to": 3780
			},
			{
				"id": 3394,
				"label": "engage",
				"from": 3968,
				"to": 3783
			},
			{
				"id": 3377,
				"label": "engage",
				"from": 3968,
				"to": 3824
			},
			{
				"id": 3288,
				"label": "befriend",
				"from": 3968,
				"to": 3969
			},
			{
				"id": 3400,
				"label": "engage",
				"from": 3969,
				"to": 3783
			},
			{
				"id": 3395,
				"label": "engage",
				"from": 3969,
				"to": 3793
			},
			{
				"id": 3378,
				"label": "engage",
				"from": 3969,
				"to": 3824
			},
			{
				"id": 3379,
				"label": "engage",
				"from": 3970,
				"to": 3834
			},
			{
				"id": 3218,
				"label": "residency",
				"from": 3970,
				"to": 3862
			},
			{
				"id": 3380,
				"label": "engage",
				"from": 3971,
				"to": 3808
			},
			{
				"id": 3175,
				"label": "wife",
				"from": 3971,
				"to": 4113
			},
			{
				"id": 3141,
				"label": "mother",
				"from": 3971,
				"to": 4119
			},
			{
				"id": 3121,
				"label": "father",
				"from": 3971,
				"to": 3948
			},
			{
				"id": 3381,
				"label": "engage",
				"from": 3972,
				"to": 3836
			},
			{
				"id": 3770,
				"label": "engage",
				"from": 4037,
				"to": 3831
			},
			{
				"id": 3767,
				"label": "engage",
				"from": 4037,
				"to": 3780
			},
			{
				"id": 3764,
				"label": "engage",
				"from": 4037,
				"to": 3815
			},
			{
				"id": 3758,
				"label": "engage",
				"from": 4037,
				"to": 3806
			},
			{
				"id": 3747,
				"label": "engage",
				"from": 4037,
				"to": 3781
			},
			{
				"id": 3723,
				"label": "engage",
				"from": 4037,
				"to": 3832
			},
			{
				"id": 3668,
				"label": "engage",
				"from": 4037,
				"to": 3779
			},
			{
				"id": 3658,
				"label": "slave",
				"from": 4037,
				"to": 4088
			},
			{
				"id": 3645,
				"label": "slave",
				"from": 4037,
				"to": 4070
			},
			{
				"id": 3628,
				"label": "slave",
				"from": 4037,
				"to": 4069
			},
			{
				"id": 3605,
				"label": "slave",
				"from": 4037,
				"to": 4058
			},
			{
				"id": 3590,
				"label": "fond",
				"from": 4037,
				"to": 3863
			},
			{
				"id": 3588,
				"label": "wet nurse",
				"from": 4037,
				"to": 4120
			},
			{
				"id": 3587,
				"label": "teacher",
				"from": 4037,
				"to": 3891
			},
			{
				"id": 3576,
				"label": "confidant",
				"from": 4037,
				"to": 4058
			},
			{
				"id": 3542,
				"label": "previous incarnation (Buddhism)",
				"from": 4037,
				"to": 4173
			},
			{
				"id": 3528,
				"label": "homeland",
				"from": 4037,
				"to": 3854
			},
			{
				"id": 3499,
				"label": "residency",
				"from": 4037,
				"to": 3838
			},
			{
				"id": 3441,
				"label": "mother",
				"from": 4037,
				"to": 4048
			},
			{
				"id": 3419,
				"label": "father",
				"from": 4037,
				"to": 3896
			},
			{
				"id": 3771,
				"label": "engage",
				"from": 4038,
				"to": 3837
			},
			{
				"id": 3768,
				"label": "engage",
				"from": 4038,
				"to": 3821
			},
			{
				"id": 3765,
				"label": "engage",
				"from": 4038,
				"to": 3816
			},
			{
				"id": 3759,
				"label": "engage",
				"from": 4038,
				"to": 3802
			},
			{
				"id": 3748,
				"label": "engage",
				"from": 4038,
				"to": 3781
			},
			{
				"id": 3724,
				"label": "engage",
				"from": 4038,
				"to": 3806
			},
			{
				"id": 3669,
				"label": "engage",
				"from": 4038,
				"to": 3784
			},
			{
				"id": 3646,
				"label": "slave",
				"from": 4038,
				"to": 4089
			},
			{
				"id": 3629,
				"label": "slave",
				"from": 4038,
				"to": 4071
			},
			{
				"id": 3606,
				"label": "slave",
				"from": 4038,
				"to": 4059
			},
			{
				"id": 3591,
				"label": "fond",
				"from": 4038,
				"to": 3863
			},
			{
				"id": 3551,
				"label": "brother",
				"from": 4038,
				"to": 3885
			},
			{
				"id": 3529,
				"label": "homeland",
				"from": 4038,
				"to": 3855
			},
			{
				"id": 3500,
				"label": "residency",
				"from": 4038,
				"to": 3839
			},
			{
				"id": 3442,
				"label": "mother",
				"from": 4038,
				"to": 4075
			},
			{
				"id": 3420,
				"label": "father",
				"from": 4038,
				"to": 3901
			},
			{
				"id": 3670,
				"label": "engage",
				"from": 4039,
				"to": 3791
			},
			{
				"id": 3530,
				"label": "homeland",
				"from": 4039,
				"to": 3856
			},
			{
				"id": 3501,
				"label": "residency",
				"from": 4039,
				"to": 3848
			},
			{
				"id": 3461,
				"label": "husband",
				"from": 4039,
				"to": 3905
			},
			{
				"id": 3443,
				"label": "mother",
				"from": 4039,
				"to": 4041
			},
			{
				"id": 3421,
				"label": "father",
				"from": 4039,
				"to": 3874
			},
			{
				"id": 3671,
				"label": "engage",
				"from": 4040,
				"to": 3781
			},
			{
				"id": 3647,
				"label": "slave",
				"from": 4040,
				"to": 4092
			},
			{
				"id": 3630,
				"label": "slave",
				"from": 4040,
				"to": 4091
			},
			{
				"id": 3607,
				"label": "slave",
				"from": 4040,
				"to": 4090
			},
			{
				"id": 3552,
				"label": "brother",
				"from": 4040,
				"to": 3873
			},
			{
				"id": 3531,
				"label": "homeland",
				"from": 4040,
				"to": 3856
			},
			{
				"id": 3502,
				"label": "residency",
				"from": 4040,
				"to": 3840
			},
			{
				"id": 3422,
				"label": "father",
				"from": 4040,
				"to": 3867
			},
			{
				"id": 3775,
				"label": "engage",
				"from": 4041,
				"to": 3830
			},
			{
				"id": 3774,
				"label": "engage",
				"from": 4041,
				"to": 3786
			},
			{
				"id": 3773,
				"label": "engage",
				"from": 4041,
				"to": 3826
			},
			{
				"id": 3772,
				"label": "engage",
				"from": 4041,
				"to": 3822
			},
			{
				"id": 3769,
				"label": "engage",
				"from": 4041,
				"to": 3814
			},
			{
				"id": 3766,
				"label": "engage",
				"from": 4041,
				"to": 3809
			},
			{
				"id": 3760,
				"label": "engage",
				"from": 4041,
				"to": 3807
			},
			{
				"id": 3749,
				"label": "engage",
				"from": 4041,
				"to": 3783
			},
			{
				"id": 3725,
				"label": "engage",
				"from": 4041,
				"to": 3798
			},
			{
				"id": 3672,
				"label": "engage",
				"from": 4041,
				"to": 3793
			},
			{
				"id": 3665,
				"label": "The maidservant accompanying the bride",
				"from": 4041,
				"to": 4119
			},
			{
				"id": 3663,
				"label": "slave",
				"from": 4041,
				"to": 3948
			},
			{
				"id": 3659,
				"label": "slave",
				"from": 4041,
				"to": 3938
			},
			{
				"id": 3648,
				"label": "slave",
				"from": 4041,
				"to": 4093
			},
			{
				"id": 3631,
				"label": "slave",
				"from": 4041,
				"to": 4085
			},
			{
				"id": 3608,
				"label": "slave",
				"from": 4041,
				"to": 4056
			},
			{
				"id": 3579,
				"label": "adultery",
				"from": 4041,
				"to": 3870
			},
			{
				"id": 3553,
				"label": "brother",
				"from": 4041,
				"to": 3884
			},
			{
				"id": 3532,
				"label": "homeland",
				"from": 4041,
				"to": 3855
			},
			{
				"id": 3503,
				"label": "residency",
				"from": 4041,
				"to": 3848
			},
			{
				"id": 3462,
				"label": "husband",
				"from": 4041,
				"to": 3874
			},
			{
				"id": 3423,
				"label": "father",
				"from": 4041,
				"to": 3943
			},
			{
				"id": 3726,
				"label": "engage",
				"from": 4042,
				"to": 3820
			},
			{
				"id": 3673,
				"label": "engage",
				"from": 4042,
				"to": 3781
			},
			{
				"id": 3649,
				"label": "slave",
				"from": 4042,
				"to": 4135
			},
			{
				"id": 3632,
				"label": "slave",
				"from": 4042,
				"to": 4094
			},
			{
				"id": 3609,
				"label": "slave",
				"from": 4042,
				"to": 4063
			},
			{
				"id": 3554,
				"label": "brother",
				"from": 4042,
				"to": 3874
			},
			{
				"id": 3504,
				"label": "residency",
				"from": 4042,
				"to": 3841
			},
			{
				"id": 3463,
				"label": "husband",
				"from": 4042,
				"to": 3906
			},
			{
				"id": 3424,
				"label": "father",
				"from": 4042,
				"to": 3868
			},
			{
				"id": 3727,
				"label": "engage",
				"from": 4043,
				"to": 3827
			},
			{
				"id": 3674,
				"label": "engage",
				"from": 4043,
				"to": 3781
			},
			{
				"id": 3650,
				"label": "slave",
				"from": 4043,
				"to": 4110
			},
			{
				"id": 3633,
				"label": "slave",
				"from": 4043,
				"to": 4103
			},
			{
				"id": 3610,
				"label": "slave",
				"from": 4043,
				"to": 4072
			},
			{
				"id": 3505,
				"label": "residency",
				"from": 4043,
				"to": 3842
			},
			{
				"id": 3464,
				"label": "husband",
				"from": 4043,
				"to": 3876
			},
			{
				"id": 3425,
				"label": "father",
				"from": 4043,
				"to": 3962
			},
			{
				"id": 3675,
				"label": "engage",
				"from": 4044,
				"to": 3823
			},
			{
				"id": 3611,
				"label": "slave",
				"from": 4044,
				"to": 4067
			},
			{
				"id": 3555,
				"label": "brother",
				"from": 4044,
				"to": 3876
			},
			{
				"id": 3506,
				"label": "residency",
				"from": 4044,
				"to": 3843
			},
			{
				"id": 3465,
				"label": "husband",
				"from": 4044,
				"to": 3952
			},
			{
				"id": 3444,
				"label": "mother",
				"from": 4044,
				"to": 4051
			},
			{
				"id": 3426,
				"label": "father",
				"from": 4044,
				"to": 3869
			},
			{
				"id": 3761,
				"label": "engage",
				"from": 4045,
				"to": 3830
			},
			{
				"id": 3750,
				"label": "engage",
				"from": 4045,
				"to": 3827
			},
			{
				"id": 3728,
				"label": "engage",
				"from": 4045,
				"to": 3813
			},
			{
				"id": 3676,
				"label": "engage",
				"from": 4045,
				"to": 3781
			},
			{
				"id": 3651,
				"label": "slave",
				"from": 4045,
				"to": 4111
			},
			{
				"id": 3634,
				"label": "slave",
				"from": 4045,
				"to": 4074
			},
			{
				"id": 3612,
				"label": "slave",
				"from": 4045,
				"to": 4095
			},
			{
				"id": 3572,
				"label": "godmother",
				"from": 4045,
				"to": 4169
			},
			{
				"id": 3556,
				"label": "brother",
				"from": 4045,
				"to": 3863
			},
			{
				"id": 3543,
				"label": "sister",
				"from": 4045,
				"to": 4044
			},
			{
				"id": 3507,
				"label": "residency",
				"from": 4045,
				"to": 3844
			},
			{
				"id": 3445,
				"label": "mother",
				"from": 4045,
				"to": 4047
			},
			{
				"id": 3427,
				"label": "father",
				"from": 4045,
				"to": 3869
			},
			{
				"id": 3677,
				"label": "engage",
				"from": 4046,
				"to": 3786
			},
			{
				"id": 3666,
				"label": "The maidservant accompanying the bride",
				"from": 4046,
				"to": 4125
			},
			{
				"id": 3652,
				"label": "slave",
				"from": 4046,
				"to": 4171
			},
			{
				"id": 3635,
				"label": "slave",
				"from": 4046,
				"to": 4114
			},
			{
				"id": 3613,
				"label": "slave",
				"from": 4046,
				"to": 4115
			},
			{
				"id": 3557,
				"label": "brother",
				"from": 4046,
				"to": 3904
			},
			{
				"id": 3533,
				"label": "homeland",
				"from": 4046,
				"to": 3855
			},
			{
				"id": 3508,
				"label": "residency",
				"from": 4046,
				"to": 3848
			},
			{
				"id": 3466,
				"label": "husband",
				"from": 4046,
				"to": 3868
			},
			{
				"id": 3729,
				"label": "engage",
				"from": 4047,
				"to": 3827
			},
			{
				"id": 3678,
				"label": "engage",
				"from": 4047,
				"to": 3783
			},
			{
				"id": 3636,
				"label": "slave",
				"from": 4047,
				"to": 4104
			},
			{
				"id": 3614,
				"label": "slave",
				"from": 4047,
				"to": 4096
			},
			{
				"id": 3558,
				"label": "brother",
				"from": 4047,
				"to": 3912
			},
			{
				"id": 3509,
				"label": "residency",
				"from": 4047,
				"to": 3848
			},
			{
				"id": 3467,
				"label": "husband",
				"from": 4047,
				"to": 3869
			},
			{
				"id": 3615,
				"label": "slave",
				"from": 4048,
				"to": 4120
			},
			{
				"id": 3570,
				"label": "brother",
				"from": 4048,
				"to": 3868
			},
			{
				"id": 3559,
				"label": "brother",
				"from": 4048,
				"to": 3869
			},
			{
				"id": 3534,
				"label": "homeland",
				"from": 4048,
				"to": 3855
			},
			{
				"id": 3510,
				"label": "residency",
				"from": 4048,
				"to": 3850
			},
			{
				"id": 3468,
				"label": "husband",
				"from": 4048,
				"to": 3896
			},
			{
				"id": 3446,
				"label": "mother",
				"from": 4048,
				"to": 4049
			},
			{
				"id": 3428,
				"label": "father",
				"from": 4048,
				"to": 3864
			},
			{
				"id": 3679,
				"label": "engage",
				"from": 4049,
				"to": 3786
			},
			{
				"id": 3660,
				"label": "slave",
				"from": 4049,
				"to": 4058
			},
			{
				"id": 3653,
				"label": "slave",
				"from": 4049,
				"to": 4112
			},
			{
				"id": 3637,
				"label": "slave",
				"from": 4049,
				"to": 4073
			},
			{
				"id": 3616,
				"label": "slave",
				"from": 4049,
				"to": 4057
			},
			{
				"id": 3560,
				"label": "brother",
				"from": 4049,
				"to": 3889
			},
			{
				"id": 3535,
				"label": "homeland",
				"from": 4049,
				"to": 3855
			},
			{
				"id": 3511,
				"label": "residency",
				"from": 4049,
				"to": 3848
			},
			{
				"id": 3469,
				"label": "husband",
				"from": 4049,
				"to": 3864
			},
			{
				"id": 3429,
				"label": "father",
				"from": 4049,
				"to": 3902
			},
			{
				"id": 3592,
				"label": "fond",
				"from": 4050,
				"to": 3863
			},
			{
				"id": 3577,
				"label": "知己",
				"from": 4050,
				"to": 4078
			},
			{
				"id": 3512,
				"label": "residency",
				"from": 4050,
				"to": 3846
			},
			{
				"id": 3751,
				"label": "engage",
				"from": 4051,
				"to": 3830
			},
			{
				"id": 3730,
				"label": "engage",
				"from": 4051,
				"to": 3817
			},
			{
				"id": 3680,
				"label": "engage",
				"from": 4051,
				"to": 3787
			},
			{
				"id": 3667,
				"label": "The maidservant accompanying the bride",
				"from": 4051,
				"to": 4131
			},
			{
				"id": 3664,
				"label": "slave",
				"from": 4051,
				"to": 4124
			},
			{
				"id": 3661,
				"label": "slave",
				"from": 4051,
				"to": 4113
			},
			{
				"id": 3654,
				"label": "slave",
				"from": 4051,
				"to": 4062
			},
			{
				"id": 3638,
				"label": "slave",
				"from": 4051,
				"to": 4061
			},
			{
				"id": 3617,
				"label": "slave",
				"from": 4051,
				"to": 4060
			},
			{
				"id": 3571,
				"label": "brother",
				"from": 4051,
				"to": 3943
			},
			{
				"id": 3561,
				"label": "brother",
				"from": 4051,
				"to": 3882
			},
			{
				"id": 3536,
				"label": "homeland",
				"from": 4051,
				"to": 3855
			},
			{
				"id": 3513,
				"label": "residency",
				"from": 4051,
				"to": 3848
			},
			{
				"id": 3470,
				"label": "husband",
				"from": 4051,
				"to": 3869
			},
			{
				"id": 3430,
				"label": "father",
				"from": 4051,
				"to": 3883
			},
			{
				"id": 3752,
				"label": "engage",
				"from": 4052,
				"to": 3828
			},
			{
				"id": 3731,
				"label": "engage",
				"from": 4052,
				"to": 3785
			},
			{
				"id": 3681,
				"label": "engage",
				"from": 4052,
				"to": 3781
			},
			{
				"id": 3655,
				"label": "slave",
				"from": 4052,
				"to": 4166
			},
			{
				"id": 3639,
				"label": "slave",
				"from": 4052,
				"to": 4105
			},
			{
				"id": 3618,
				"label": "slave",
				"from": 4052,
				"to": 4097
			},
			{
				"id": 3589,
				"label": "wet nurse",
				"from": 4052,
				"to": 4153
			},
			{
				"id": 3578,
				"label": "知己",
				"from": 4052,
				"to": 4037
			},
			{
				"id": 3537,
				"label": "homeland",
				"from": 4052,
				"to": 3854
			},
			{
				"id": 3471,
				"label": "husband",
				"from": 4052,
				"to": 3945
			},
			{
				"id": 3431,
				"label": "father",
				"from": 4052,
				"to": 3944
			},
			{
				"id": 3753,
				"label": "engage",
				"from": 4053,
				"to": 3822
			},
			{
				"id": 3732,
				"label": "engage",
				"from": 4053,
				"to": 3819
			},
			{
				"id": 3682,
				"label": "engage",
				"from": 4053,
				"to": 3797
			},
			{
				"id": 3640,
				"label": "slave",
				"from": 4053,
				"to": 4106
			},
			{
				"id": 3619,
				"label": "slave",
				"from": 4053,
				"to": 4087
			},
			{
				"id": 3593,
				"label": "fond",
				"from": 4053,
				"to": 3863
			},
			{
				"id": 3580,
				"label": "adultery",
				"from": 4053,
				"to": 3871
			},
			{
				"id": 3514,
				"label": "residency",
				"from": 4053,
				"to": 3849
			},
			{
				"id": 3472,
				"label": "husband",
				"from": 4053,
				"to": 3870
			},
			{
				"id": 3432,
				"label": "father",
				"from": 4053,
				"to": 3898
			},
			{
				"id": 3762,
				"label": "engage",
				"from": 4054,
				"to": 3833
			},
			{
				"id": 3754,
				"label": "engage",
				"from": 4054,
				"to": 3830
			},
			{
				"id": 3733,
				"label": "engage",
				"from": 4054,
				"to": 3825
			},
			{
				"id": 3683,
				"label": "engage",
				"from": 4054,
				"to": 3787
			},
			{
				"id": 3599,
				"label": "befriend",
				"from": 4054,
				"to": 4065
			},
			{
				"id": 3562,
				"label": "brother",
				"from": 4054,
				"to": 3913
			},
			{
				"id": 3515,
				"label": "residency",
				"from": 4054,
				"to": 3845
			},
			{
				"id": 3734,
				"label": "engage",
				"from": 4055,
				"to": 3785
			},
			{
				"id": 3684,
				"label": "engage",
				"from": 4055,
				"to": 3837
			},
			{
				"id": 3600,
				"label": "befriend",
				"from": 4055,
				"to": 4056
			},
			{
				"id": 3563,
				"label": "brother",
				"from": 4055,
				"to": 3914
			},
			{
				"id": 3516,
				"label": "residency",
				"from": 4055,
				"to": 3845
			},
			{
				"id": 3473,
				"label": "husband",
				"from": 4055,
				"to": 3893
			},
			{
				"id": 3763,
				"label": "engage",
				"from": 4056,
				"to": 3826
			},
			{
				"id": 3755,
				"label": "engage",
				"from": 4056,
				"to": 3789
			},
			{
				"id": 3735,
				"label": "engage",
				"from": 4056,
				"to": 3800
			},
			{
				"id": 3685,
				"label": "engage",
				"from": 4056,
				"to": 3799
			},
			{
				"id": 3736,
				"label": "engage",
				"from": 4057,
				"to": 3801
			},
			{
				"id": 3686,
				"label": "engage",
				"from": 4057,
				"to": 3786
			},
			{
				"id": 3564,
				"label": "brother",
				"from": 4057,
				"to": 3921
			},
			{
				"id": 3433,
				"label": "father",
				"from": 4057,
				"to": 3935
			},
			{
				"id": 3737,
				"label": "engage",
				"from": 4058,
				"to": 3831
			},
			{
				"id": 3687,
				"label": "engage",
				"from": 4058,
				"to": 3782
			},
			{
				"id": 3517,
				"label": "residency",
				"from": 4058,
				"to": 3838
			},
			{
				"id": 3688,
				"label": "engage",
				"from": 4059,
				"to": 3802
			},
			{
				"id": 3518,
				"label": "residency",
				"from": 4059,
				"to": 3839
			},
			{
				"id": 3689,
				"label": "engage",
				"from": 4060,
				"to": 3803
			},
			{
				"id": 3447,
				"label": "mother",
				"from": 4060,
				"to": 4151
			},
			{
				"id": 3738,
				"label": "engage",
				"from": 4061,
				"to": 3817
			},
			{
				"id": 3690,
				"label": "engage",
				"from": 4061,
				"to": 3804
			},
			{
				"id": 3448,
				"label": "mother",
				"from": 4061,
				"to": 4151
			},
			{
				"id": 3594,
				"label": "fond",
				"from": 4062,
				"to": 3877
			},
			{
				"id": 3756,
				"label": "engage",
				"from": 4063,
				"to": 3830
			},
			{
				"id": 3739,
				"label": "engage",
				"from": 4063,
				"to": 3801
			},
			{
				"id": 3691,
				"label": "engage",
				"from": 4063,
				"to": 3805
			},
			{
				"id": 3581,
				"label": "adultery",
				"from": 4063,
				"to": 3927
			},
			{
				"id": 3519,
				"label": "residency",
				"from": 4063,
				"to": 3841
			},
			{
				"id": 3449,
				"label": "mother",
				"from": 4063,
				"to": 4150
			},
			{
				"id": 3740,
				"label": "engage",
				"from": 4065,
				"to": 3799
			},
			{
				"id": 3692,
				"label": "engage",
				"from": 4065,
				"to": 3825
			},
			{
				"id": 3757,
				"label": "engage",
				"from": 4066,
				"to": 3834
			},
			{
				"id": 3741,
				"label": "engage",
				"from": 4066,
				"to": 3806
			},
			{
				"id": 3693,
				"label": "engage",
				"from": 4066,
				"to": 3792
			},
			{
				"id": 3620,
				"label": "slave",
				"from": 4066,
				"to": 4098
			},
			{
				"id": 3538,
				"label": "homeland",
				"from": 4066,
				"to": 3850
			},
			{
				"id": 3474,
				"label": "husband",
				"from": 4066,
				"to": 3885
			},
			{
				"id": 3450,
				"label": "mother",
				"from": 4066,
				"to": 4141
			},
			{
				"id": 3434,
				"label": "father",
				"from": 4066,
				"to": 3903
			},
			{
				"id": 3694,
				"label": "engage",
				"from": 4068,
				"to": 3811
			},
			{
				"id": 3582,
				"label": "adultery",
				"from": 4068,
				"to": 3885
			},
			{
				"id": 3695,
				"label": "engage",
				"from": 4069,
				"to": 3831
			},
			{
				"id": 3520,
				"label": "residency",
				"from": 4072,
				"to": 3842
			},
			{
				"id": 3641,
				"label": "slave",
				"from": 4075,
				"to": 4107
			},
			{
				"id": 3621,
				"label": "slave",
				"from": 4075,
				"to": 4084
			},
			{
				"id": 3565,
				"label": "brother",
				"from": 4075,
				"to": 3882
			},
			{
				"id": 3544,
				"label": "sister",
				"from": 4075,
				"to": 4051
			},
			{
				"id": 3539,
				"label": "homeland",
				"from": 4075,
				"to": 3856
			},
			{
				"id": 3521,
				"label": "residency",
				"from": 4075,
				"to": 3847
			},
			{
				"id": 3435,
				"label": "father",
				"from": 4075,
				"to": 3883
			},
			{
				"id": 3696,
				"label": "engage",
				"from": 4076,
				"to": 3811
			},
			{
				"id": 3656,
				"label": "slave",
				"from": 4076,
				"to": 4110
			},
			{
				"id": 3642,
				"label": "slave",
				"from": 4076,
				"to": 4108
			},
			{
				"id": 3622,
				"label": "slave",
				"from": 4076,
				"to": 4068
			},
			{
				"id": 3540,
				"label": "homeland",
				"from": 4076,
				"to": 3856
			},
			{
				"id": 3475,
				"label": "husband",
				"from": 4076,
				"to": 3885
			},
			{
				"id": 3643,
				"label": "slave",
				"from": 4077,
				"to": 4154
			},
			{
				"id": 3623,
				"label": "slave",
				"from": 4077,
				"to": 4099
			},
			{
				"id": 3573,
				"label": "godmother",
				"from": 4077,
				"to": 4051
			},
			{
				"id": 3566,
				"label": "brother",
				"from": 4077,
				"to": 3886
			},
			{
				"id": 3476,
				"label": "husband",
				"from": 4077,
				"to": 3946
			},
			{
				"id": 3624,
				"label": "slave",
				"from": 4078,
				"to": 4100
			},
			{
				"id": 3541,
				"label": "homeland",
				"from": 4078,
				"to": 3855
			},
			{
				"id": 3477,
				"label": "husband",
				"from": 4078,
				"to": 3886
			},
			{
				"id": 3436,
				"label": "father",
				"from": 4078,
				"to": 3904
			},
			{
				"id": 3662,
				"label": "slave",
				"from": 4079,
				"to": 4149
			},
			{
				"id": 3657,
				"label": "slave",
				"from": 4079,
				"to": 4155
			},
			{
				"id": 3644,
				"label": "slave",
				"from": 4079,
				"to": 4109
			},
			{
				"id": 3625,
				"label": "slave",
				"from": 4079,
				"to": 4101
			},
			{
				"id": 3478,
				"label": "husband",
				"from": 4079,
				"to": 3873
			},
			{
				"id": 3451,
				"label": "mother",
				"from": 4079,
				"to": 4152
			},
			{
				"id": 3742,
				"label": "engage",
				"from": 4080,
				"to": 3798
			},
			{
				"id": 3697,
				"label": "engage",
				"from": 4080,
				"to": 3788
			},
			{
				"id": 3626,
				"label": "slave",
				"from": 4080,
				"to": 4102
			},
			{
				"id": 3545,
				"label": "sister",
				"from": 4080,
				"to": 4079
			},
			{
				"id": 3479,
				"label": "husband",
				"from": 4080,
				"to": 3874
			},
			{
				"id": 3698,
				"label": "engage",
				"from": 4081,
				"to": 3829
			},
			{
				"id": 3595,
				"label": "fond",
				"from": 4081,
				"to": 3890
			},
			{
				"id": 3583,
				"label": "adultery",
				"from": 4081,
				"to": 3873
			},
			{
				"id": 3549,
				"label": "sister",
				"from": 4081,
				"to": 4079
			},
			{
				"id": 3546,
				"label": "sister",
				"from": 4081,
				"to": 4080
			},
			{
				"id": 3743,
				"label": "engage",
				"from": 4082,
				"to": 3814
			},
			{
				"id": 3699,
				"label": "engage",
				"from": 4082,
				"to": 3807
			},
			{
				"id": 3522,
				"label": "residency",
				"from": 4082,
				"to": 3853
			},
			{
				"id": 3480,
				"label": "husband",
				"from": 4083,
				"to": 3917
			},
			{
				"id": 3452,
				"label": "mother",
				"from": 4083,
				"to": 4082
			},
			{
				"id": 3700,
				"label": "engage",
				"from": 4085,
				"to": 3816
			},
			{
				"id": 3601,
				"label": "befriend",
				"from": 4085,
				"to": 4146
			},
			{
				"id": 3481,
				"label": "husband",
				"from": 4085,
				"to": 3894
			},
			{
				"id": 3453,
				"label": "mother",
				"from": 4085,
				"to": 4132
			},
			{
				"id": 3437,
				"label": "father",
				"from": 4085,
				"to": 3919
			},
			{
				"id": 3701,
				"label": "engage",
				"from": 4086,
				"to": 3826
			},
			{
				"id": 3584,
				"label": "adultery",
				"from": 4086,
				"to": 3874
			},
			{
				"id": 3482,
				"label": "husband",
				"from": 4086,
				"to": 3920
			},
			{
				"id": 3702,
				"label": "engage",
				"from": 4087,
				"to": 3819
			},
			{
				"id": 3602,
				"label": "befriend",
				"from": 4087,
				"to": 4106
			},
			{
				"id": 3596,
				"label": "fond",
				"from": 4088,
				"to": 4118
			},
			{
				"id": 3574,
				"label": "godmother",
				"from": 4088,
				"to": 4170
			},
			{
				"id": 3703,
				"label": "engage",
				"from": 4090,
				"to": 3830
			},
			{
				"id": 3523,
				"label": "residency",
				"from": 4095,
				"to": 3844
			},
			{
				"id": 3704,
				"label": "engage",
				"from": 4113,
				"to": 3808
			},
			{
				"id": 3597,
				"label": "fond",
				"from": 4113,
				"to": 3877
			},
			{
				"id": 3483,
				"label": "husband",
				"from": 4113,
				"to": 3971
			},
			{
				"id": 3705,
				"label": "engage",
				"from": 4115,
				"to": 3798
			},
			{
				"id": 3484,
				"label": "husband",
				"from": 4117,
				"to": 3891
			},
			{
				"id": 3706,
				"label": "engage",
				"from": 4119,
				"to": 3808
			},
			{
				"id": 3485,
				"label": "husband",
				"from": 4119,
				"to": 3948
			},
			{
				"id": 3707,
				"label": "engage",
				"from": 4121,
				"to": 3787
			},
			{
				"id": 3708,
				"label": "engage",
				"from": 4122,
				"to": 3789
			},
			{
				"id": 3486,
				"label": "husband",
				"from": 4122,
				"to": 3913
			},
			{
				"id": 3627,
				"label": "slave",
				"from": 4123,
				"to": 4054
			},
			{
				"id": 3487,
				"label": "husband",
				"from": 4123,
				"to": 3911
			},
			{
				"id": 3709,
				"label": "engage",
				"from": 4124,
				"to": 3827
			},
			{
				"id": 3488,
				"label": "husband",
				"from": 4124,
				"to": 3947
			},
			{
				"id": 3744,
				"label": "engage",
				"from": 4125,
				"to": 3830
			},
			{
				"id": 3710,
				"label": "engage",
				"from": 4125,
				"to": 3787
			},
			{
				"id": 3489,
				"label": "husband",
				"from": 4125,
				"to": 3939
			},
			{
				"id": 3711,
				"label": "engage",
				"from": 4126,
				"to": 3805
			},
			{
				"id": 3603,
				"label": "befriend",
				"from": 4126,
				"to": 4064
			},
			{
				"id": 3547,
				"label": "sister",
				"from": 4127,
				"to": 4043
			},
			{
				"id": 3454,
				"label": "mother",
				"from": 4127,
				"to": 4129
			},
			{
				"id": 3550,
				"label": "sister",
				"from": 4128,
				"to": 4127
			},
			{
				"id": 3548,
				"label": "sister",
				"from": 4128,
				"to": 4043
			},
			{
				"id": 3455,
				"label": "mother",
				"from": 4128,
				"to": 4129
			},
			{
				"id": 3490,
				"label": "husband",
				"from": 4129,
				"to": 3950
			},
			{
				"id": 3567,
				"label": "brother",
				"from": 4130,
				"to": 3905
			},
			{
				"id": 3456,
				"label": "mother",
				"from": 4130,
				"to": 4083
			},
			{
				"id": 3438,
				"label": "father",
				"from": 4130,
				"to": 3917
			},
			{
				"id": 3745,
				"label": "engage",
				"from": 4131,
				"to": 3830
			},
			{
				"id": 3712,
				"label": "engage",
				"from": 4131,
				"to": 3814
			},
			{
				"id": 3491,
				"label": "husband",
				"from": 4131,
				"to": 3918
			},
			{
				"id": 3575,
				"label": "godmother",
				"from": 4132,
				"to": 4041
			},
			{
				"id": 3492,
				"label": "husband",
				"from": 4132,
				"to": 3919
			},
			{
				"id": 3713,
				"label": "engage",
				"from": 4133,
				"to": 3800
			},
			{
				"id": 3457,
				"label": "mother",
				"from": 4133,
				"to": 4126
			},
			{
				"id": 3714,
				"label": "engage",
				"from": 4134,
				"to": 3800
			},
			{
				"id": 3715,
				"label": "engage",
				"from": 4135,
				"to": 3805
			},
			{
				"id": 3493,
				"label": "husband",
				"from": 4136,
				"to": 3878
			},
			{
				"id": 3569,
				"label": "brother",
				"from": 4138,
				"to": 3941
			},
			{
				"id": 3494,
				"label": "husband",
				"from": 4139,
				"to": 3931
			},
			{
				"id": 3598,
				"label": "fond",
				"from": 4140,
				"to": 3871
			},
			{
				"id": 3524,
				"label": "residency",
				"from": 4141,
				"to": 3850
			},
			{
				"id": 3495,
				"label": "husband",
				"from": 4141,
				"to": 3903
			},
			{
				"id": 3439,
				"label": "father",
				"from": 4141,
				"to": 3949
			},
			{
				"id": 3746,
				"label": "engage",
				"from": 4146,
				"to": 3816
			},
			{
				"id": 3716,
				"label": "engage",
				"from": 4146,
				"to": 3799
			},
			{
				"id": 3717,
				"label": "engage",
				"from": 4147,
				"to": 3810
			},
			{
				"id": 3585,
				"label": "adultery",
				"from": 4147,
				"to": 3881
			},
			{
				"id": 3718,
				"label": "engage",
				"from": 4148,
				"to": 3809
			},
			{
				"id": 3586,
				"label": "adultery",
				"from": 4149,
				"to": 3926
			},
			{
				"id": 3458,
				"label": "mother",
				"from": 4150,
				"to": 4125
			},
			{
				"id": 3496,
				"label": "husband",
				"from": 4162,
				"to": 3910
			},
			{
				"id": 3459,
				"label": "mother",
				"from": 4163,
				"to": 4164
			},
			{
				"id": 3719,
				"label": "engage",
				"from": 4167,
				"to": 3797
			},
			{
				"id": 3525,
				"label": "residency",
				"from": 4167,
				"to": 3860
			},
			{
				"id": 3720,
				"label": "engage",
				"from": 4168,
				"to": 3783
			},
			{
				"id": 3604,
				"label": "befriend",
				"from": 4168,
				"to": 4047
			},
			{
				"id": 3526,
				"label": "residency",
				"from": 4168,
				"to": 3853
			},
			{
				"id": 3721,
				"label": "engage",
				"from": 4169,
				"to": 3813
			},
			{
				"id": 3527,
				"label": "residency",
				"from": 4169,
				"to": 3859
			},
			{
				"id": 3497,
				"label": "husband",
				"from": 4169,
				"to": 3960
			},
			{
				"id": 3498,
				"label": "husband",
				"from": 4172,
				"to": 3940
			},
			{
				"id": 3460,
				"label": "mother",
				"from": 4172,
				"to": 4131
			},
			{
				"id": 3440,
				"label": "father",
				"from": 4172,
				"to": 3918
			},
			{
				"id": 3722,
				"label": "engage",
				"from": 4173,
				"to": 3836
			}
		]
	}
}
